AlexNetWrapper(
  (_features): Sequential(
    (0): Conv2d(3, 64, kernel_size=(11, 11), stride=(4, 4), padding=(2, 2))
    (1): ReLU(inplace)
    (2): MaxPool2d(kernel_size=3, stride=2, padding=0, dilation=1, ceil_mode=False)
    (3): Conv2d(64, 192, kernel_size=(5, 5), stride=(1, 1), padding=(2, 2))
    (4): ReLU(inplace)
    (5): MaxPool2d(kernel_size=3, stride=2, padding=0, dilation=1, ceil_mode=False)
    (6): Conv2d(192, 384, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    (7): ReLU(inplace)
    (8): Conv2d(384, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    (9): ReLU(inplace)
    (10): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    (11): ReLU(inplace)
    (12): MaxPool2d(kernel_size=3, stride=2, padding=0, dilation=1, ceil_mode=False)
  )
  (_classifier): Sequential(
    (0): Linear(in_features=9216, out_features=4096, bias=True)
    (1): ReLU(inplace)
    (2): Dropout(p=0.5)
    (3): Linear(in_features=4096, out_features=4096, bias=True)
    (4): ReLU(inplace)
    (5): Linear(in_features=4096, out_features=4, bias=True)
  )
)
train patients [42 40 24 53  2 55 22 17 29 18 51  8 14  5 19 43 15 46  7 45  1 34 13 44
 31  6 30 47 25 23 10 50 54  3  0]
train labels [1111 2105  798 3241]
test patients [41 48 35  4 11 32 36 12 49]
test labels [ 358 1072  408  353]

[train epoch 1/50] | loss 1.0626 | nw acc 0.559 | time 3 min 23 sec
cat 0: [100, 8, 7, 11] and [0.7937, 0.0635, 0.0556, 0.0873]
cat 1: [84, 910, 71, 164] and [0.0683, 0.7404, 0.0578, 0.1334]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [927, 1187, 720, 3066] and [0.1571, 0.2012, 0.122, 0.5197]
[test epoch 1/50] | loss 0.368 | nw acc 0.395 | time 0 min 44 sec
cat 0: [48, 83, 9, 0] and [0.3429, 0.5929, 0.0643, 0.0]
cat 1: [97, 496, 126, 13] and [0.1325, 0.6776, 0.1721, 0.0178]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [213, 493, 273, 340] and [0.1615, 0.3738, 0.207, 0.2578]
[train epoch 2/50] | loss 0.71513 | nw acc 0.725 | time 3 min 23 sec
cat 0: [699, 69, 31, 122] and [0.759, 0.0749, 0.0337, 0.1325]
cat 1: [63, 1735, 154, 282] and [0.0282, 0.7766, 0.0689, 0.1262]
cat 2: [1, 3, 22, 4] and [0.0333, 0.1, 0.7333, 0.1333]
cat 3: [348, 298, 591, 2833] and [0.0855, 0.0732, 0.1452, 0.6961]
[test epoch 2/50] | loss 0.335 | nw acc 0.533 | time 0 min 44 sec
cat 0: [231, 209, 38, 7] and [0.4763, 0.4309, 0.0784, 0.0144]
cat 1: [39, 534, 111, 24] and [0.0551, 0.7542, 0.1568, 0.0339]
cat 2: [13, 169, 110, 2] and [0.0442, 0.5748, 0.3741, 0.0068]
cat 3: [75, 160, 149, 320] and [0.1065, 0.2273, 0.2116, 0.4545]
[train epoch 3/50] | loss 0.56192 | nw acc 0.785 | time 3 min 22 sec
cat 0: [883, 45, 36, 130] and [0.8071, 0.0411, 0.0329, 0.1188]
cat 1: [28, 1803, 154, 221] and [0.0127, 0.8173, 0.0698, 0.1002]
cat 2: [13, 31, 180, 32] and [0.0508, 0.1211, 0.7031, 0.125]
cat 3: [187, 226, 428, 2858] and [0.0506, 0.0611, 0.1157, 0.7726]
[test epoch 3/50] | loss 0.297 | nw acc 0.606 | time 0 min 44 sec
cat 0: [227, 142, 13, 7] and [0.5835, 0.365, 0.0334, 0.018]
cat 1: [55, 632, 134, 57] and [0.0626, 0.7198, 0.1526, 0.0649]
cat 2: [25, 204, 230, 20] and [0.0522, 0.4259, 0.4802, 0.0418]
cat 3: [51, 94, 31, 269] and [0.1146, 0.2112, 0.0697, 0.6045]
[train epoch 4/50] | loss 0.44142 | nw acc 0.84 | time 3 min 21 sec
cat 0: [983, 32, 30, 110] and [0.8511, 0.0277, 0.026, 0.0952]
cat 1: [10, 1868, 128, 136] and [0.0047, 0.8721, 0.0598, 0.0635]
cat 2: [10, 39, 349, 67] and [0.0215, 0.0839, 0.7505, 0.1441]
cat 3: [108, 166, 291, 2928] and [0.0309, 0.0475, 0.0833, 0.8382]
[test epoch 4/50] | loss 0.343 | nw acc 0.6 | time 0 min 43 sec
cat 0: [62, 8, 1, 1] and [0.8611, 0.1111, 0.0139, 0.0139]
cat 1: [228, 962, 246, 155] and [0.1433, 0.6047, 0.1546, 0.0974]
cat 2: [19, 68, 138, 16] and [0.0788, 0.2822, 0.5726, 0.0664]
cat 3: [49, 34, 23, 181] and [0.1707, 0.1185, 0.0801, 0.6307]
[train epoch 5/50] | loss 0.38072 | nw acc 0.866 | time 3 min 20 sec
cat 0: [1023, 19, 26, 85] and [0.8873, 0.0165, 0.0225, 0.0737]
cat 1: [13, 1895, 119, 139] and [0.006, 0.8749, 0.0549, 0.0642]
cat 2: [10, 46, 453, 73] and [0.0172, 0.079, 0.7784, 0.1254]
cat 3: [65, 145, 200, 2944] and [0.0194, 0.0432, 0.0596, 0.8778]
[test epoch 5/50] | loss 0.371 | nw acc 0.538 | time 0 min 42 sec
cat 0: [178, 77, 2, 4] and [0.682, 0.295, 0.0077, 0.0153]
cat 1: [41, 517, 65, 96] and [0.057, 0.7191, 0.0904, 0.1335]
cat 2: [120, 430, 340, 82] and [0.1235, 0.4424, 0.3498, 0.0844]
cat 3: [19, 48, 1, 171] and [0.0795, 0.2008, 0.0042, 0.7155]
[train epoch 6/50] | loss 0.31471 | nw acc 0.89 | time 3 min 7 sec
cat 0: [1053, 9, 26, 58] and [0.9188, 0.0079, 0.0227, 0.0506]
cat 1: [13, 1926, 100, 106] and [0.0061, 0.8979, 0.0466, 0.0494]
cat 2: [5, 45, 509, 73] and [0.0079, 0.0712, 0.8054, 0.1155]
cat 3: [40, 125, 163, 3004] and [0.012, 0.0375, 0.0489, 0.9016]
[test epoch 6/50] | loss 0.298 | nw acc 0.613 | time 0 min 45 sec
cat 0: [204, 65, 3, 6] and [0.7338, 0.2338, 0.0108, 0.0216]
cat 1: [69, 740, 172, 108] and [0.0634, 0.6795, 0.1579, 0.0992]
cat 2: [48, 210, 222, 33] and [0.0936, 0.4094, 0.4327, 0.0643]
cat 3: [37, 57, 11, 206] and [0.119, 0.1833, 0.0354, 0.6624]
[train epoch 7/50] | loss 0.28172 | nw acc 0.903 | time 3 min 46 sec
cat 0: [1061, 5, 23, 49] and [0.9323, 0.0044, 0.0202, 0.0431]
cat 1: [13, 1946, 87, 101] and [0.0061, 0.9064, 0.0405, 0.047]
cat 2: [4, 45, 555, 62] and [0.006, 0.0676, 0.8333, 0.0931]
cat 3: [33, 109, 133, 3029] and [0.01, 0.033, 0.0403, 0.9168]
[test epoch 7/50] | loss 0.343 | nw acc 0.569 | time 0 min 44 sec
cat 0: [173, 54, 2, 3] and [0.7457, 0.2328, 0.0086, 0.0129]
cat 1: [44, 577, 105, 48] and [0.0568, 0.7455, 0.1357, 0.062]
cat 2: [67, 278, 247, 24] and [0.1088, 0.4513, 0.401, 0.039]
cat 3: [74, 163, 54, 278] and [0.1301, 0.2865, 0.0949, 0.4886]
[train epoch 8/50] | loss 0.23265 | nw acc 0.92 | time 3 min 31 sec
cat 0: [1080, 6, 23, 42] and [0.9383, 0.0052, 0.02, 0.0365]
cat 1: [12, 1963, 77, 75] and [0.0056, 0.9229, 0.0362, 0.0353]
cat 2: [0, 55, 593, 47] and [0.0, 0.0791, 0.8532, 0.0676]
cat 3: [19, 81, 105, 3077] and [0.0058, 0.0247, 0.032, 0.9375]
[test epoch 8/50] | loss 0.311 | nw acc 0.626 | time 0 min 46 sec
cat 0: [197, 46, 4, 6] and [0.7787, 0.1818, 0.0158, 0.0237]
cat 1: [71, 803, 186, 120] and [0.0602, 0.6805, 0.1576, 0.1017]
cat 2: [49, 171, 207, 31] and [0.107, 0.3734, 0.452, 0.0677]
cat 3: [41, 52, 11, 196] and [0.1367, 0.1733, 0.0367, 0.6533]
[train epoch 9/50] | loss 0.20508 | nw acc 0.928 | time 3 min 35 sec
cat 0: [1081, 4, 23, 35] and [0.9458, 0.0035, 0.0201, 0.0306]
cat 1: [11, 1979, 69, 58] and [0.0052, 0.9348, 0.0326, 0.0274]
cat 2: [0, 44, 615, 55] and [0.0, 0.0616, 0.8613, 0.077]
cat 3: [19, 78, 91, 3093] and [0.0058, 0.0238, 0.0277, 0.9427]
[test epoch 9/50] | loss 0.329 | nw acc 0.621 | time 0 min 58 sec
cat 0: [200, 51, 7, 7] and [0.7547, 0.1925, 0.0264, 0.0264]
cat 1: [81, 852, 218, 123] and [0.0636, 0.6688, 0.1711, 0.0965]
cat 2: [31, 109, 137, 20] and [0.1044, 0.367, 0.4613, 0.0673]
cat 3: [46, 60, 46, 203] and [0.1296, 0.169, 0.1296, 0.5718]
[train epoch 10/50] | loss 0.1719 | nw acc 0.936 | time 3 min 50 sec
cat 0: [1079, 6, 18, 29] and [0.9532, 0.0053, 0.0159, 0.0256]
cat 1: [12, 1999, 64, 53] and [0.0056, 0.9394, 0.0301, 0.0249]
cat 2: [1, 43, 640, 45] and [0.0014, 0.059, 0.8779, 0.0617]
cat 3: [19, 57, 76, 3114] and [0.0058, 0.0175, 0.0233, 0.9535]
[test epoch 10/50] | loss 0.343 | nw acc 0.595 | time 0 min 48 sec
cat 0: [175, 33, 3, 2] and [0.8216, 0.1549, 0.0141, 0.0094]
cat 1: [63, 737, 162, 69] and [0.0611, 0.7148, 0.1571, 0.0669]
cat 2: [49, 153, 158, 20] and [0.1289, 0.4026, 0.4158, 0.0526]
cat 3: [71, 149, 85, 262] and [0.1252, 0.2628, 0.1499, 0.4621]
[train epoch 11/50] | loss 0.15443 | nw acc 0.945 | time 3 min 29 sec
cat 0: [1094, 4, 15, 21] and [0.9647, 0.0035, 0.0132, 0.0185]
cat 1: [8, 2014, 54, 49] and [0.0038, 0.9478, 0.0254, 0.0231]
cat 2: [1, 32, 659, 44] and [0.0014, 0.0435, 0.8954, 0.0598]
cat 3: [8, 55, 70, 3127] and [0.0025, 0.0169, 0.0215, 0.9592]
[test epoch 11/50] | loss 0.378 | nw acc 0.588 | time 0 min 44 sec
cat 0: [167, 28, 6, 3] and [0.8186, 0.1373, 0.0294, 0.0147]
cat 1: [60, 787, 187, 68] and [0.0544, 0.7142, 0.1697, 0.0617]
cat 2: [22, 76, 89, 7] and [0.1134, 0.3918, 0.4588, 0.0361]
cat 3: [109, 181, 126, 275] and [0.1577, 0.2619, 0.1823, 0.398]
[train epoch 12/50] | loss 0.12968 | nw acc 0.953 | time 3 min 38 sec
cat 0: [1090, 1, 14, 17] and [0.9715, 0.0009, 0.0125, 0.0152]
cat 1: [7, 2030, 44, 42] and [0.0033, 0.9562, 0.0207, 0.0198]
cat 2: [0, 28, 680, 28] and [0.0, 0.038, 0.9239, 0.038]
cat 3: [14, 46, 60, 3154] and [0.0043, 0.0141, 0.0183, 0.9633]
[test epoch 12/50] | loss 0.349 | nw acc 0.604 | time 0 min 45 sec
cat 0: [212, 61, 5, 6] and [0.7465, 0.2148, 0.0176, 0.0211]
cat 1: [30, 651, 118, 62] and [0.0348, 0.7561, 0.137, 0.072]
cat 2: [70, 243, 231, 27] and [0.1226, 0.4256, 0.4046, 0.0473]
cat 3: [46, 117, 54, 258] and [0.0968, 0.2463, 0.1137, 0.5432]
