AlexNet(
  (conv1): Sequential(
    (0): Conv2d(3, 64, kernel_size=(11, 11), stride=(4, 4), padding=(2, 2))
    (1): ReLU(inplace)
    (2): MaxPool2d(kernel_size=3, stride=2, padding=0, dilation=1, ceil_mode=False)
  )
  (conv2): Sequential(
    (0): Conv2d(64, 192, kernel_size=(5, 5), stride=(1, 1), padding=(2, 2))
    (1): ReLU(inplace)
    (2): MaxPool2d(kernel_size=3, stride=2, padding=0, dilation=1, ceil_mode=False)
  )
  (conv3): Sequential(
    (0): Conv2d(192, 384, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    (1): ReLU(inplace)
  )
  (conv4): Sequential(
    (0): Conv2d(384, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    (1): ReLU(inplace)
  )
  (conv5): Sequential(
    (0): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    (1): ReLU(inplace)
    (2): MaxPool2d(kernel_size=3, stride=2, padding=0, dilation=1, ceil_mode=False)
  )
  (fc1): Sequential(
    (0): Dropout(p=0.5)
    (1): Linear(in_features=9216, out_features=4096, bias=True)
    (2): ReLU(inplace)
  )
  (fc2): Sequential(
    (0): Dropout(p=0.5)
    (1): Linear(in_features=4096, out_features=4096, bias=True)
    (2): ReLU(inplace)
  )
  (fc3): Sequential(
    (0): Linear(in_features=4096, out_features=4, bias=True)
    (1): Softmax()
  )
)
Child conv1 layer 0 param is frozenChild conv1 layer 0 param is frozenChild conv2 layer 0 param is frozenChild conv2 layer 0 param is frozenChild conv3 layer 0 param is frozenChild conv3 layer 0 param is frozenChild conv4 layer 0 param is frozenChild conv4 layer 0 param is frozenChild conv5 layer 0 param is frozenChild conv5 layer 0 param is frozenChild fc1 layer 1 param is not frozenChild fc1 layer 1 param is not frozenChild fc2 layer 1 param is not frozenChild fc2 layer 1 param is not frozenChild fc3 layer 0 param is not frozenChild fc3 layer 0 param is not frozentrain patients [44 55 43 30 19 42 40 47 51  4 31 15 11 50 34 35 49 24 22 32  6 36 14  7
 54  1 18  0 17  5 12 10  8 13 48]
train labels [1442 2801 1206 2082]
test patients [ 3  2 41 25 29 53 23 46 45]
test labels [  27  376    0 1512]

[train epoch 1/100] | loss 1.3391 | nw acc 0.379 | time 5 min 9 sec
cat 0: [29, 42, 16, 25] and [0.2589, 0.375, 0.1429, 0.2232]
cat 1: [1042, 2118, 914, 1243] and [0.196, 0.3983, 0.1719, 0.2338]
cat 2: [110, 257, 103, 203] and [0.1634, 0.3819, 0.153, 0.3016]
cat 3: [261, 384, 173, 611] and [0.1826, 0.2687, 0.1211, 0.4276]
[test epoch 1/100] | loss 0.333 | nw acc 0.273 | time 2 min 30 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [27, 373, 0, 1362] and [0.0153, 0.2117, 0.0, 0.773]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 3, 0, 150] and [0.0, 0.0196, 0.0, 0.9804]
[train epoch 2/100] | loss 1.2902 | nw acc 0.454 | time 1 min 4 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [1203, 2474, 1027, 1130] and [0.2062, 0.4241, 0.176, 0.1937]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [239, 327, 179, 952] and [0.1408, 0.1927, 0.1055, 0.561]
[test epoch 2/100] | loss 0.32 | nw acc 0.412 | time 1 min 23 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [25, 320, 0, 1043] and [0.018, 0.2305, 0.0, 0.7514]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [2, 56, 0, 469] and [0.0038, 0.1063, 0.0, 0.8899]
[train epoch 3/100] | loss 1.2727 | nw acc 0.463 | time 1 min 3 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [1083, 2397, 948, 980] and [0.2003, 0.4432, 0.1753, 0.1812]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [359, 404, 258, 1102] and [0.1691, 0.1903, 0.1215, 0.5191]
[test epoch 3/100] | loss 0.317 | nw acc 0.454 | time 1 min 23 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [26, 317, 0, 959] and [0.02, 0.2435, 0.0, 0.7366]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 59, 0, 553] and [0.0016, 0.0962, 0.0, 0.9021]
[train epoch 4/100] | loss 1.26 | nw acc 0.477 | time 1 min 4 sec
cat 0: [3, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [1046, 2411, 935, 891] and [0.198, 0.4564, 0.177, 0.1687]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [393, 390, 271, 1191] and [0.1751, 0.1737, 0.1207, 0.5305]
[test epoch 4/100] | loss 0.319 | nw acc 0.468 | time 1 min 26 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [24, 325, 0, 941] and [0.0186, 0.2519, 0.0, 0.7295]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [3, 51, 0, 571] and [0.0048, 0.0816, 0.0, 0.9136]
[train epoch 5/100] | loss 1.2495 | nw acc 0.493 | time 1 min 6 sec
cat 0: [140, 18, 9, 22] and [0.7407, 0.0952, 0.0476, 0.1164]
cat 1: [951, 2390, 954, 869] and [0.1842, 0.4628, 0.1847, 0.1683]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [351, 393, 243, 1191] and [0.1612, 0.1804, 0.1116, 0.5468]
[test epoch 5/100] | loss 0.32 | nw acc 0.475 | time 1 min 25 sec
cat 0: [1, 1, 0, 91] and [0.0108, 0.0108, 0.0, 0.9785]
cat 1: [25, 315, 0, 828] and [0.0214, 0.2697, 0.0, 0.7089]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 60, 0, 593] and [0.0015, 0.0917, 0.0, 0.9067]
[train epoch 6/100] | loss 1.2413 | nw acc 0.513 | time 1 min 6 sec
cat 0: [368, 86, 47, 84] and [0.6291, 0.147, 0.0803, 0.1436]
cat 1: [778, 2344, 934, 835] and [0.1591, 0.4792, 0.191, 0.1707]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [296, 371, 225, 1163] and [0.144, 0.1805, 0.1095, 0.5659]
[test epoch 6/100] | loss 0.321 | nw acc 0.457 | time 1 min 26 sec
cat 0: [3, 3, 0, 182] and [0.016, 0.016, 0.0, 0.9681]
cat 1: [22, 327, 0, 785] and [0.0194, 0.2884, 0.0, 0.6922]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [2, 46, 0, 545] and [0.0034, 0.0776, 0.0, 0.9191]
[train epoch 7/100] | loss 1.2338 | nw acc 0.52 | time 1 min 6 sec
cat 0: [434, 130, 75, 111] and [0.5787, 0.1733, 0.1, 0.148]
cat 1: [736, 2320, 881, 795] and [0.1555, 0.4903, 0.1862, 0.168]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [272, 351, 250, 1176] and [0.1327, 0.1713, 0.122, 0.5739]
[test epoch 7/100] | loss 0.322 | nw acc 0.459 | time 1 min 31 sec
cat 0: [3, 4, 0, 192] and [0.0151, 0.0201, 0.0, 0.9648]
cat 1: [23, 341, 0, 785] and [0.02, 0.2968, 0.0, 0.6832]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 31, 0, 535] and [0.0018, 0.0547, 0.0, 0.9436]
[train epoch 8/100] | loss 1.2273 | nw acc 0.518 | time 1 min 24 sec
cat 0: [469, 147, 105, 149] and [0.5391, 0.169, 0.1207, 0.1713]
cat 1: [691, 2289, 867, 779] and [0.1494, 0.4948, 0.1874, 0.1684]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [282, 365, 234, 1154] and [0.1386, 0.1794, 0.115, 0.5671]
[test epoch 8/100] | loss 0.324 | nw acc 0.445 | time 1 min 46 sec
cat 0: [4, 6, 0, 215] and [0.0178, 0.0267, 0.0, 0.9556]
cat 1: [22, 345, 0, 794] and [0.0189, 0.2972, 0.0, 0.6839]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 25, 0, 503] and [0.0019, 0.0473, 0.0, 0.9509]
[train epoch 9/100] | loss 1.2258 | nw acc 0.517 | time 1 min 30 sec
cat 0: [492, 171, 117, 160] and [0.5234, 0.1819, 0.1245, 0.1702]
cat 1: [685, 2278, 848, 784] and [0.1491, 0.4958, 0.1845, 0.1706]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [265, 352, 241, 1138] and [0.1328, 0.1764, 0.1207, 0.5701]
[test epoch 9/100] | loss 0.323 | nw acc 0.455 | time 1 min 59 sec
cat 0: [3, 3, 0, 207] and [0.0141, 0.0141, 0.0, 0.9718]
cat 1: [22, 355, 0, 792] and [0.0188, 0.3037, 0.0, 0.6775]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [2, 18, 0, 513] and [0.0038, 0.0338, 0.0, 0.9625]
[train epoch 10/100] | loss 1.2209 | nw acc 0.522 | time 1 min 22 sec
cat 0: [490, 182, 130, 168] and [0.5052, 0.1876, 0.134, 0.1732]
cat 1: [680, 2283, 835, 745] and [0.1497, 0.5025, 0.1838, 0.164]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [272, 336, 241, 1169] and [0.1348, 0.1665, 0.1194, 0.5793]
[test epoch 10/100] | loss 0.323 | nw acc 0.458 | time 1 min 53 sec
cat 0: [3, 6, 0, 231] and [0.0125, 0.025, 0.0, 0.9625]
cat 1: [23, 352, 0, 759] and [0.0203, 0.3104, 0.0, 0.6693]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 18, 0, 522] and [0.0018, 0.0333, 0.0, 0.9649]
[train epoch 11/100] | loss 1.2175 | nw acc 0.525 | time 1 min 20 sec
cat 0: [545, 201, 132, 155] and [0.5276, 0.1946, 0.1278, 0.15]
cat 1: [665, 2268, 824, 772] and [0.1468, 0.5008, 0.1819, 0.1705]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [232, 332, 250, 1155] and [0.1178, 0.1686, 0.127, 0.5866]
[test epoch 11/100] | loss 0.324 | nw acc 0.446 | time 1 min 45 sec
cat 0: [3, 5, 0, 228] and [0.0127, 0.0212, 0.0, 0.9661]
cat 1: [21, 358, 0, 791] and [0.0179, 0.306, 0.0, 0.6761]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [3, 13, 0, 493] and [0.0059, 0.0255, 0.0, 0.9686]
[train epoch 12/100] | loss 1.2148 | nw acc 0.524 | time 1 min 30 sec
cat 0: [524, 186, 140, 170] and [0.5137, 0.1824, 0.1373, 0.1667]
cat 1: [681, 2301, 831, 780] and [0.1483, 0.501, 0.1809, 0.1698]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [237, 314, 235, 1132] and [0.1236, 0.1637, 0.1225, 0.5902]
[test epoch 12/100] | loss 0.321 | nw acc 0.457 | time 1 min 51 sec
cat 0: [8, 12, 0, 286] and [0.0261, 0.0392, 0.0, 0.9346]
cat 1: [18, 347, 0, 706] and [0.0168, 0.324, 0.0, 0.6592]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 17, 0, 520] and [0.0019, 0.0316, 0.0, 0.9665]
[train epoch 13/100] | loss 1.2106 | nw acc 0.531 | time 1 min 24 sec
cat 0: [570, 211, 143, 184] and [0.5144, 0.1904, 0.1291, 0.1661]
cat 1: [631, 2260, 832, 720] and [0.142, 0.5087, 0.1873, 0.1621]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [241, 330, 231, 1178] and [0.1217, 0.1667, 0.1167, 0.5949]
[test epoch 13/100] | loss 0.317 | nw acc 0.478 | time 2 min 5 sec
cat 0: [5, 9, 0, 256] and [0.0185, 0.0333, 0.0, 0.9481]
cat 1: [21, 348, 0, 693] and [0.0198, 0.3277, 0.0, 0.6525]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 19, 0, 563] and [0.0017, 0.0326, 0.0, 0.9657]
[train epoch 14/100] | loss 1.2079 | nw acc 0.533 | time 2 min 15 sec
cat 0: [570, 210, 147, 196] and [0.5076, 0.187, 0.1309, 0.1745]
cat 1: [640, 2277, 835, 707] and [0.1435, 0.5107, 0.1873, 0.1586]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [232, 314, 224, 1179] and [0.119, 0.1611, 0.1149, 0.6049]
[test epoch 14/100] | loss 0.316 | nw acc 0.479 | time 3 min 23 sec
cat 0: [5, 9, 0, 252] and [0.0188, 0.0338, 0.0, 0.9474]
cat 1: [21, 340, 0, 687] and [0.02, 0.3244, 0.0, 0.6555]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 27, 0, 573] and [0.0017, 0.0449, 0.0, 0.9534]
[train epoch 15/100] | loss 1.2074 | nw acc 0.533 | time 2 min 33 sec
cat 0: [574, 199, 142, 214] and [0.5084, 0.1763, 0.1258, 0.1895]
cat 1: [647, 2267, 807, 683] and [0.1469, 0.5148, 0.1832, 0.1551]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [221, 335, 257, 1185] and [0.1106, 0.1677, 0.1286, 0.5931]
[test epoch 15/100] | loss 0.317 | nw acc 0.476 | time 3 min 14 sec
cat 0: [5, 8, 0, 250] and [0.019, 0.0304, 0.0, 0.9506]
cat 1: [21, 350, 0, 705] and [0.0195, 0.3253, 0.0, 0.6552]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 18, 0, 557] and [0.0017, 0.0312, 0.0, 0.967]
[train epoch 16/100] | loss 1.2066 | nw acc 0.532 | time 4 min 6 sec
cat 0: [609, 217, 155, 188] and [0.521, 0.1856, 0.1326, 0.1608]
cat 1: [617, 2255, 805, 744] and [0.1396, 0.5101, 0.1821, 0.1683]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [216, 329, 246, 1150] and [0.1113, 0.1695, 0.1267, 0.5925]
[test epoch 16/100] | loss 0.318 | nw acc 0.472 | time 5 min 31 sec
cat 0: [6, 11, 0, 272] and [0.0208, 0.0381, 0.0, 0.9412]
cat 1: [18, 350, 0, 693] and [0.017, 0.3299, 0.0, 0.6532]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [3, 15, 0, 547] and [0.0053, 0.0265, 0.0, 0.9681]
[train epoch 17/100] | loss 1.2037 | nw acc 0.535 | time 4 min 1 sec
cat 0: [611, 243, 151, 197] and [0.5083, 0.2022, 0.1256, 0.1639]
cat 1: [635, 2240, 810, 698] and [0.1449, 0.5111, 0.1848, 0.1593]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [196, 318, 245, 1187] and [0.1007, 0.1634, 0.1259, 0.61]
[test epoch 17/100] | loss 0.317 | nw acc 0.485 | time 4 min 3 sec
cat 0: [5, 9, 0, 259] and [0.0183, 0.033, 0.0, 0.9487]
cat 1: [21, 351, 0, 680] and [0.02, 0.3337, 0.0, 0.6464]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 16, 0, 573] and [0.0017, 0.0271, 0.0, 0.9712]
[train epoch 18/100] | loss 1.2016 | nw acc 0.542 | time 3 min 58 sec
cat 0: [604, 225, 165, 179] and [0.5149, 0.1918, 0.1407, 0.1526]
cat 1: [633, 2274, 806, 691] and [0.1437, 0.5163, 0.183, 0.1569]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [205, 302, 235, 1212] and [0.1049, 0.1546, 0.1203, 0.6203]
[test epoch 18/100] | loss 0.314 | nw acc 0.487 | time 4 min 12 sec
cat 0: [7, 11, 0, 260] and [0.0252, 0.0396, 0.0, 0.9353]
cat 1: [19, 342, 0, 668] and [0.0185, 0.3324, 0.0, 0.6492]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 23, 0, 584] and [0.0016, 0.0378, 0.0, 0.9605]
[train epoch 19/100] | loss 1.2025 | nw acc 0.536 | time 3 min 44 sec
cat 0: [631, 244, 161, 195] and [0.5126, 0.1982, 0.1308, 0.1584]
cat 1: [615, 2243, 780, 711] and [0.1414, 0.5158, 0.1794, 0.1635]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [196, 314, 265, 1176] and [0.1005, 0.1609, 0.1358, 0.6028]
[test epoch 19/100] | loss 0.32 | nw acc 0.465 | time 4 min 18 sec
cat 0: [6, 15, 0, 273] and [0.0204, 0.051, 0.0, 0.9286]
cat 1: [20, 347, 0, 702] and [0.0187, 0.3246, 0.0, 0.6567]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 14, 0, 537] and [0.0018, 0.0254, 0.0, 0.9728]
[train epoch 20/100] | loss 1.1977 | nw acc 0.543 | time 3 min 43 sec
cat 0: [637, 226, 176, 199] and [0.5145, 0.1826, 0.1422, 0.1607]
cat 1: [604, 2258, 804, 677] and [0.1391, 0.5199, 0.1851, 0.1559]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [201, 317, 226, 1206] and [0.1031, 0.1626, 0.1159, 0.6185]
[test epoch 20/100] | loss 0.316 | nw acc 0.487 | time 4 min 15 sec
cat 0: [4, 5, 0, 234] and [0.0165, 0.0206, 0.0, 0.963]
cat 1: [20, 349, 0, 699] and [0.0187, 0.3268, 0.0, 0.6545]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [3, 22, 0, 579] and [0.005, 0.0364, 0.0, 0.9586]
[train epoch 21/100] | loss 1.1992 | nw acc 0.539 | time 3 min 48 sec
cat 0: [622, 229, 139, 195] and [0.5249, 0.1932, 0.1173, 0.1646]
cat 1: [604, 2251, 809, 686] and [0.1389, 0.5175, 0.186, 0.1577]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [216, 321, 258, 1201] and [0.1082, 0.1608, 0.1293, 0.6017]
[test epoch 21/100] | loss 0.317 | nw acc 0.478 | time 4 min 19 sec
cat 0: [6, 6, 0, 238] and [0.024, 0.024, 0.0, 0.952]
cat 1: [20, 357, 0, 721] and [0.0182, 0.3251, 0.0, 0.6566]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 13, 0, 553] and [0.0018, 0.0229, 0.0, 0.9753]
[train epoch 22/100] | loss 1.1933 | nw acc 0.548 | time 3 min 41 sec
cat 0: [637, 218, 143, 201] and [0.5313, 0.1818, 0.1193, 0.1676]
cat 1: [603, 2313, 825, 695] and [0.1359, 0.5214, 0.186, 0.1567]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [202, 270, 238, 1186] and [0.1065, 0.1424, 0.1255, 0.6255]
[test epoch 22/100] | loss 0.315 | nw acc 0.49 | time 4 min 18 sec
cat 0: [4, 7, 0, 258] and [0.0149, 0.026, 0.0, 0.9591]
cat 1: [20, 354, 0, 673] and [0.0191, 0.3381, 0.0, 0.6428]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [3, 15, 0, 581] and [0.005, 0.025, 0.0, 0.9699]
[train epoch 23/100] | loss 1.1964 | nw acc 0.543 | time 3 min 43 sec
cat 0: [638, 232, 145, 195] and [0.5273, 0.1917, 0.1198, 0.1612]
cat 1: [607, 2276, 816, 698] and [0.138, 0.5176, 0.1856, 0.1587]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [197, 293, 245, 1189] and [0.1024, 0.1523, 0.1273, 0.618]
[test epoch 23/100] | loss 0.314 | nw acc 0.499 | time 4 min 17 sec
cat 0: [8, 10, 0, 240] and [0.031, 0.0388, 0.0, 0.9302]
cat 1: [18, 349, 0, 674] and [0.0173, 0.3353, 0.0, 0.6475]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 17, 0, 598] and [0.0016, 0.0276, 0.0, 0.9708]
[train epoch 24/100] | loss 1.1931 | nw acc 0.544 | time 3 min 47 sec
cat 0: [654, 230, 131, 206] and [0.5356, 0.1884, 0.1073, 0.1687]
cat 1: [607, 2278, 809, 702] and [0.1381, 0.5182, 0.184, 0.1597]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [181, 293, 266, 1174] and [0.0946, 0.1531, 0.139, 0.6134]
[test epoch 24/100] | loss 0.313 | nw acc 0.498 | time 4 min 19 sec
cat 0: [8, 8, 0, 268] and [0.0282, 0.0282, 0.0, 0.9437]
cat 1: [17, 343, 0, 641] and [0.017, 0.3427, 0.0, 0.6404]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [2, 25, 0, 603] and [0.0032, 0.0397, 0.0, 0.9571]
[train epoch 25/100] | loss 1.1951 | nw acc 0.545 | time 3 min 41 sec
cat 0: [660, 214, 139, 195] and [0.5464, 0.1772, 0.1151, 0.1614]
cat 1: [603, 2263, 814, 692] and [0.1379, 0.5176, 0.1862, 0.1583]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [179, 324, 253, 1195] and [0.0917, 0.1661, 0.1297, 0.6125]
[test epoch 25/100] | loss 0.313 | nw acc 0.498 | time 4 min 14 sec
cat 0: [8, 6, 0, 249] and [0.0304, 0.0228, 0.0, 0.9468]
cat 1: [18, 352, 0, 670] and [0.0173, 0.3385, 0.0, 0.6442]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 18, 0, 593] and [0.0016, 0.0294, 0.0, 0.969]
[train epoch 26/100] | loss 1.1912 | nw acc 0.547 | time 3 min 45 sec
cat 0: [657, 229, 155, 195] and [0.5316, 0.1853, 0.1254, 0.1578]
cat 1: [606, 2272, 784, 682] and [0.1395, 0.523, 0.1805, 0.157]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [179, 300, 267, 1205] and [0.0917, 0.1538, 0.1369, 0.6176]
[test epoch 26/100] | loss 0.315 | nw acc 0.496 | time 3 min 52 sec
cat 0: [7, 12, 0, 267] and [0.0245, 0.042, 0.0, 0.9336]
cat 1: [19, 346, 0, 648] and [0.0188, 0.3416, 0.0, 0.6397]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 18, 0, 597] and [0.0016, 0.0292, 0.0, 0.9692]
[train epoch 27/100] | loss 1.188 | nw acc 0.552 | time 3 min 42 sec
cat 0: [686, 234, 158, 213] and [0.5314, 0.1813, 0.1224, 0.165]
cat 1: [566, 2267, 778, 655] and [0.1327, 0.5314, 0.1824, 0.1535]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [190, 300, 270, 1214] and [0.0963, 0.152, 0.1368, 0.615]
[test epoch 27/100] | loss 0.315 | nw acc 0.485 | time 4 min 20 sec
cat 0: [8, 9, 0, 231] and [0.0323, 0.0363, 0.0, 0.9315]
cat 1: [18, 351, 0, 711] and [0.0167, 0.325, 0.0, 0.6583]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 16, 0, 570] and [0.0017, 0.0273, 0.0, 0.971]
[train epoch 28/100] | loss 1.1903 | nw acc 0.552 | time 3 min 43 sec
cat 0: [681, 220, 144, 195] and [0.5492, 0.1774, 0.1161, 0.1573]
cat 1: [567, 2295, 808, 696] and [0.1299, 0.5257, 0.1851, 0.1594]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [194, 286, 254, 1191] and [0.1008, 0.1486, 0.1319, 0.6187]
[test epoch 28/100] | loss 0.312 | nw acc 0.498 | time 3 min 59 sec
cat 0: [8, 12, 0, 259] and [0.0287, 0.043, 0.0, 0.9283]
cat 1: [18, 343, 0, 650] and [0.0178, 0.3393, 0.0, 0.6429]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 21, 0, 603] and [0.0016, 0.0336, 0.0, 0.9648]
[train epoch 29/100] | loss 1.19 | nw acc 0.545 | time 3 min 56 sec
cat 0: [680, 224, 147, 215] and [0.5371, 0.1769, 0.1161, 0.1698]
cat 1: [584, 2255, 792, 688] and [0.1352, 0.5221, 0.1834, 0.1593]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [178, 322, 267, 1179] and [0.0915, 0.1655, 0.1372, 0.6059]
[test epoch 29/100] | loss 0.311 | nw acc 0.511 | time 4 min 36 sec
cat 0: [9, 10, 0, 249] and [0.0336, 0.0373, 0.0, 0.9291]
cat 1: [17, 343, 0, 636] and [0.0171, 0.3444, 0.0, 0.6386]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 23, 0, 627] and [0.0015, 0.0353, 0.0, 0.9631]
[train epoch 30/100] | loss 1.1918 | nw acc 0.544 | time 3 min 41 sec
cat 0: [687, 247, 144, 204] and [0.5359, 0.1927, 0.1123, 0.1591]
cat 1: [562, 2236, 800, 689] and [0.1311, 0.5216, 0.1866, 0.1607]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [193, 318, 262, 1189] and [0.0984, 0.1621, 0.1335, 0.606]
[test epoch 30/100] | loss 0.312 | nw acc 0.508 | time 4 min 19 sec
cat 0: [7, 8, 0, 239] and [0.0276, 0.0315, 0.0, 0.9409]
cat 1: [19, 352, 0, 659] and [0.0184, 0.3417, 0.0, 0.6398]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 16, 0, 614] and [0.0016, 0.0254, 0.0, 0.9731]
[train epoch 31/100] | loss 1.1868 | nw acc 0.552 | time 3 min 50 sec
cat 0: [669, 211, 144, 178] and [0.5566, 0.1755, 0.1198, 0.1481]
cat 1: [571, 2282, 796, 686] and [0.1317, 0.5264, 0.1836, 0.1582]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [202, 308, 266, 1218] and [0.1013, 0.1545, 0.1334, 0.6108]
[test epoch 31/100] | loss 0.312 | nw acc 0.503 | time 4 min 19 sec
cat 0: [7, 8, 0, 245] and [0.0269, 0.0308, 0.0, 0.9423]
cat 1: [17, 351, 0, 661] and [0.0165, 0.3411, 0.0, 0.6424]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [3, 17, 0, 606] and [0.0048, 0.0272, 0.0, 0.9681]
[train epoch 32/100] | loss 1.1884 | nw acc 0.551 | time 3 min 45 sec
cat 0: [668, 245, 155, 190] and [0.531, 0.1948, 0.1232, 0.151]
cat 1: [570, 2267, 792, 668] and [0.1327, 0.5276, 0.1843, 0.1555]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [204, 289, 259, 1224] and [0.1032, 0.1463, 0.1311, 0.6194]
[test epoch 32/100] | loss 0.312 | nw acc 0.508 | time 4 min 28 sec
cat 0: [8, 11, 0, 251] and [0.0296, 0.0407, 0.0, 0.9296]
cat 1: [18, 349, 0, 646] and [0.0178, 0.3445, 0.0, 0.6377]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 16, 0, 615] and [0.0016, 0.0253, 0.0, 0.9731]
[train epoch 33/100] | loss 1.1878 | nw acc 0.547 | time 3 min 39 sec
cat 0: [705, 251, 171, 205] and [0.5293, 0.1884, 0.1284, 0.1539]
cat 1: [560, 2228, 775, 681] and [0.132, 0.525, 0.1826, 0.1605]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [177, 322, 260, 1196] and [0.0905, 0.1647, 0.133, 0.6118]
[test epoch 33/100] | loss 0.31 | nw acc 0.514 | time 4 min 26 sec
cat 0: [4, 7, 0, 223] and [0.0171, 0.0299, 0.0, 0.953]
cat 1: [22, 352, 0, 661] and [0.0213, 0.3401, 0.0, 0.6386]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 17, 0, 628] and [0.0015, 0.0263, 0.0, 0.9721]
[train epoch 34/100] | loss 1.1858 | nw acc 0.549 | time 3 min 44 sec
cat 0: [655, 216, 136, 186] and [0.549, 0.1811, 0.114, 0.1559]
cat 1: [577, 2274, 823, 680] and [0.1325, 0.5223, 0.189, 0.1562]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [210, 311, 247, 1216] and [0.1058, 0.1568, 0.1245, 0.6129]
[test epoch 34/100] | loss 0.309 | nw acc 0.528 | time 4 min 26 sec
cat 0: [9, 14, 0, 220] and [0.037, 0.0576, 0.0, 0.9053]
cat 1: [17, 345, 0, 635] and [0.0171, 0.346, 0.0, 0.6369]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 17, 0, 657] and [0.0015, 0.0252, 0.0, 0.9733]
[train epoch 35/100] | loss 1.1858 | nw acc 0.553 | time 3 min 33 sec
cat 0: [672, 249, 140, 182] and [0.5406, 0.2003, 0.1126, 0.1464]
cat 1: [560, 2256, 801, 654] and [0.1311, 0.5282, 0.1875, 0.1531]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [210, 296, 265, 1246] and [0.1041, 0.1468, 0.1314, 0.6177]
[test epoch 35/100] | loss 0.312 | nw acc 0.491 | time 4 min 36 sec
cat 0: [7, 10, 0, 214] and [0.0303, 0.0433, 0.0, 0.9264]
cat 1: [18, 353, 0, 717] and [0.0165, 0.3244, 0.0, 0.659]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [2, 13, 0, 581] and [0.0034, 0.0218, 0.0, 0.9748]
[train epoch 36/100] | loss 1.187 | nw acc 0.549 | time 3 min 46 sec
cat 0: [658, 217, 139, 180] and [0.5511, 0.1817, 0.1164, 0.1508]
cat 1: [573, 2267, 807, 684] and [0.1323, 0.5234, 0.1863, 0.1579]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [211, 317, 260, 1218] and [0.1052, 0.158, 0.1296, 0.6072]
[test epoch 36/100] | loss 0.309 | nw acc 0.521 | time 4 min 27 sec
cat 0: [8, 11, 0, 217] and [0.0339, 0.0466, 0.0, 0.9195]
cat 1: [17, 348, 0, 654] and [0.0167, 0.3415, 0.0, 0.6418]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [2, 17, 0, 641] and [0.003, 0.0258, 0.0, 0.9712]
[train epoch 37/100] | loss 1.1853 | nw acc 0.55 | time 3 min 39 sec
cat 0: [653, 233, 130, 197] and [0.5383, 0.1921, 0.1072, 0.1624]
cat 1: [584, 2266, 808, 648] and [0.1356, 0.5262, 0.1876, 0.1505]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [205, 302, 268, 1237] and [0.1019, 0.1501, 0.1332, 0.6148]
[test epoch 37/100] | loss 0.309 | nw acc 0.521 | time 4 min 26 sec
cat 0: [6, 12, 0, 222] and [0.025, 0.05, 0.0, 0.925]
cat 1: [19, 346, 0, 645] and [0.0188, 0.3426, 0.0, 0.6386]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [2, 18, 0, 645] and [0.003, 0.0271, 0.0, 0.9699]
[train epoch 38/100] | loss 1.1838 | nw acc 0.55 | time 3 min 40 sec
cat 0: [698, 244, 145, 177] and [0.5522, 0.193, 0.1147, 0.14]
cat 1: [562, 2250, 795, 700] and [0.1305, 0.5224, 0.1846, 0.1625]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [182, 307, 266, 1205] and [0.0929, 0.1566, 0.1357, 0.6148]
[test epoch 38/100] | loss 0.309 | nw acc 0.519 | time 4 min 12 sec
cat 0: [9, 13, 0, 259] and [0.032, 0.0463, 0.0, 0.9217]
cat 1: [17, 346, 0, 614] and [0.0174, 0.3541, 0.0, 0.6285]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 17, 0, 639] and [0.0015, 0.0259, 0.0, 0.9726]
[train epoch 39/100] | loss 1.1822 | nw acc 0.556 | time 3 min 44 sec
cat 0: [683, 232, 141, 189] and [0.5486, 0.1863, 0.1133, 0.1518]
cat 1: [576, 2264, 801, 639] and [0.1346, 0.529, 0.1871, 0.1493]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [183, 305, 264, 1254] and [0.0912, 0.152, 0.1316, 0.6251]
[test epoch 39/100] | loss 0.307 | nw acc 0.534 | time 4 min 42 sec
cat 0: [8, 6, 0, 230] and [0.0328, 0.0246, 0.0, 0.9426]
cat 1: [18, 351, 0, 618] and [0.0182, 0.3556, 0.0, 0.6261]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 19, 0, 664] and [0.0015, 0.0278, 0.0, 0.9708]
[train epoch 40/100] | loss 1.1829 | nw acc 0.552 | time 3 min 38 sec
cat 0: [669, 250, 152, 179] and [0.5352, 0.2, 0.1216, 0.1432]
cat 1: [557, 2235, 783, 640] and [0.1321, 0.5302, 0.1858, 0.1518]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [216, 316, 271, 1263] and [0.1045, 0.153, 0.1312, 0.6113]
[test epoch 40/100] | loss 0.309 | nw acc 0.517 | time 4 min 39 sec
cat 0: [7, 10, 0, 250] and [0.0262, 0.0375, 0.0, 0.9363]
cat 1: [18, 346, 0, 625] and [0.0182, 0.3498, 0.0, 0.632]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [2, 20, 0, 637] and [0.003, 0.0303, 0.0, 0.9666]
[train epoch 41/100] | loss 1.1776 | nw acc 0.561 | time 3 min 41 sec
cat 0: [707, 224, 147, 190] and [0.5576, 0.1767, 0.1159, 0.1498]
cat 1: [547, 2286, 799, 650] and [0.1277, 0.5339, 0.1866, 0.1518]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [188, 291, 260, 1242] and [0.0949, 0.1469, 0.1312, 0.627]
[test epoch 41/100] | loss 0.309 | nw acc 0.519 | time 4 min 36 sec
cat 0: [8, 6, 0, 218] and [0.0345, 0.0259, 0.0, 0.9397]
cat 1: [18, 345, 0, 654] and [0.0177, 0.3392, 0.0, 0.6431]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 25, 0, 640] and [0.0015, 0.0375, 0.0, 0.961]
[train epoch 42/100] | loss 1.1819 | nw acc 0.552 | time 3 min 44 sec
cat 0: [681, 227, 144, 217] and [0.5366, 0.1789, 0.1135, 0.171]
cat 1: [553, 2266, 798, 645] and [0.1298, 0.5317, 0.1872, 0.1513]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [208, 308, 264, 1220] and [0.104, 0.154, 0.132, 0.61]
[test epoch 42/100] | loss 0.311 | nw acc 0.505 | time 4 min 38 sec
cat 0: [6, 11, 0, 227] and [0.0246, 0.0451, 0.0, 0.9303]
cat 1: [20, 349, 0, 672] and [0.0192, 0.3353, 0.0, 0.6455]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 16, 0, 613] and [0.0016, 0.0254, 0.0, 0.973]
[train epoch 43/100] | loss 1.1813 | nw acc 0.556 | time 3 min 33 sec
cat 0: [700, 225, 143, 187] and [0.5578, 0.1793, 0.1139, 0.149]
cat 1: [563, 2265, 811, 660] and [0.131, 0.5269, 0.1886, 0.1535]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [179, 311, 252, 1235] and [0.0905, 0.1573, 0.1275, 0.6247]
[test epoch 43/100] | loss 0.308 | nw acc 0.521 | time 4 min 33 sec
cat 0: [8, 13, 0, 231] and [0.0317, 0.0516, 0.0, 0.9167]
cat 1: [18, 342, 0, 633] and [0.0181, 0.3444, 0.0, 0.6375]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 21, 0, 648] and [0.0015, 0.0313, 0.0, 0.9672]
[train epoch 44/100] | loss 1.1795 | nw acc 0.558 | time 3 min 49 sec
cat 0: [730, 264, 177, 200] and [0.5325, 0.1926, 0.1291, 0.1459]
cat 1: [521, 2238, 773, 638] and [0.1249, 0.5367, 0.1854, 0.153]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [191, 299, 256, 1244] and [0.096, 0.1503, 0.1286, 0.6251]
[test epoch 44/100] | loss 0.309 | nw acc 0.516 | time 4 min 30 sec
cat 0: [8, 6, 0, 218] and [0.0345, 0.0259, 0.0, 0.9397]
cat 1: [18, 354, 0, 668] and [0.0173, 0.3404, 0.0, 0.6423]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 16, 0, 626] and [0.0016, 0.0249, 0.0, 0.9736]
[train epoch 45/100] | loss 1.1787 | nw acc 0.557 | time 3 min 40 sec
cat 0: [712, 258, 132, 190] and [0.5511, 0.1997, 0.1022, 0.1471]
cat 1: [543, 2249, 798, 647] and [0.1282, 0.5308, 0.1883, 0.1527]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [187, 294, 276, 1245] and [0.0934, 0.1469, 0.1379, 0.6219]
[test epoch 45/100] | loss 0.309 | nw acc 0.511 | time 4 min 28 sec
cat 0: [7, 6, 0, 236] and [0.0281, 0.0241, 0.0, 0.9478]
cat 1: [19, 354, 0, 658] and [0.0184, 0.3434, 0.0, 0.6382]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 16, 0, 618] and [0.0016, 0.0252, 0.0, 0.9732]
[train epoch 46/100] | loss 1.1772 | nw acc 0.56 | time 3 min 39 sec
cat 0: [720, 236, 151, 197] and [0.5521, 0.181, 0.1158, 0.1511]
cat 1: [535, 2261, 779, 636] and [0.127, 0.5369, 0.185, 0.151]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [187, 304, 276, 1249] and [0.0928, 0.1508, 0.1369, 0.6195]
[test epoch 46/100] | loss 0.31 | nw acc 0.512 | time 4 min 20 sec
cat 0: [9, 7, 0, 239] and [0.0353, 0.0275, 0.0, 0.9373]
cat 1: [18, 352, 0, 653] and [0.0176, 0.3441, 0.0, 0.6383]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 17, 0, 620] and [0.0, 0.0267, 0.0, 0.9733]
[train epoch 47/100] | loss 1.178 | nw acc 0.558 | time 3 min 36 sec
cat 0: [698, 238, 148, 171] and [0.5562, 0.1896, 0.1179, 0.1363]
cat 1: [543, 2258, 785, 651] and [0.1282, 0.5329, 0.1853, 0.1536]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [201, 305, 273, 1260] and [0.0986, 0.1496, 0.1339, 0.6179]
[test epoch 47/100] | loss 0.31 | nw acc 0.514 | time 4 min 32 sec
cat 0: [8, 13, 0, 237] and [0.031, 0.0504, 0.0, 0.9186]
cat 1: [18, 346, 0, 645] and [0.0178, 0.3429, 0.0, 0.6392]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 17, 0, 630] and [0.0015, 0.0262, 0.0, 0.9722]
[train epoch 48/100] | loss 1.175 | nw acc 0.562 | time 3 min 27 sec
cat 0: [724, 245, 131, 189] and [0.5617, 0.1901, 0.1016, 0.1466]
cat 1: [538, 2282, 811, 657] and [0.1255, 0.5322, 0.1891, 0.1532]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [180, 274, 264, 1236] and [0.0921, 0.1402, 0.1351, 0.6325]
[test epoch 48/100] | loss 0.308 | nw acc 0.531 | time 4 min 22 sec
cat 0: [8, 6, 0, 225] and [0.0335, 0.0251, 0.0, 0.9414]
cat 1: [18, 351, 0, 630] and [0.018, 0.3514, 0.0, 0.6306]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 19, 0, 657] and [0.0015, 0.0281, 0.0, 0.9705]
[train epoch 49/100] | loss 1.1759 | nw acc 0.561 | time 3 min 40 sec
cat 0: [676, 238, 115, 172] and [0.5629, 0.1982, 0.0958, 0.1432]
cat 1: [561, 2250, 795, 600] and [0.1334, 0.535, 0.189, 0.1427]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [205, 313, 296, 1310] and [0.0965, 0.1474, 0.1394, 0.6168]
[test epoch 49/100] | loss 0.307 | nw acc 0.53 | time 4 min 24 sec
cat 0: [8, 7, 0, 222] and [0.0338, 0.0295, 0.0, 0.9367]
cat 1: [18, 349, 0, 632] and [0.018, 0.3493, 0.0, 0.6326]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 20, 0, 658] and [0.0015, 0.0295, 0.0, 0.9691]
[train epoch 50/100] | loss 1.1805 | nw acc 0.552 | time 3 min 39 sec
cat 0: [693, 243, 131, 185] and [0.5535, 0.1941, 0.1046, 0.1478]
cat 1: [558, 2236, 805, 660] and [0.131, 0.525, 0.189, 0.155]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [191, 322, 270, 1237] and [0.0946, 0.1594, 0.1337, 0.6124]
[test epoch 50/100] | loss 0.306 | nw acc 0.539 | time 4 min 26 sec
cat 0: [8, 10, 0, 223] and [0.0332, 0.0415, 0.0, 0.9253]
cat 1: [18, 350, 0, 614] and [0.0183, 0.3564, 0.0, 0.6253]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 16, 0, 675] and [0.0014, 0.0231, 0.0, 0.9754]
[train epoch 51/100] | loss 1.1773 | nw acc 0.555 | time 3 min 36 sec
cat 0: [702, 239, 141, 197] and [0.5489, 0.1869, 0.1102, 0.154]
cat 1: [548, 2244, 800, 639] and [0.1295, 0.5304, 0.1891, 0.151]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [192, 318, 265, 1246] and [0.095, 0.1573, 0.1311, 0.6165]
[test epoch 51/100] | loss 0.304 | nw acc 0.547 | time 3 min 51 sec
cat 0: [10, 10, 0, 241] and [0.0383, 0.0383, 0.0, 0.9234]
cat 1: [16, 346, 0, 580] and [0.017, 0.3673, 0.0, 0.6157]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 20, 0, 691] and [0.0014, 0.0281, 0.0, 0.9705]
[train epoch 52/100] | loss 1.1759 | nw acc 0.557 | time 3 min 32 sec
cat 0: [703, 248, 137, 189] and [0.5505, 0.1942, 0.1073, 0.148]
cat 1: [520, 2232, 775, 623] and [0.1253, 0.5378, 0.1867, 0.1501]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [219, 321, 294, 1270] and [0.1041, 0.1526, 0.1397, 0.6036]
[test epoch 52/100] | loss 0.31 | nw acc 0.51 | time 6 min 10 sec
cat 0: [8, 6, 0, 232] and [0.0325, 0.0244, 0.0, 0.9431]
cat 1: [18, 356, 0, 667] and [0.0173, 0.342, 0.0, 0.6407]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 14, 0, 613] and [0.0016, 0.0223, 0.0, 0.9761]
[train epoch 53/100] | loss 1.1794 | nw acc 0.555 | time 6 min 58 sec
cat 0: [719, 259, 134, 191] and [0.5518, 0.1988, 0.1028, 0.1466]
cat 1: [545, 2241, 800, 659] and [0.1284, 0.5279, 0.1885, 0.1552]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [178, 301, 272, 1232] and [0.0898, 0.1518, 0.1372, 0.6213]
[test epoch 53/100] | loss 0.308 | nw acc 0.522 | time 3 min 40 sec
cat 0: [8, 6, 0, 242] and [0.0312, 0.0234, 0.0, 0.9453]
cat 1: [18, 350, 0, 628] and [0.0181, 0.3514, 0.0, 0.6305]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 20, 0, 642] and [0.0015, 0.0302, 0.0, 0.9683]
[train epoch 54/100] | loss 1.1734 | nw acc 0.563 | time 5 min 21 sec
cat 0: [696, 240, 135, 198] and [0.5485, 0.1891, 0.1064, 0.156]
cat 1: [545, 2265, 773, 595] and [0.1304, 0.5421, 0.185, 0.1424]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [201, 296, 298, 1289] and [0.0964, 0.142, 0.143, 0.6185]
[test epoch 54/100] | loss 0.307 | nw acc 0.534 | time 5 min 3 sec
cat 0: [8, 9, 0, 211] and [0.0351, 0.0395, 0.0, 0.9254]
cat 1: [18, 350, 0, 636] and [0.0179, 0.3486, 0.0, 0.6335]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 17, 0, 665] and [0.0015, 0.0249, 0.0, 0.9736]
[train epoch 55/100] | loss 1.1721 | nw acc 0.564 | time 6 min 1 sec
cat 0: [729, 237, 147, 196] and [0.5569, 0.1811, 0.1123, 0.1497]
cat 1: [530, 2276, 784, 634] and [0.1255, 0.5388, 0.1856, 0.1501]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [183, 288, 275, 1252] and [0.0916, 0.1441, 0.1376, 0.6266]
[test epoch 55/100] | loss 0.307 | nw acc 0.531 | time 6 min 6 sec
cat 0: [8, 12, 0, 228] and [0.0323, 0.0484, 0.0, 0.9194]
cat 1: [17, 346, 0, 621] and [0.0173, 0.3516, 0.0, 0.6311]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [2, 18, 0, 663] and [0.0029, 0.0264, 0.0, 0.9707]
[train epoch 56/100] | loss 1.1737 | nw acc 0.562 | time 5 min 33 sec
cat 0: [711, 238, 149, 203] and [0.5465, 0.1829, 0.1145, 0.156]
cat 1: [546, 2284, 807, 631] and [0.1279, 0.5351, 0.1891, 0.1478]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [185, 279, 250, 1248] and [0.0943, 0.1422, 0.1274, 0.6361]
[test epoch 56/100] | loss 0.303 | nw acc 0.549 | time 3 min 16 sec
cat 0: [8, 13, 0, 244] and [0.0302, 0.0491, 0.0, 0.9208]
cat 1: [19, 346, 0, 571] and [0.0203, 0.3697, 0.0, 0.61]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 17, 0, 697] and [0.0, 0.0238, 0.0, 0.9762]
