AlexNet(
  (conv1): Sequential(
    (0): Conv2d(3, 64, kernel_size=(11, 11), stride=(4, 4), padding=(2, 2))
    (1): ReLU(inplace)
    (2): MaxPool2d(kernel_size=3, stride=2, padding=0, dilation=1, ceil_mode=False)
  )
  (conv2): Sequential(
    (0): Conv2d(64, 192, kernel_size=(5, 5), stride=(1, 1), padding=(2, 2))
    (1): ReLU(inplace)
    (2): MaxPool2d(kernel_size=3, stride=2, padding=0, dilation=1, ceil_mode=False)
  )
  (conv3): Sequential(
    (0): Conv2d(192, 384, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    (1): ReLU(inplace)
  )
  (conv4): Sequential(
    (0): Conv2d(384, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    (1): ReLU(inplace)
  )
  (conv5): Sequential(
    (0): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    (1): ReLU(inplace)
    (2): MaxPool2d(kernel_size=3, stride=2, padding=0, dilation=1, ceil_mode=False)
  )
  (fc1): Sequential(
    (0): Dropout(p=0.5)
    (1): Linear(in_features=9216, out_features=4096, bias=True)
    (2): ReLU(inplace)
  )
  (fc2): Sequential(
    (0): Dropout(p=0.5)
    (1): Linear(in_features=4096, out_features=4096, bias=True)
    (2): ReLU(inplace)
  )
  (fc3): Sequential(
    (0): Linear(in_features=4096, out_features=4, bias=True)
    (1): Softmax()
  )
)
Child conv1 layer 0 param is frozenChild conv1 layer 0 param is frozenChild conv2 layer 0 param is frozenChild conv2 layer 0 param is frozenChild conv3 layer 0 param is frozenChild conv3 layer 0 param is frozenChild conv4 layer 0 param is frozenChild conv4 layer 0 param is frozenChild conv5 layer 0 param is not frozenChild conv5 layer 0 param is not frozenChild fc1 layer 1 param is not frozenChild fc1 layer 1 param is not frozenChild fc2 layer 1 param is not frozenChild fc2 layer 1 param is not frozenChild fc3 layer 0 param is not frozenChild fc3 layer 0 param is not frozentrain patients [18 17 41 12 22 46 14 45 36 51  5 48  1 30  2 29 19 34 55 15  7 40 13 24
 43 49 47 11 23 25  0  8  3 31 54]
train labels [ 694 2710  956 2894]
test patients [42 53 35 32  6 10  4 44 50]
test labels [775 467 250 700]

[train epoch 1/100] | loss 1.285 | nw acc 0.474 | time 1 min 4 sec
cat 0: [3, 24, 5, 13] and [0.0667, 0.5333, 0.1111, 0.2889]
cat 1: [153, 1064, 188, 436] and [0.0831, 0.5779, 0.1021, 0.2368]
cat 2: [10, 76, 19, 75] and [0.0556, 0.4222, 0.1056, 0.4167]
cat 3: [528, 1546, 744, 2370] and [0.1018, 0.298, 0.1434, 0.4568]
[test epoch 1/100] | loss 0.424 | nw acc 0.304 | time 1 min 35 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [289, 267, 156, 300] and [0.2856, 0.2638, 0.1542, 0.2964]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [486, 200, 94, 400] and [0.4119, 0.1695, 0.0797, 0.339]
[train epoch 2/100] | loss 1.2196 | nw acc 0.542 | time 1 min 4 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [326, 1862, 434, 798] and [0.0953, 0.5444, 0.1269, 0.2333]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [368, 848, 522, 2096] and [0.096, 0.2212, 0.1362, 0.5467]
[test epoch 2/100] | loss 0.424 | nw acc 0.312 | time 1 min 34 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [343, 327, 176, 342] and [0.2887, 0.2753, 0.1481, 0.2879]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [432, 140, 74, 358] and [0.4303, 0.1394, 0.0737, 0.3566]
[train epoch 3/100] | loss 1.1969 | nw acc 0.562 | time 1 min 4 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [332, 1991, 491, 786] and [0.0922, 0.5531, 0.1364, 0.2183]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [362, 719, 465, 2108] and [0.0991, 0.1968, 0.1273, 0.5769]
[test epoch 3/100] | loss 0.423 | nw acc 0.323 | time 1 min 36 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [302, 294, 146, 287] and [0.2935, 0.2857, 0.1419, 0.2789]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [473, 173, 104, 413] and [0.4067, 0.1488, 0.0894, 0.3551]
[train epoch 4/100] | loss 1.182 | nw acc 0.568 | time 1 min 7 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [336, 1983, 498, 733] and [0.0946, 0.5586, 0.1403, 0.2065]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [358, 727, 458, 2161] and [0.0967, 0.1963, 0.1237, 0.5834]
[test epoch 4/100] | loss 0.422 | nw acc 0.337 | time 2 min 7 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [308, 299, 153, 261] and [0.3017, 0.2929, 0.1499, 0.2556]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [467, 168, 97, 439] and [0.3988, 0.1435, 0.0828, 0.3749]
[train epoch 5/100] | loss 1.1726 | nw acc 0.575 | time 1 min 27 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [318, 2021, 469, 723] and [0.0901, 0.5724, 0.1328, 0.2048]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [376, 689, 487, 2171] and [0.101, 0.1851, 0.1308, 0.5831]
[test epoch 5/100] | loss 0.42 | nw acc 0.35 | time 1 min 59 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [266, 273, 145, 206] and [0.2989, 0.3067, 0.1629, 0.2315]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [509, 194, 105, 494] and [0.3909, 0.149, 0.0806, 0.3794]
[train epoch 6/100] | loss 1.1601 | nw acc 0.588 | time 1 min 19 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [313, 2026, 472, 627] and [0.091, 0.5893, 0.1373, 0.1824]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [381, 684, 484, 2267] and [0.0998, 0.1792, 0.1268, 0.5941]
[test epoch 6/100] | loss 0.42 | nw acc 0.346 | time 2 min 13 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [350, 349, 164, 290] and [0.3036, 0.3027, 0.1422, 0.2515]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [425, 118, 86, 410] and [0.409, 0.1136, 0.0828, 0.3946]
[train epoch 7/100] | loss 1.1574 | nw acc 0.584 | time 1 min 18 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [319, 2048, 457, 680] and [0.091, 0.5845, 0.1304, 0.1941]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [375, 662, 499, 2214] and [0.1, 0.1765, 0.1331, 0.5904]
[test epoch 7/100] | loss 0.419 | nw acc 0.358 | time 2 min 8 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [339, 345, 167, 261] and [0.3049, 0.3103, 0.1502, 0.2347]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [436, 122, 83, 439] and [0.4037, 0.113, 0.0769, 0.4065]
[train epoch 8/100] | loss 1.1495 | nw acc 0.597 | time 1 min 29 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [308, 2087, 476, 623] and [0.0882, 0.5973, 0.1362, 0.1783]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [386, 623, 480, 2271] and [0.1027, 0.1657, 0.1277, 0.604]
[test epoch 8/100] | loss 0.417 | nw acc 0.362 | time 2 min 11 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [292, 298, 143, 205] and [0.3113, 0.3177, 0.1525, 0.2186]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [483, 169, 107, 495] and [0.3852, 0.1348, 0.0853, 0.3947]
[train epoch 9/100] | loss 1.1435 | nw acc 0.604 | time 1 min 21 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [313, 2106, 484, 593] and [0.0895, 0.6024, 0.1384, 0.1696]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [381, 604, 472, 2301] and [0.1014, 0.1607, 0.1256, 0.6123]
[test epoch 9/100] | loss 0.417 | nw acc 0.356 | time 1 min 59 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [312, 314, 147, 234] and [0.3098, 0.3118, 0.146, 0.2324]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [463, 153, 103, 466] and [0.3907, 0.1291, 0.0869, 0.3932]
[train epoch 10/100] | loss 1.1364 | nw acc 0.611 | time 2 min 1 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [304, 2130, 461, 569] and [0.0878, 0.6149, 0.1331, 0.1643]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [390, 580, 495, 2325] and [0.1029, 0.153, 0.1306, 0.6135]
[test epoch 10/100] | loss 0.416 | nw acc 0.37 | time 3 min 45 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [293, 297, 137, 185] and [0.3213, 0.3257, 0.1502, 0.2029]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [482, 170, 113, 515] and [0.3766, 0.1328, 0.0883, 0.4023]
[train epoch 11/100] | loss 1.1336 | nw acc 0.61 | time 2 min 32 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [300, 2091, 485, 531] and [0.0881, 0.6137, 0.1424, 0.1559]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [394, 619, 471, 2363] and [0.1024, 0.1609, 0.1224, 0.6142]
[test epoch 11/100] | loss 0.416 | nw acc 0.372 | time 4 min 38 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [315, 305, 157, 189] and [0.3261, 0.3157, 0.1625, 0.1957]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [460, 162, 93, 511] and [0.3752, 0.1321, 0.0759, 0.4168]
[train epoch 12/100] | loss 1.13 | nw acc 0.613 | time 3 min 54 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [309, 2096, 465, 517] and [0.0912, 0.6188, 0.1373, 0.1526]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [385, 614, 491, 2377] and [0.0996, 0.1588, 0.127, 0.6147]
[test epoch 12/100] | loss 0.416 | nw acc 0.372 | time 5 min 41 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [328, 313, 160, 198] and [0.3283, 0.3133, 0.1602, 0.1982]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [447, 154, 90, 502] and [0.3747, 0.1291, 0.0754, 0.4208]
[train epoch 13/100] | loss 1.1254 | nw acc 0.618 | time 3 min 57 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [309, 2128, 492, 511] and [0.0898, 0.6186, 0.143, 0.1485]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [385, 582, 464, 2383] and [0.1009, 0.1526, 0.1217, 0.6248]
[test epoch 13/100] | loss 0.415 | nw acc 0.37 | time 4 min 7 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [331, 325, 162, 213] and [0.321, 0.3152, 0.1571, 0.2066]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [444, 142, 88, 487] and [0.3824, 0.1223, 0.0758, 0.4195]
[train epoch 14/100] | loss 1.1159 | nw acc 0.63 | time 3 min 54 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [326, 2178, 462, 478] and [0.0947, 0.6324, 0.1341, 0.1388]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [368, 532, 494, 2416] and [0.0966, 0.1396, 0.1297, 0.6341]
[test epoch 14/100] | loss 0.415 | nw acc 0.376 | time 4 min 29 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [344, 337, 177, 212] and [0.3215, 0.315, 0.1654, 0.1981]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [431, 130, 73, 488] and [0.3841, 0.1159, 0.0651, 0.4349]
[train epoch 15/100] | loss 1.1166 | nw acc 0.627 | time 3 min 35 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [308, 2164, 493, 486] and [0.0892, 0.6271, 0.1429, 0.1408]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [386, 546, 463, 2408] and [0.1015, 0.1436, 0.1217, 0.6332]
[test epoch 15/100] | loss 0.415 | nw acc 0.372 | time 4 min 50 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [341, 326, 166, 210] and [0.3269, 0.3126, 0.1592, 0.2013]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [434, 141, 84, 490] and [0.3777, 0.1227, 0.0731, 0.4265]
[train epoch 16/100] | loss 1.1195 | nw acc 0.625 | time 3 min 36 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [307, 2146, 502, 477] and [0.0895, 0.6253, 0.1463, 0.139]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [387, 564, 454, 2417] and [0.1013, 0.1476, 0.1188, 0.6324]
[test epoch 16/100] | loss 0.414 | nw acc 0.378 | time 4 min 56 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [332, 333, 174, 204] and [0.3183, 0.3193, 0.1668, 0.1956]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [443, 134, 76, 496] and [0.3856, 0.1166, 0.0661, 0.4317]
[train epoch 17/100] | loss 1.1154 | nw acc 0.626 | time 3 min 38 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [325, 2170, 528, 495] and [0.0924, 0.6168, 0.1501, 0.1407]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [369, 540, 428, 2399] and [0.0988, 0.1445, 0.1146, 0.6421]
[test epoch 17/100] | loss 0.414 | nw acc 0.383 | time 4 min 49 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [342, 339, 173, 200] and [0.3245, 0.3216, 0.1641, 0.1898]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [433, 128, 77, 500] and [0.3805, 0.1125, 0.0677, 0.4394]
[train epoch 18/100] | loss 1.1105 | nw acc 0.631 | time 3 min 33 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [321, 2178, 499, 471] and [0.0925, 0.6278, 0.1438, 0.1358]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [373, 532, 457, 2423] and [0.0985, 0.1406, 0.1207, 0.6402]
[test epoch 18/100] | loss 0.414 | nw acc 0.379 | time 4 min 16 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [341, 343, 176, 213] and [0.3178, 0.3197, 0.164, 0.1985]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [434, 124, 74, 487] and [0.3878, 0.1108, 0.0661, 0.4352]
[train epoch 19/100] | loss 1.1096 | nw acc 0.629 | time 3 min 37 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [337, 2189, 491, 497] and [0.0959, 0.6229, 0.1397, 0.1414]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [357, 521, 465, 2397] and [0.0955, 0.1393, 0.1243, 0.6409]
[test epoch 19/100] | loss 0.413 | nw acc 0.385 | time 4 min 12 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [336, 311, 161, 167] and [0.3446, 0.319, 0.1651, 0.1713]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [439, 156, 89, 533] and [0.3607, 0.1282, 0.0731, 0.438]
[train epoch 20/100] | loss 1.1067 | nw acc 0.635 | time 3 min 38 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [305, 2197, 501, 458] and [0.0881, 0.6348, 0.1448, 0.1323]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [389, 513, 455, 2436] and [0.1026, 0.1352, 0.12, 0.6422]
[test epoch 20/100] | loss 0.414 | nw acc 0.384 | time 4 min 37 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [337, 315, 171, 173] and [0.3384, 0.3163, 0.1717, 0.1737]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [438, 152, 79, 527] and [0.3662, 0.1271, 0.0661, 0.4406]
[train epoch 21/100] | loss 1.1029 | nw acc 0.637 | time 3 min 37 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [298, 2207, 520, 454] and [0.0857, 0.6344, 0.1495, 0.1305]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [396, 503, 436, 2440] and [0.1049, 0.1332, 0.1155, 0.6464]
[test epoch 21/100] | loss 0.413 | nw acc 0.382 | time 4 min 24 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [326, 309, 165, 171] and [0.3357, 0.3182, 0.1699, 0.1761]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [449, 158, 85, 529] and [0.3677, 0.1294, 0.0696, 0.4333]
[train epoch 22/100] | loss 1.1033 | nw acc 0.639 | time 3 min 41 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [307, 2227, 533, 457] and [0.0871, 0.632, 0.1512, 0.1297]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [387, 483, 423, 2437] and [0.1038, 0.1295, 0.1134, 0.6534]
[test epoch 22/100] | loss 0.413 | nw acc 0.38 | time 4 min 50 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [352, 332, 182, 200] and [0.3302, 0.3114, 0.1707, 0.1876]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [423, 135, 68, 500] and [0.3757, 0.1199, 0.0604, 0.444]
[train epoch 23/100] | loss 1.1019 | nw acc 0.637 | time 3 min 34 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [312, 2230, 544, 475] and [0.0876, 0.6262, 0.1528, 0.1334]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [382, 480, 412, 2419] and [0.1034, 0.13, 0.1116, 0.655]
[test epoch 23/100] | loss 0.414 | nw acc 0.384 | time 4 min 43 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [340, 338, 180, 196] and [0.3226, 0.3207, 0.1708, 0.186]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [435, 129, 70, 504] and [0.3822, 0.1134, 0.0615, 0.4429]
[train epoch 24/100] | loss 1.0973 | nw acc 0.641 | time 3 min 48 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [310, 2231, 513, 448] and [0.0885, 0.6371, 0.1465, 0.1279]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [384, 479, 443, 2446] and [0.1023, 0.1277, 0.1181, 0.6519]
[test epoch 24/100] | loss 0.413 | nw acc 0.388 | time 4 min 11 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [310, 291, 152, 140] and [0.3471, 0.3259, 0.1702, 0.1568]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [465, 176, 98, 560] and [0.358, 0.1355, 0.0754, 0.4311]
[train epoch 25/100] | loss 1.0923 | nw acc 0.648 | time 3 min 32 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [323, 2277, 536, 440] and [0.0903, 0.6367, 0.1499, 0.123]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [371, 433, 420, 2454] and [0.1009, 0.1177, 0.1142, 0.6672]
[test epoch 25/100] | loss 0.412 | nw acc 0.388 | time 4 min 29 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [335, 327, 181, 176] and [0.3288, 0.3209, 0.1776, 0.1727]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [440, 140, 69, 524] and [0.3751, 0.1194, 0.0588, 0.4467]
[train epoch 26/100] | loss 1.0965 | nw acc 0.642 | time 3 min 41 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [291, 2234, 501, 443] and [0.0839, 0.644, 0.1444, 0.1277]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [403, 476, 455, 2451] and [0.1065, 0.1258, 0.1202, 0.6476]
[test epoch 26/100] | loss 0.414 | nw acc 0.379 | time 4 min 55 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [356, 341, 187, 211] and [0.3251, 0.3114, 0.1708, 0.1927]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [419, 126, 63, 489] and [0.382, 0.1149, 0.0574, 0.4458]
[train epoch 27/100] | loss 1.0985 | nw acc 0.64 | time 3 min 41 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [287, 2231, 522, 458] and [0.082, 0.6378, 0.1492, 0.1309]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [407, 479, 434, 2436] and [0.1084, 0.1275, 0.1155, 0.6486]
[test epoch 27/100] | loss 0.413 | nw acc 0.383 | time 4 min 45 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [332, 312, 173, 173] and [0.3354, 0.3152, 0.1747, 0.1747]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [443, 155, 77, 527] and [0.3686, 0.129, 0.0641, 0.4384]
[train epoch 28/100] | loss 1.0947 | nw acc 0.647 | time 3 min 32 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [295, 2252, 540, 425] and [0.084, 0.6412, 0.1538, 0.121]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [399, 458, 416, 2469] and [0.1066, 0.1224, 0.1112, 0.6598]
[test epoch 28/100] | loss 0.411 | nw acc 0.392 | time 4 min 42 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [309, 303, 166, 143] and [0.3355, 0.329, 0.1802, 0.1553]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [466, 164, 84, 557] and [0.3666, 0.129, 0.0661, 0.4382]
[train epoch 29/100] | loss 1.0932 | nw acc 0.645 | time 3 min 40 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [304, 2244, 541, 429] and [0.0864, 0.6379, 0.1538, 0.1219]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [390, 466, 415, 2465] and [0.1044, 0.1247, 0.1111, 0.6598]
[test epoch 29/100] | loss 0.413 | nw acc 0.381 | time 5 min 0 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [341, 328, 184, 192] and [0.3263, 0.3139, 0.1761, 0.1837]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [434, 139, 66, 508] and [0.3784, 0.1212, 0.0575, 0.4429]
[train epoch 30/100] | loss 1.0948 | nw acc 0.641 | time 3 min 37 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [308, 2248, 545, 462] and [0.0864, 0.6309, 0.153, 0.1297]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [386, 462, 411, 2432] and [0.1046, 0.1252, 0.1114, 0.6589]
[test epoch 30/100] | loss 0.413 | nw acc 0.39 | time 5 min 7 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [373, 354, 196, 199] and [0.3324, 0.3155, 0.1747, 0.1774]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [402, 113, 54, 501] and [0.3757, 0.1056, 0.0505, 0.4682]
[train epoch 31/100] | loss 1.0891 | nw acc 0.65 | time 3 min 28 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [314, 2293, 525, 441] and [0.0879, 0.6418, 0.1469, 0.1234]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [380, 417, 431, 2453] and [0.1032, 0.1133, 0.1171, 0.6664]
[test epoch 31/100] | loss 0.412 | nw acc 0.386 | time 4 min 53 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [353, 321, 182, 175] and [0.3424, 0.3113, 0.1765, 0.1697]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [422, 146, 68, 525] and [0.3635, 0.1258, 0.0586, 0.4522]
[train epoch 32/100] | loss 1.0901 | nw acc 0.65 | time 3 min 39 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [309, 2282, 540, 437] and [0.0866, 0.6396, 0.1513, 0.1225]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [385, 428, 416, 2457] and [0.1044, 0.1161, 0.1129, 0.6666]
[test epoch 32/100] | loss 0.412 | nw acc 0.392 | time 4 min 41 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [335, 312, 167, 152] and [0.3468, 0.323, 0.1729, 0.1573]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [440, 155, 83, 548] and [0.3589, 0.1264, 0.0677, 0.447]
[train epoch 33/100] | loss 1.0898 | nw acc 0.648 | time 3 min 37 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [295, 2257, 541, 422] and [0.0839, 0.6421, 0.1539, 0.1201]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [399, 453, 415, 2472] and [0.1067, 0.1212, 0.111, 0.6611]
[test epoch 33/100] | loss 0.412 | nw acc 0.384 | time 4 min 58 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [334, 327, 183, 186] and [0.3243, 0.3175, 0.1777, 0.1806]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [441, 140, 67, 514] and [0.3795, 0.1205, 0.0577, 0.4423]
[train epoch 34/100] | loss 1.0875 | nw acc 0.654 | time 3 min 34 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [329, 2288, 548, 413] and [0.092, 0.6395, 0.1532, 0.1154]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [365, 422, 408, 2481] and [0.0993, 0.1148, 0.111, 0.6749]
[test epoch 34/100] | loss 0.412 | nw acc 0.391 | time 4 min 57 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [342, 314, 181, 158] and [0.3437, 0.3156, 0.1819, 0.1588]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [433, 153, 69, 542] and [0.3617, 0.1278, 0.0576, 0.4528]
[train epoch 35/100] | loss 1.0885 | nw acc 0.646 | time 3 min 42 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [314, 2259, 556, 438] and [0.088, 0.6333, 0.1559, 0.1228]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [380, 451, 400, 2456] and [0.1031, 0.1223, 0.1085, 0.6661]
[test epoch 35/100] | loss 0.412 | nw acc 0.386 | time 4 min 54 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [333, 322, 179, 175] and [0.33, 0.3191, 0.1774, 0.1734]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [442, 145, 71, 525] and [0.3736, 0.1226, 0.06, 0.4438]
[train epoch 36/100] | loss 1.087 | nw acc 0.652 | time 3 min 42 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [275, 2303, 517, 443] and [0.0777, 0.6509, 0.1461, 0.1252]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [419, 407, 439, 2451] and [0.1128, 0.1095, 0.1181, 0.6596]
[test epoch 36/100] | loss 0.413 | nw acc 0.38 | time 4 min 58 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [364, 350, 205, 217] and [0.3204, 0.3081, 0.1805, 0.191]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [411, 117, 45, 483] and [0.3892, 0.1108, 0.0426, 0.4574]
[train epoch 37/100] | loss 1.0863 | nw acc 0.651 | time 3 min 38 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [292, 2282, 539, 429] and [0.0824, 0.6443, 0.1522, 0.1211]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [402, 428, 417, 2465] and [0.1083, 0.1153, 0.1123, 0.6641]
[test epoch 37/100] | loss 0.412 | nw acc 0.389 | time 4 min 59 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [350, 331, 180, 178] and [0.3369, 0.3186, 0.1732, 0.1713]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [425, 136, 70, 522] and [0.3686, 0.118, 0.0607, 0.4527]
[train epoch 38/100] | loss 1.0782 | nw acc 0.666 | time 3 min 37 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [292, 2347, 517, 381] and [0.0826, 0.6636, 0.1462, 0.1077]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [402, 363, 439, 2513] and [0.1082, 0.0977, 0.1181, 0.6761]
[test epoch 38/100] | loss 0.413 | nw acc 0.383 | time 4 min 54 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [370, 343, 196, 203] and [0.3327, 0.3085, 0.1763, 0.1826]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [405, 124, 54, 497] and [0.375, 0.1148, 0.05, 0.4602]
[train epoch 39/100] | loss 1.0827 | nw acc 0.658 | time 3 min 45 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [292, 2328, 538, 420] and [0.0816, 0.6506, 0.1504, 0.1174]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [402, 382, 418, 2474] and [0.1094, 0.1039, 0.1137, 0.673]
[test epoch 39/100] | loss 0.411 | nw acc 0.391 | time 4 min 50 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [348, 310, 174, 152] and [0.3537, 0.315, 0.1768, 0.1545]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [427, 157, 76, 548] and [0.3535, 0.13, 0.0629, 0.4536]
[train epoch 40/100] | loss 1.0845 | nw acc 0.654 | time 3 min 37 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [278, 2294, 527, 414] and [0.0791, 0.653, 0.15, 0.1178]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [416, 416, 429, 2480] and [0.1112, 0.1112, 0.1147, 0.6629]
[test epoch 40/100] | loss 0.412 | nw acc 0.381 | time 4 min 54 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [364, 334, 200, 199] and [0.3318, 0.3045, 0.1823, 0.1814]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [411, 133, 50, 501] and [0.3753, 0.1215, 0.0457, 0.4575]
[train epoch 41/100] | loss 1.0832 | nw acc 0.653 | time 3 min 32 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [302, 2304, 571, 432] and [0.0837, 0.6384, 0.1582, 0.1197]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [392, 406, 385, 2462] and [0.1075, 0.1114, 0.1056, 0.6754]
[test epoch 41/100] | loss 0.412 | nw acc 0.397 | time 4 min 51 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [335, 326, 173, 156] and [0.3384, 0.3293, 0.1747, 0.1576]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [440, 141, 77, 544] and [0.3661, 0.1173, 0.0641, 0.4526]
[train epoch 42/100] | loss 1.0832 | nw acc 0.654 | time 3 min 29 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [314, 2299, 541, 419] and [0.0879, 0.6434, 0.1514, 0.1173]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [380, 411, 415, 2475] and [0.1032, 0.1117, 0.1127, 0.6724]
[test epoch 42/100] | loss 0.412 | nw acc 0.386 | time 4 min 56 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [357, 350, 194, 203] and [0.3234, 0.317, 0.1757, 0.1839]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [418, 117, 56, 497] and [0.3842, 0.1075, 0.0515, 0.4568]
[train epoch 43/100] | loss 1.0828 | nw acc 0.654 | time 3 min 32 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [312, 2292, 551, 417] and [0.0873, 0.6417, 0.1543, 0.1167]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [382, 418, 405, 2477] and [0.1037, 0.1135, 0.11, 0.6727]
[test epoch 43/100] | loss 0.411 | nw acc 0.397 | time 4 min 53 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [362, 333, 191, 163] and [0.3451, 0.3174, 0.1821, 0.1554]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [413, 134, 59, 537] and [0.3613, 0.1172, 0.0516, 0.4698]
[train epoch 44/100] | loss 1.0818 | nw acc 0.657 | time 3 min 27 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [313, 2308, 528, 410] and [0.0879, 0.6485, 0.1484, 0.1152]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [381, 402, 428, 2484] and [0.1031, 0.1088, 0.1158, 0.6723]
[test epoch 44/100] | loss 0.412 | nw acc 0.388 | time 4 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [355, 327, 189, 177] and [0.3387, 0.312, 0.1803, 0.1689]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [420, 140, 61, 523] and [0.3671, 0.1224, 0.0533, 0.4572]
[train epoch 45/100] | loss 1.0782 | nw acc 0.658 | time 3 min 34 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [323, 2316, 533, 410] and [0.0902, 0.6466, 0.1488, 0.1145]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [371, 394, 423, 2484] and [0.101, 0.1073, 0.1152, 0.6765]
[test epoch 45/100] | loss 0.412 | nw acc 0.383 | time 4 min 51 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [367, 343, 202, 203] and [0.3291, 0.3076, 0.1812, 0.1821]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [408, 124, 48, 497] and [0.3788, 0.1151, 0.0446, 0.4615]
[train epoch 46/100] | loss 1.0791 | nw acc 0.659 | time 5 min 8 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [311, 2332, 564, 416] and [0.0858, 0.6437, 0.1557, 0.1148]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [383, 378, 392, 2478] and [0.1055, 0.1041, 0.108, 0.6825]
[test epoch 46/100] | loss 0.412 | nw acc 0.389 | time 6 min 0 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [368, 343, 199, 191] and [0.3342, 0.3115, 0.1807, 0.1735]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [407, 124, 51, 509] and [0.3731, 0.1137, 0.0467, 0.4665]
[train epoch 47/100] | loss 1.0794 | nw acc 0.659 | time 3 min 29 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [289, 2329, 545, 412] and [0.0808, 0.6515, 0.1524, 0.1152]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [405, 381, 411, 2482] and [0.1101, 0.1036, 0.1117, 0.6746]
[test epoch 47/100] | loss 0.411 | nw acc 0.39 | time 8 min 32 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [376, 343, 204, 189] and [0.3381, 0.3085, 0.1835, 0.17]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [399, 124, 46, 511] and [0.3694, 0.1148, 0.0426, 0.4731]
[train epoch 48/100] | loss 1.0767 | nw acc 0.661 | time 5 min 53 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [307, 2333, 567, 403] and [0.085, 0.6463, 0.1571, 0.1116]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [387, 377, 389, 2491] and [0.1062, 0.1035, 0.1068, 0.6836]
[test epoch 48/100] | loss 0.413 | nw acc 0.383 | time 5 min 17 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [378, 350, 206, 210] and [0.3304, 0.3059, 0.1801, 0.1836]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [397, 117, 44, 490] and [0.3788, 0.1116, 0.042, 0.4676]
[train epoch 49/100] | loss 1.0756 | nw acc 0.661 | time 5 min 43 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [313, 2353, 555, 421] and [0.0859, 0.6461, 0.1524, 0.1156]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [381, 357, 401, 2473] and [0.1055, 0.0988, 0.111, 0.6847]
[test epoch 49/100] | loss 0.411 | nw acc 0.391 | time 4 min 42 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [355, 333, 191, 176] and [0.3365, 0.3156, 0.181, 0.1668]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [420, 134, 59, 524] and [0.3694, 0.1179, 0.0519, 0.4609]
[train epoch 50/100] | loss 1.0786 | nw acc 0.659 | time 5 min 35 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [324, 2318, 560, 404] and [0.0899, 0.6428, 0.1553, 0.112]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [370, 392, 396, 2490] and [0.1014, 0.1075, 0.1086, 0.6826]
[test epoch 50/100] | loss 0.411 | nw acc 0.397 | time 5 min 42 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [334, 324, 177, 153] and [0.3381, 0.3279, 0.1791, 0.1549]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [441, 143, 73, 547] and [0.3663, 0.1188, 0.0606, 0.4543]
