BenchMark(
  (conv1): Conv2d(1, 3, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (pool1): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (drop1): Dropout2d(p=0.5)
  (conv2): Conv2d(3, 16, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (pool2): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (drop2): Dropout2d(p=0.5)
  (conv3): Conv2d(16, 32, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (pool3): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (drop3): Dropout2d(p=0.25)
  (fc1): Linear(in_features=1568, out_features=4, bias=True)
)
[train epoch 1/100] | loss 1.3125 | nw acc 0.365 | time 1 min 48 sec
cat 0: [8, 2, 0, 7] and [0.4706, 0.1176, 0.0, 0.4118]
cat 1: [110, 196, 83, 217] and [0.1815, 0.3234, 0.137, 0.3581]
cat 2: [6, 9, 0, 13] and [0.2143, 0.3214, 0.0, 0.4643]
cat 3: [1345, 2233, 752, 2575] and [0.1948, 0.3234, 0.1089, 0.3729]
[test epoch 1/100] | loss 0.324 | nw acc 0.384 | time 0 min 28 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [0, 737, 371, 782] and [0.0, 0.3899, 0.1963, 0.4138]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
[train epoch 2/100] | loss 1.313 | nw acc 0.363 | time 1 min 51 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [174, 247, 83, 294] and [0.218, 0.3095, 0.104, 0.3684]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1295, 2193, 752, 2518] and [0.1916, 0.3245, 0.1113, 0.3726]
[test epoch 2/100] | loss 0.328 | nw acc 0.407 | time 0 min 28 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 737, 371, 782] and [0.0, 0.3899, 0.1963, 0.4138]
[train epoch 3/100] | loss 1.3009 | nw acc 0.38 | time 1 min 47 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [193, 430, 150, 350] and [0.1719, 0.3829, 0.1336, 0.3117]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1276, 2010, 685, 2462] and [0.1984, 0.3125, 0.1065, 0.3827]
[test epoch 3/100] | loss 0.327 | nw acc 0.408 | time 0 min 23 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [0, 3, 4, 1] and [0.0, 0.375, 0.5, 0.125]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 734, 367, 781] and [0.0, 0.39, 0.195, 0.415]
[train epoch 4/100] | loss 1.2809 | nw acc 0.394 | time 1 min 37 sec
cat 0: [68, 13, 14, 22] and [0.5812, 0.1111, 0.1197, 0.188]
cat 1: [242, 557, 227, 415] and [0.1679, 0.3865, 0.1575, 0.288]
cat 2: [1, 0, 1, 0] and [0.5, 0.0, 0.5, 0.0]
cat 3: [1158, 1870, 593, 2375] and [0.1931, 0.3119, 0.0989, 0.3961]
[test epoch 4/100] | loss 0.331 | nw acc 0.367 | time 0 min 29 sec
cat 0: [0, 22, 98, 61] and [0.0, 0.1215, 0.5414, 0.337]
cat 1: [0, 240, 160, 257] and [0.0, 0.3653, 0.2435, 0.3912]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 475, 113, 464] and [0.0, 0.4515, 0.1074, 0.4411]
[train epoch 5/100] | loss 1.2569 | nw acc 0.435 | time 1 min 36 sec
cat 0: [201, 40, 37, 89] and [0.5477, 0.109, 0.1008, 0.2425]
cat 1: [411, 974, 330, 588] and [0.1785, 0.4229, 0.1433, 0.2553]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [857, 1426, 468, 2135] and [0.1754, 0.2919, 0.0958, 0.437]
[test epoch 5/100] | loss 0.33 | nw acc 0.378 | time 0 min 27 sec
cat 0: [0, 44, 102, 80] and [0.0, 0.1947, 0.4513, 0.354]
cat 1: [0, 335, 159, 312] and [0.0, 0.4156, 0.1973, 0.3871]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 358, 110, 390] and [0.0, 0.4172, 0.1282, 0.4545]
[train epoch 6/100] | loss 1.2302 | nw acc 0.463 | time 1 min 36 sec
cat 0: [301, 44, 59, 87] and [0.613, 0.0896, 0.1202, 0.1772]
cat 1: [418, 1105, 362, 604] and [0.1679, 0.444, 0.1454, 0.2427]
cat 2: [3, 3, 2, 1] and [0.3333, 0.3333, 0.2222, 0.1111]
cat 3: [747, 1288, 412, 2120] and [0.1636, 0.282, 0.0902, 0.4642]
[test epoch 6/100] | loss 0.322 | nw acc 0.393 | time 0 min 17 sec
cat 0: [0, 30, 87, 51] and [0.0, 0.1786, 0.5179, 0.3036]
cat 1: [0, 372, 175, 349] and [0.0, 0.4152, 0.1953, 0.3895]
cat 2: [0, 0, 1, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 335, 108, 382] and [0.0, 0.4061, 0.1309, 0.463]
[train epoch 7/100] | loss 1.2183 | nw acc 0.462 | time 344 min 26 sec
cat 0: [299, 57, 74, 105] and [0.5589, 0.1065, 0.1383, 0.1963]
cat 1: [394, 1102, 355, 596] and [0.161, 0.4503, 0.1451, 0.2436]
cat 2: [10, 13, 14, 11] and [0.2083, 0.2708, 0.2917, 0.2292]
cat 3: [766, 1268, 392, 2100] and [0.1692, 0.2802, 0.0866, 0.464]
[test epoch 7/100] | loss 0.327 | nw acc 0.378 | time 0 min 21 sec
cat 0: [0, 28, 96, 59] and [0.0, 0.153, 0.5246, 0.3224]
cat 1: [0, 226, 121, 228] and [0.0, 0.393, 0.2104, 0.3965]
cat 2: [0, 1, 7, 2] and [0.0, 0.1, 0.7, 0.2]
cat 3: [0, 482, 147, 493] and [0.0, 0.4296, 0.131, 0.4394]
[train epoch 8/100] | loss 1.2024 | nw acc 0.46 | time 1 min 44 sec
cat 0: [346, 82, 80, 110] and [0.5599, 0.1327, 0.1294, 0.178]
cat 1: [378, 1045, 359, 608] and [0.1582, 0.4372, 0.1502, 0.2544]
cat 2: [3, 13, 18, 3] and [0.0811, 0.3514, 0.4865, 0.0811]
cat 3: [742, 1300, 378, 2091] and [0.1645, 0.2882, 0.0838, 0.4635]
[test epoch 8/100] | loss 0.336 | nw acc 0.383 | time 0 min 21 sec
cat 0: [0, 36, 109, 75] and [0.0, 0.1636, 0.4955, 0.3409]
cat 1: [0, 183, 96, 157] and [0.0, 0.4197, 0.2202, 0.3601]
cat 2: [0, 1, 9, 6] and [0.0, 0.0625, 0.5625, 0.375]
cat 3: [0, 517, 157, 544] and [0.0, 0.4245, 0.1289, 0.4466]
[train epoch 9/100] | loss 1.2004 | nw acc 0.469 | time 1 min 33 sec
cat 0: [364, 73, 70, 139] and [0.5635, 0.113, 0.1084, 0.2152]
cat 1: [334, 1048, 319, 536] and [0.1493, 0.4685, 0.1426, 0.2396]
cat 2: [2, 16, 36, 12] and [0.0303, 0.2424, 0.5455, 0.1818]
cat 3: [769, 1303, 410, 2125] and [0.1669, 0.2828, 0.089, 0.4613]
[test epoch 9/100] | loss 0.336 | nw acc 0.394 | time 0 min 26 sec
cat 0: [0, 61, 108, 100] and [0.0, 0.2268, 0.4015, 0.3717]
cat 1: [0, 390, 164, 322] and [0.0, 0.4452, 0.1872, 0.3676]
cat 2: [0, 3, 10, 4] and [0.0, 0.1765, 0.5882, 0.2353]
cat 3: [0, 283, 89, 356] and [0.0, 0.3887, 0.1223, 0.489]
[train epoch 10/100] | loss 1.1847 | nw acc 0.478 | time 1 min 32 sec
cat 0: [383, 79, 78, 122] and [0.5785, 0.1193, 0.1178, 0.1843]
cat 1: [372, 1141, 352, 585] and [0.1518, 0.4657, 0.1437, 0.2388]
cat 2: [4, 21, 30, 16] and [0.0563, 0.2958, 0.4225, 0.2254]
cat 3: [710, 1199, 375, 2089] and [0.1624, 0.2742, 0.0858, 0.4777]
[test epoch 10/100] | loss 0.341 | nw acc 0.399 | time 0 min 16 sec
cat 0: [0, 39, 109, 80] and [0.0, 0.1711, 0.4781, 0.3509]
cat 1: [0, 216, 93, 158] and [0.0, 0.4625, 0.1991, 0.3383]
cat 2: [0, 1, 13, 6] and [0.0, 0.05, 0.65, 0.3]
cat 3: [0, 481, 156, 538] and [0.0, 0.4094, 0.1328, 0.4579]
[train epoch 11/100] | loss 1.1822 | nw acc 0.476 | time 1 min 23 sec
cat 0: [365, 73, 73, 94] and [0.6033, 0.1207, 0.1207, 0.1554]
cat 1: [315, 1024, 306, 502] and [0.1467, 0.4769, 0.1425, 0.2338]
cat 2: [4, 6, 28, 9] and [0.0851, 0.1277, 0.5957, 0.1915]
cat 3: [785, 1337, 428, 2207] and [0.165, 0.2811, 0.09, 0.4639]
[test epoch 11/100] | loss 0.332 | nw acc 0.417 | time 0 min 24 sec
cat 0: [0, 35, 111, 74] and [0.0, 0.1591, 0.5045, 0.3364]
cat 1: [0, 269, 97, 181] and [0.0, 0.4918, 0.1773, 0.3309]
cat 2: [0, 14, 30, 25] and [0.0, 0.2029, 0.4348, 0.3623]
cat 3: [0, 419, 133, 502] and [0.0, 0.3975, 0.1262, 0.4763]
[train epoch 12/100] | loss 1.1623 | nw acc 0.491 | time 1 min 29 sec
cat 0: [439, 79, 78, 114] and [0.6183, 0.1113, 0.1099, 0.1606]
cat 1: [355, 1099, 332, 526] and [0.1535, 0.4753, 0.1436, 0.2275]
cat 2: [4, 15, 34, 8] and [0.0656, 0.2459, 0.5574, 0.1311]
cat 3: [671, 1247, 391, 2164] and [0.15, 0.2788, 0.0874, 0.4838]
[test epoch 12/100] | loss 0.328 | nw acc 0.42 | time 0 min 26 sec
cat 0: [0, 30, 104, 57] and [0.0, 0.1571, 0.5445, 0.2984]
cat 1: [0, 302, 119, 228] and [0.0, 0.4653, 0.1834, 0.3513]
cat 2: [0, 13, 24, 17] and [0.0, 0.2407, 0.4444, 0.3148]
cat 3: [0, 392, 124, 480] and [0.0, 0.3936, 0.1245, 0.4819]
[train epoch 13/100] | loss 1.1506 | nw acc 0.503 | time 1 min 33 sec
cat 0: [488, 89, 83, 135] and [0.6138, 0.1119, 0.1044, 0.1698]
cat 1: [300, 1170, 343, 530] and [0.128, 0.4994, 0.1464, 0.2262]
cat 2: [12, 24, 41, 12] and [0.1348, 0.2697, 0.4607, 0.1348]
cat 3: [669, 1157, 368, 2135] and [0.1545, 0.2673, 0.085, 0.4932]
[test epoch 13/100] | loss 0.332 | nw acc 0.411 | time 0 min 26 sec
cat 0: [0, 34, 108, 75] and [0.0, 0.1567, 0.4977, 0.3456]
cat 1: [0, 243, 115, 170] and [0.0, 0.4602, 0.2178, 0.322]
cat 2: [0, 16, 35, 25] and [0.0, 0.2105, 0.4605, 0.3289]
cat 3: [0, 444, 113, 512] and [0.0, 0.4153, 0.1057, 0.479]
[train epoch 14/100] | loss 1.1533 | nw acc 0.504 | time 1 min 26 sec
cat 0: [513, 91, 94, 111] and [0.6341, 0.1125, 0.1162, 0.1372]
cat 1: [279, 1086, 311, 509] and [0.1277, 0.497, 0.1423, 0.233]
cat 2: [9, 23, 64, 18] and [0.0789, 0.2018, 0.5614, 0.1579]
cat 3: [668, 1240, 366, 2174] and [0.1502, 0.2788, 0.0823, 0.4888]
[test epoch 14/100] | loss 0.322 | nw acc 0.424 | time 0 min 25 sec
cat 0: [0, 28, 101, 62] and [0.0, 0.1466, 0.5288, 0.3246]
cat 1: [0, 303, 133, 218] and [0.0, 0.4633, 0.2034, 0.3333]
cat 2: [0, 16, 37, 27] and [0.0, 0.2, 0.4625, 0.3375]
cat 3: [0, 390, 100, 475] and [0.0, 0.4041, 0.1036, 0.4922]
[train epoch 15/100] | loss 1.135 | nw acc 0.511 | time 1 min 42 sec
cat 0: [575, 104, 85, 118] and [0.6519, 0.1179, 0.0964, 0.1338]
cat 1: [302, 1115, 321, 542] and [0.1325, 0.489, 0.1408, 0.2377]
cat 2: [6, 32, 74, 21] and [0.0451, 0.2406, 0.5564, 0.1579]
cat 3: [586, 1189, 355, 2131] and [0.1375, 0.279, 0.0833, 0.5001]
[test epoch 15/100] | loss 0.315 | nw acc 0.431 | time 0 min 22 sec
cat 0: [0, 14, 79, 41] and [0.0, 0.1045, 0.5896, 0.306]
cat 1: [0, 268, 138, 201] and [0.0, 0.4415, 0.2273, 0.3311]
cat 2: [0, 19, 44, 25] and [0.0, 0.2159, 0.5, 0.2841]
cat 3: [0, 436, 110, 515] and [0.0, 0.4109, 0.1037, 0.4854]
[train epoch 16/100] | loss 1.1393 | nw acc 0.512 | time 1 min 36 sec
cat 0: [562, 101, 77, 134] and [0.643, 0.1156, 0.0881, 0.1533]
cat 1: [308, 1104, 337, 494] and [0.1373, 0.4922, 0.1502, 0.2202]
cat 2: [5, 33, 68, 20] and [0.0397, 0.2619, 0.5397, 0.1587]
cat 3: [594, 1202, 353, 2164] and [0.1377, 0.2787, 0.0818, 0.5017]
[test epoch 16/100] | loss 0.33 | nw acc 0.407 | time 0 min 23 sec
cat 0: [0, 38, 117, 74] and [0.0, 0.1659, 0.5109, 0.3231]
cat 1: [0, 205, 91, 150] and [0.0, 0.4596, 0.204, 0.3363]
cat 2: [0, 17, 38, 20] and [0.0, 0.2267, 0.5067, 0.2667]
cat 3: [0, 477, 125, 538] and [0.0, 0.4184, 0.1096, 0.4719]
[train epoch 17/100] | loss 1.1256 | nw acc 0.513 | time 1 min 30 sec
cat 0: [594, 114, 73, 148] and [0.6394, 0.1227, 0.0786, 0.1593]
cat 1: [287, 1082, 296, 475] and [0.1341, 0.5056, 0.1383, 0.222]
cat 2: [4, 42, 63, 21] and [0.0308, 0.3231, 0.4846, 0.1615]
cat 3: [584, 1202, 403, 2168] and [0.134, 0.2759, 0.0925, 0.4976]
[test epoch 17/100] | loss 0.327 | nw acc 0.42 | time 0 min 18 sec
cat 0: [0, 43, 117, 84] and [0.0, 0.1762, 0.4795, 0.3443]
cat 1: [0, 347, 149, 249] and [0.0, 0.4658, 0.2, 0.3342]
cat 2: [0, 10, 20, 10] and [0.0, 0.25, 0.5, 0.25]
cat 3: [0, 337, 85, 439] and [0.0, 0.3914, 0.0987, 0.5099]
[train epoch 18/100] | loss 1.116 | nw acc 0.523 | time 1 min 30 sec
cat 0: [621, 123, 88, 135] and [0.6422, 0.1272, 0.091, 0.1396]
cat 1: [320, 1133, 319, 492] and [0.1413, 0.5004, 0.1409, 0.2173]
cat 2: [2, 25, 70, 23] and [0.0167, 0.2083, 0.5833, 0.1917]
cat 3: [526, 1159, 358, 2162] and [0.1251, 0.2756, 0.0851, 0.5141]
[test epoch 18/100] | loss 0.336 | nw acc 0.398 | time 0 min 20 sec
cat 0: [0, 43, 125, 83] and [0.0, 0.1713, 0.498, 0.3307]
cat 1: [0, 188, 94, 139] and [0.0, 0.4466, 0.2233, 0.3302]
cat 2: [0, 17, 38, 22] and [0.0, 0.2208, 0.4935, 0.2857]
cat 3: [0, 489, 114, 538] and [0.0, 0.4286, 0.0999, 0.4715]
[train epoch 19/100] | loss 1.1105 | nw acc 0.522 | time 1 min 32 sec
cat 0: [624, 118, 85, 132] and [0.6507, 0.123, 0.0886, 0.1376]
cat 1: [310, 1144, 301, 544] and [0.1348, 0.4976, 0.1309, 0.2366]
cat 2: [4, 32, 91, 23] and [0.0267, 0.2133, 0.6067, 0.1533]
cat 3: [531, 1146, 358, 2113] and [0.128, 0.2763, 0.0863, 0.5094]
[test epoch 19/100] | loss 0.328 | nw acc 0.396 | time 0 min 25 sec
cat 0: [0, 28, 104, 67] and [0.0, 0.1407, 0.5226, 0.3367]
cat 1: [0, 244, 139, 213] and [0.0, 0.4094, 0.2332, 0.3574]
cat 2: [0, 16, 31, 16] and [0.0, 0.254, 0.4921, 0.254]
cat 3: [0, 449, 97, 486] and [0.0, 0.4351, 0.094, 0.4709]
[train epoch 20/100] | loss 1.1042 | nw acc 0.528 | time 1 min 35 sec
cat 0: [669, 135, 93, 139] and [0.6458, 0.1303, 0.0898, 0.1342]
cat 1: [338, 1160, 354, 549] and [0.1408, 0.4831, 0.1474, 0.2287]
cat 2: [1, 30, 87, 22] and [0.0071, 0.2143, 0.6214, 0.1571]
cat 3: [461, 1115, 301, 2102] and [0.1159, 0.2802, 0.0756, 0.5283]
[test epoch 20/100] | loss 0.327 | nw acc 0.417 | time 0 min 21 sec
cat 0: [0, 22, 92, 55] and [0.0, 0.1302, 0.5444, 0.3254]
cat 1: [0, 234, 114, 179] and [0.0, 0.444, 0.2163, 0.3397]
cat 2: [0, 20, 45, 26] and [0.0, 0.2198, 0.4945, 0.2857]
cat 3: [0, 461, 120, 522] and [0.0, 0.418, 0.1088, 0.4733]
[train epoch 21/100] | loss 1.1044 | nw acc 0.526 | time 1 min 45 sec
cat 0: [609, 108, 58, 120] and [0.6804, 0.1207, 0.0648, 0.1341]
cat 1: [344, 1170, 340, 528] and [0.1444, 0.4912, 0.1427, 0.2217]
cat 2: [4, 30, 82, 17] and [0.0301, 0.2256, 0.6165, 0.1278]
cat 3: [512, 1132, 355, 2147] and [0.1235, 0.273, 0.0856, 0.5178]
[test epoch 21/100] | loss 0.337 | nw acc 0.395 | time 0 min 19 sec
cat 0: [0, 49, 118, 75] and [0.0, 0.2025, 0.4876, 0.3099]
cat 1: [0, 201, 97, 164] and [0.0, 0.4351, 0.21, 0.355]
cat 2: [0, 30, 43, 28] and [0.0, 0.297, 0.4257, 0.2772]
cat 3: [0, 457, 113, 515] and [0.0, 0.4212, 0.1041, 0.4747]
[train epoch 22/100] | loss 1.095 | nw acc 0.534 | time 1 min 20 sec
cat 0: [670, 123, 81, 136] and [0.6634, 0.1218, 0.0802, 0.1347]
cat 1: [293, 1102, 303, 463] and [0.1356, 0.5099, 0.1402, 0.2143]
cat 2: [4, 33, 94, 15] and [0.0274, 0.226, 0.6438, 0.1027]
cat 3: [502, 1182, 357, 2198] and [0.1184, 0.2788, 0.0842, 0.5185]
[test epoch 22/100] | loss 0.326 | nw acc 0.412 | time 0 min 22 sec
cat 0: [0, 42, 110, 73] and [0.0, 0.1867, 0.4889, 0.3244]
cat 1: [0, 276, 137, 210] and [0.0, 0.443, 0.2199, 0.3371]
cat 2: [0, 19, 39, 23] and [0.0, 0.2346, 0.4815, 0.284]
cat 3: [0, 400, 85, 476] and [0.0, 0.4162, 0.0884, 0.4953]
[train epoch 23/100] | loss 1.0918 | nw acc 0.537 | time 2 min 37 sec
cat 0: [673, 116, 79, 85] and [0.7062, 0.1217, 0.0829, 0.0892]
cat 1: [368, 1183, 312, 575] and [0.1509, 0.4852, 0.128, 0.2358]
cat 2: [3, 29, 98, 20] and [0.02, 0.1933, 0.6533, 0.1333]
cat 3: [425, 1112, 346, 2132] and [0.1059, 0.277, 0.0862, 0.531]
[test epoch 23/100] | loss 0.333 | nw acc 0.407 | time 0 min 21 sec
cat 0: [0, 46, 114, 73] and [0.0, 0.1974, 0.4893, 0.3133]
cat 1: [0, 247, 115, 190] and [0.0, 0.4475, 0.2083, 0.3442]
cat 2: [0, 26, 45, 29] and [0.0, 0.26, 0.45, 0.29]
cat 3: [0, 418, 97, 490] and [0.0, 0.4159, 0.0965, 0.4876]
[train epoch 24/100] | loss 1.1011 | nw acc 0.528 | time 1 min 36 sec
cat 0: [667, 140, 84, 116] and [0.6624, 0.139, 0.0834, 0.1152]
cat 1: [316, 1112, 321, 524] and [0.139, 0.4892, 0.1412, 0.2305]
cat 2: [0, 32, 95, 27] and [0.0, 0.2078, 0.6169, 0.1753]
cat 3: [486, 1156, 335, 2145] and [0.1179, 0.2804, 0.0813, 0.5204]
[test epoch 24/100] | loss 0.335 | nw acc 0.404 | time 0 min 16 sec
cat 0: [0, 30, 103, 61] and [0.0, 0.1546, 0.5309, 0.3144]
cat 1: [0, 210, 104, 177] and [0.0, 0.4277, 0.2118, 0.3605]
cat 2: [0, 22, 44, 22] and [0.0, 0.25, 0.5, 0.25]
cat 3: [0, 475, 120, 522] and [0.0, 0.4252, 0.1074, 0.4673]
[train epoch 25/100] | loss 1.0791 | nw acc 0.535 | time 1 min 32 sec
cat 0: [709, 147, 78, 150] and [0.6541, 0.1356, 0.072, 0.1384]
cat 1: [329, 1142, 300, 517] and [0.1438, 0.4991, 0.1311, 0.226]
cat 2: [3, 34, 101, 22] and [0.0187, 0.2125, 0.6312, 0.1375]
cat 3: [428, 1117, 356, 2123] and [0.1064, 0.2776, 0.0885, 0.5276]
[test epoch 25/100] | loss 0.335 | nw acc 0.394 | time 0 min 17 sec
cat 0: [0, 65, 124, 89] and [0.0, 0.2338, 0.446, 0.3201]
cat 1: [0, 272, 134, 225] and [0.0, 0.4311, 0.2124, 0.3566]
cat 2: [0, 20, 39, 22] and [0.0, 0.2469, 0.4815, 0.2716]
cat 3: [0, 380, 74, 446] and [0.0, 0.4222, 0.0822, 0.4956]
[train epoch 26/100] | loss 1.0869 | nw acc 0.536 | time 1 min 30 sec
cat 0: [672, 103, 75, 97] and [0.7096, 0.1088, 0.0792, 0.1024]
cat 1: [345, 1151, 316, 539] and [0.1467, 0.4896, 0.1344, 0.2293]
cat 2: [3, 40, 105, 21] and [0.0178, 0.2367, 0.6213, 0.1243]
cat 3: [449, 1146, 339, 2155] and [0.1098, 0.2803, 0.0829, 0.527]
[test epoch 26/100] | loss 0.345 | nw acc 0.384 | time 0 min 24 sec
cat 0: [0, 64, 120, 87] and [0.0, 0.2362, 0.4428, 0.321]
cat 1: [0, 213, 114, 185] and [0.0, 0.416, 0.2227, 0.3613]
cat 2: [0, 21, 33, 18] and [0.0, 0.2917, 0.4583, 0.25]
cat 3: [0, 439, 104, 492] and [0.0, 0.4242, 0.1005, 0.4754]
[train epoch 27/100] | loss 1.0896 | nw acc 0.533 | time 1 min 42 sec
cat 0: [671, 139, 74, 141] and [0.6546, 0.1356, 0.0722, 0.1376]
cat 1: [315, 1169, 322, 536] and [0.1345, 0.4991, 0.1375, 0.2289]
cat 2: [0, 24, 105, 23] and [0.0, 0.1579, 0.6908, 0.1513]
cat 3: [483, 1108, 334, 2112] and [0.1196, 0.2745, 0.0827, 0.5232]
[test epoch 27/100] | loss 0.35 | nw acc 0.386 | time 0 min 23 sec
cat 0: [0, 64, 133, 98] and [0.0, 0.2169, 0.4508, 0.3322]
cat 1: [0, 186, 89, 146] and [0.0, 0.4418, 0.2114, 0.3468]
cat 2: [0, 20, 36, 18] and [0.0, 0.2703, 0.4865, 0.2432]
cat 3: [0, 467, 113, 520] and [0.0, 0.4245, 0.1027, 0.4727]
[train epoch 28/100] | loss 1.0837 | nw acc 0.543 | time 1 min 38 sec
cat 0: [702, 133, 70, 98] and [0.6999, 0.1326, 0.0698, 0.0977]
cat 1: [323, 1173, 312, 561] and [0.1363, 0.4951, 0.1317, 0.2368]
cat 2: [5, 28, 123, 18] and [0.0287, 0.1609, 0.7069, 0.1034]
cat 3: [439, 1106, 330, 2135] and [0.1095, 0.2758, 0.0823, 0.5324]
[test epoch 28/100] | loss 0.329 | nw acc 0.405 | time 0 min 25 sec
cat 0: [0, 31, 94, 62] and [0.0, 0.1658, 0.5027, 0.3316]
cat 1: [0, 279, 135, 238] and [0.0, 0.4279, 0.2071, 0.365]
cat 2: [0, 17, 36, 19] and [0.0, 0.2361, 0.5, 0.2639]
cat 3: [0, 410, 106, 463] and [0.0, 0.4188, 0.1083, 0.4729]
[train epoch 29/100] | loss 1.089 | nw acc 0.534 | time 1 min 31 sec
cat 0: [660, 103, 78, 94] and [0.7059, 0.1102, 0.0834, 0.1005]
cat 1: [356, 1221, 336, 607] and [0.1413, 0.4845, 0.1333, 0.2409]
cat 2: [3, 39, 94, 21] and [0.0191, 0.2484, 0.5987, 0.1338]
cat 3: [450, 1077, 327, 2090] and [0.1141, 0.2731, 0.0829, 0.5299]
[test epoch 29/100] | loss 0.345 | nw acc 0.387 | time 0 min 18 sec
cat 0: [0, 54, 121, 89] and [0.0, 0.2045, 0.4583, 0.3371]
cat 1: [0, 201, 101, 169] and [0.0, 0.4268, 0.2144, 0.3588]
cat 2: [0, 23, 40, 22] and [0.0, 0.2706, 0.4706, 0.2588]
cat 3: [0, 459, 109, 502] and [0.0, 0.429, 0.1019, 0.4692]
[train epoch 30/100] | loss 1.0793 | nw acc 0.541 | time 1 min 26 sec
cat 0: [693, 114, 63, 112] and [0.7057, 0.1161, 0.0642, 0.1141]
cat 1: [388, 1310, 381, 647] and [0.1423, 0.4806, 0.1398, 0.2373]
cat 2: [2, 23, 86, 19] and [0.0154, 0.1769, 0.6615, 0.1462]
cat 3: [386, 993, 305, 2034] and [0.1038, 0.2671, 0.082, 0.5471]
[test epoch 30/100] | loss 0.338 | nw acc 0.392 | time 0 min 25 sec
cat 0: [0, 41, 117, 81] and [0.0, 0.1715, 0.4895, 0.3389]
cat 1: [0, 237, 118, 204] and [0.0, 0.424, 0.2111, 0.3649]
cat 2: [0, 21, 40, 21] and [0.0, 0.2561, 0.4878, 0.2561]
cat 3: [0, 438, 96, 476] and [0.0, 0.4337, 0.095, 0.4713]
[train epoch 31/100] | loss 1.0781 | nw acc 0.539 | time 1 min 27 sec
cat 0: [685, 138, 81, 126] and [0.665, 0.134, 0.0786, 0.1223]
cat 1: [303, 1169, 315, 519] and [0.1314, 0.5069, 0.1366, 0.2251]
cat 2: [2, 24, 105, 21] and [0.0132, 0.1579, 0.6908, 0.1382]
cat 3: [479, 1109, 334, 2146] and [0.1177, 0.2726, 0.0821, 0.5275]
[test epoch 31/100] | loss 0.344 | nw acc 0.38 | time 0 min 22 sec
cat 0: [0, 64, 124, 86] and [0.0, 0.2336, 0.4526, 0.3139]
cat 1: [0, 232, 116, 215] and [0.0, 0.4121, 0.206, 0.3819]
cat 2: [0, 22, 39, 22] and [0.0, 0.2651, 0.4699, 0.2651]
cat 3: [0, 419, 92, 459] and [0.0, 0.432, 0.0948, 0.4732]
[train epoch 32/100] | loss 1.0749 | nw acc 0.549 | time 1 min 20 sec
cat 0: [686, 100, 63, 97] and [0.7252, 0.1057, 0.0666, 0.1025]
cat 1: [342, 1220, 311, 525] and [0.1426, 0.5088, 0.1297, 0.2189]
cat 2: [0, 28, 107, 24] and [0.0, 0.1761, 0.673, 0.1509]
cat 3: [441, 1092, 354, 2166] and [0.1088, 0.2694, 0.0873, 0.5344]
[test epoch 32/100] | loss 0.342 | nw acc 0.378 | time 0 min 28 sec
cat 0: [0, 49, 114, 79] and [0.0, 0.2025, 0.4711, 0.3264]
cat 1: [0, 224, 127, 211] and [0.0, 0.3986, 0.226, 0.3754]
cat 2: [0, 15, 26, 17] and [0.0, 0.2586, 0.4483, 0.2931]
cat 3: [0, 449, 104, 475] and [0.0, 0.4368, 0.1012, 0.4621]
[train epoch 33/100] | loss 1.0672 | nw acc 0.548 | time 1 min 23 sec
cat 0: [697, 131, 76, 127] and [0.676, 0.1271, 0.0737, 0.1232]
cat 1: [332, 1177, 318, 487] and [0.1435, 0.5086, 0.1374, 0.2105]
cat 2: [1, 35, 125, 21] and [0.0055, 0.1923, 0.6868, 0.1154]
cat 3: [439, 1097, 316, 2177] and [0.109, 0.2723, 0.0784, 0.5403]
[test epoch 33/100] | loss 0.344 | nw acc 0.394 | time 0 min 17 sec
cat 0: [0, 58, 121, 83] and [0.0, 0.2214, 0.4618, 0.3168]
cat 1: [0, 212, 111, 167] and [0.0, 0.4327, 0.2265, 0.3408]
cat 2: [0, 18, 34, 22] and [0.0, 0.2432, 0.4595, 0.2973]
cat 3: [0, 449, 105, 510] and [0.0, 0.422, 0.0987, 0.4793]
[train epoch 34/100] | loss 1.0661 | nw acc 0.546 | time 1 min 29 sec
cat 0: [699, 120, 63, 98] and [0.7133, 0.1224, 0.0643, 0.1]
cat 1: [330, 1181, 317, 530] and [0.1399, 0.5008, 0.1344, 0.2248]
cat 2: [1, 39, 114, 20] and [0.0057, 0.2241, 0.6552, 0.1149]
cat 3: [439, 1100, 341, 2164] and [0.1086, 0.272, 0.0843, 0.5351]
[test epoch 34/100] | loss 0.34 | nw acc 0.391 | time 0 min 20 sec
cat 0: [0, 42, 112, 61] and [0.0, 0.1953, 0.5209, 0.2837]
cat 1: [0, 234, 122, 215] and [0.0, 0.4098, 0.2137, 0.3765]
cat 2: [0, 16, 32, 21] and [0.0, 0.2319, 0.4638, 0.3043]
cat 3: [0, 445, 105, 485] and [0.0, 0.43, 0.1014, 0.4686]
[train epoch 35/100] | loss 1.0709 | nw acc 0.549 | time 1 min 38 sec
cat 0: [678, 122, 68, 111] and [0.6925, 0.1246, 0.0695, 0.1134]
cat 1: [373, 1276, 345, 566] and [0.1457, 0.4984, 0.1348, 0.2211]
cat 2: [1, 25, 110, 18] and [0.0065, 0.1623, 0.7143, 0.1169]
cat 3: [417, 1017, 312, 2117] and [0.1079, 0.2633, 0.0808, 0.548]
[test epoch 35/100] | loss 0.342 | nw acc 0.402 | time 0 min 27 sec
cat 0: [0, 51, 100, 67] and [0.0, 0.2339, 0.4587, 0.3073]
cat 1: [0, 197, 113, 157] and [0.0, 0.4218, 0.242, 0.3362]
cat 2: [0, 13, 31, 15] and [0.0, 0.2203, 0.5254, 0.2542]
cat 3: [0, 476, 127, 543] and [0.0, 0.4154, 0.1108, 0.4738]
