MaunaNet4(
  (conv1): Conv2d(1, 3, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn1): BatchNorm2d(3, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool1): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv2): Conv2d(3, 64, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool2): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv3): Conv2d(64, 128, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn3): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool3): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv4): Conv2d(128, 1024, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn4): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool4): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (avgpool): AvgPool2d(kernel_size=2, stride=2, padding=0)
  (fc1): Linear(in_features=1024, out_features=4, bias=True)
)
[train epoch 1/200] | loss 0.96694 | nw acc 0.599 | time 1 min 10 sec
cat 0: [992, 140, 165, 97] and [0.7116, 0.1004, 0.1184, 0.0696]
cat 1: [160, 1557, 305, 733] and [0.0581, 0.5652, 0.1107, 0.2661]
cat 2: [19, 37, 51, 21] and [0.1484, 0.2891, 0.3984, 0.1641]
cat 3: [298, 706, 314, 1961] and [0.0909, 0.2153, 0.0958, 0.598]
[test epoch 1/200] | loss 0.342 | nw acc 0.42 | time 0 min 16 sec
cat 0: [0, 8, 35, 26] and [0.0, 0.1159, 0.5072, 0.3768]
cat 1: [0, 109, 31, 59] and [0.0, 0.5477, 0.1558, 0.2965]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 620, 305, 697] and [0.0, 0.3822, 0.188, 0.4297]
[train epoch 2/200] | loss 0.82683 | nw acc 0.703 | time 1 min 10 sec
cat 0: [1260, 83, 133, 91] and [0.8041, 0.053, 0.0849, 0.0581]
cat 1: [117, 1846, 343, 473] and [0.0421, 0.6643, 0.1234, 0.1702]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [92, 511, 359, 2248] and [0.0287, 0.1592, 0.1118, 0.7003]
[test epoch 2/200] | loss 0.297 | nw acc 0.455 | time 0 min 16 sec
cat 0: [0, 9, 48, 57] and [0.0, 0.0789, 0.4211, 0.5]
cat 1: [0, 692, 269, 544] and [0.0, 0.4598, 0.1787, 0.3615]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 36, 54, 181] and [0.0, 0.1328, 0.1993, 0.6679]
[train epoch 3/200] | loss 0.75654 | nw acc 0.745 | time 1 min 8 sec
cat 0: [1281, 56, 167, 77] and [0.8102, 0.0354, 0.1056, 0.0487]
cat 1: [69, 1909, 343, 251] and [0.0268, 0.7422, 0.1334, 0.0976]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [119, 475, 325, 2484] and [0.035, 0.1396, 0.0955, 0.7299]
[test epoch 3/200] | loss 0.293 | nw acc 0.474 | time 0 min 16 sec
cat 0: [0, 1, 10, 21] and [0.0, 0.0312, 0.3125, 0.6562]
cat 1: [0, 681, 268, 531] and [0.0, 0.4601, 0.1811, 0.3588]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 55, 93, 230] and [0.0, 0.1455, 0.246, 0.6085]
[train epoch 4/200] | loss 0.63813 | nw acc 0.82 | time 1 min 7 sec
cat 0: [1389, 35, 153, 49] and [0.8542, 0.0215, 0.0941, 0.0301]
cat 1: [30, 2255, 401, 164] and [0.0105, 0.7912, 0.1407, 0.0575]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [50, 150, 281, 2599] and [0.0162, 0.0487, 0.0912, 0.8438]
[test epoch 4/200] | loss 0.349 | nw acc 0.431 | time 0 min 16 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [0, 47, 0, 2] and [0.0, 0.9592, 0.0, 0.0408]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 690, 371, 780] and [0.0, 0.3748, 0.2015, 0.4237]
[train epoch 5/200] | loss 0.60318 | nw acc 0.837 | time 1 min 7 sec
cat 0: [1403, 24, 143, 41] and [0.8709, 0.0149, 0.0888, 0.0255]
cat 1: [32, 2297, 404, 116] and [0.0112, 0.8062, 0.1418, 0.0407]
cat 2: [0, 0, 20, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [34, 119, 268, 2655] and [0.0111, 0.0387, 0.0871, 0.8631]
[test epoch 5/200] | loss 0.313 | nw acc 0.427 | time 0 min 16 sec
cat 0: [0, 131, 122, 121] and [0.0, 0.3503, 0.3262, 0.3235]
cat 1: [0, 313, 105, 169] and [0.0, 0.5332, 0.1789, 0.2879]
cat 2: [0, 7, 15, 1] and [0.0, 0.3043, 0.6522, 0.0435]
cat 3: [0, 286, 129, 491] and [0.0, 0.3157, 0.1424, 0.5419]
[train epoch 6/200] | loss 0.48472 | nw acc 0.93 | time 1 min 7 sec
cat 0: [1429, 21, 33, 23] and [0.9489, 0.0139, 0.0219, 0.0153]
cat 1: [20, 2338, 141, 57] and [0.0078, 0.9147, 0.0552, 0.0223]
cat 2: [2, 24, 607, 21] and [0.0031, 0.0367, 0.9281, 0.0321]
cat 3: [18, 57, 54, 2711] and [0.0063, 0.0201, 0.019, 0.9546]
[test epoch 6/200] | loss 0.281 | nw acc 0.543 | time 0 min 16 sec
cat 0: [0, 12, 17, 41] and [0.0, 0.1714, 0.2429, 0.5857]
cat 1: [0, 420, 71, 182] and [0.0, 0.6241, 0.1055, 0.2704]
cat 2: [0, 91, 101, 37] and [0.0, 0.3974, 0.441, 0.1616]
cat 3: [0, 214, 182, 522] and [0.0, 0.2331, 0.1983, 0.5686]
[train epoch 7/200] | loss 0.43049 | nw acc 0.96 | time 1 min 8 sec
cat 0: [1438, 7, 9, 20] and [0.9756, 0.0047, 0.0061, 0.0136]
cat 1: [3, 2378, 70, 29] and [0.0012, 0.9589, 0.0282, 0.0117]
cat 2: [9, 22, 735, 6] and [0.0117, 0.0285, 0.9521, 0.0078]
cat 3: [19, 33, 21, 2757] and [0.0067, 0.0117, 0.0074, 0.9742]
[test epoch 7/200] | loss 0.275 | nw acc 0.555 | time 0 min 16 sec
cat 0: [0, 0, 0, 9] and [0.0, 0.0, 0.0, 1.0]
cat 1: [0, 698, 193, 420] and [0.0, 0.5324, 0.1472, 0.3204]
cat 2: [0, 0, 26, 11] and [0.0, 0.0, 0.7027, 0.2973]
cat 3: [0, 39, 152, 342] and [0.0, 0.0732, 0.2852, 0.6417]
[train epoch 8/200] | loss 0.39763 | nw acc 0.975 | time 1 min 7 sec
cat 0: [1450, 4, 3, 9] and [0.9891, 0.0027, 0.002, 0.0061]
cat 1: [5, 2405, 43, 15] and [0.002, 0.9745, 0.0174, 0.0061]
cat 2: [7, 9, 781, 1] and [0.0088, 0.0113, 0.9787, 0.0013]
cat 3: [7, 22, 8, 2787] and [0.0025, 0.0078, 0.0028, 0.9869]
[test epoch 8/200] | loss 0.275 | nw acc 0.543 | time 0 min 16 sec
cat 0: [0, 0, 0, 1] and [0.0, 0.0, 0.0, 1.0]
cat 1: [0, 722, 201, 494] and [0.0, 0.5095, 0.1418, 0.3486]
cat 2: [0, 6, 41, 8] and [0.0, 0.1091, 0.7455, 0.1455]
cat 3: [0, 9, 129, 279] and [0.0, 0.0216, 0.3094, 0.6691]
[train epoch 9/200] | loss 0.43541 | nw acc 0.95 | time 1 min 7 sec
cat 0: [1429, 16, 5, 18] and [0.9734, 0.0109, 0.0034, 0.0123]
cat 1: [10, 2325, 58, 59] and [0.0041, 0.9482, 0.0237, 0.0241]
cat 2: [7, 38, 759, 9] and [0.0086, 0.0467, 0.9336, 0.0111]
cat 3: [23, 61, 13, 2726] and [0.0081, 0.0216, 0.0046, 0.9656]
[test epoch 9/200] | loss 0.3 | nw acc 0.48 | time 0 min 16 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [0, 700, 261, 572] and [0.0, 0.4566, 0.1703, 0.3731]
cat 2: [0, 0, 12, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 37, 98, 210] and [0.0, 0.1072, 0.2841, 0.6087]
[train epoch 10/200] | loss 0.37361 | nw acc 0.983 | time 1 min 7 sec
cat 0: [1457, 4, 0, 5] and [0.9939, 0.0027, 0.0, 0.0034]
cat 1: [2, 2421, 18, 10] and [0.0008, 0.9878, 0.0073, 0.0041]
cat 2: [5, 2, 812, 0] and [0.0061, 0.0024, 0.9915, 0.0]
cat 3: [5, 13, 5, 2797] and [0.0018, 0.0046, 0.0018, 0.9918]
[test epoch 10/200] | loss 0.297 | nw acc 0.499 | time 0 min 16 sec
cat 0: [0, 30, 29, 53] and [0.0, 0.2679, 0.2589, 0.4732]
cat 1: [0, 402, 81, 316] and [0.0, 0.5031, 0.1014, 0.3955]
cat 2: [0, 157, 170, 26] and [0.0, 0.4448, 0.4816, 0.0737]
cat 3: [0, 148, 91, 387] and [0.0, 0.2364, 0.1454, 0.6182]
[train epoch 11/200] | loss 0.36229 | nw acc 0.988 | time 1 min 7 sec
cat 0: [1465, 1, 1, 4] and [0.9959, 0.0007, 0.0007, 0.0027]
cat 1: [2, 2430, 11, 3] and [0.0008, 0.9935, 0.0045, 0.0012]
cat 2: [2, 1, 822, 1] and [0.0024, 0.0012, 0.9952, 0.0012]
cat 3: [0, 8, 1, 2804] and [0.0, 0.0028, 0.0004, 0.9968]
[test epoch 11/200] | loss 0.276 | nw acc 0.558 | time 0 min 16 sec
cat 0: [0, 0, 0, 2] and [0.0, 0.0, 0.0, 1.0]
cat 1: [0, 413, 94, 191] and [0.0, 0.5917, 0.1347, 0.2736]
cat 2: [0, 44, 75, 5] and [0.0, 0.3548, 0.6048, 0.0403]
cat 3: [0, 280, 202, 584] and [0.0, 0.2627, 0.1895, 0.5478]
[train epoch 12/200] | loss 0.35685 | nw acc 0.989 | time 1 min 6 sec
cat 0: [1465, 2, 0, 2] and [0.9973, 0.0014, 0.0, 0.0014]
cat 1: [2, 2429, 7, 1] and [0.0008, 0.9959, 0.0029, 0.0004]
cat 2: [1, 0, 827, 1] and [0.0012, 0.0, 0.9976, 0.0012]
cat 3: [1, 9, 1, 2808] and [0.0004, 0.0032, 0.0004, 0.9961]
[test epoch 12/200] | loss 0.273 | nw acc 0.555 | time 0 min 16 sec
cat 0: [0, 11, 8, 29] and [0.0, 0.2292, 0.1667, 0.6042]
cat 1: [0, 447, 82, 233] and [0.0, 0.5866, 0.1076, 0.3058]
cat 2: [0, 131, 131, 33] and [0.0, 0.4441, 0.4441, 0.1119]
cat 3: [0, 148, 150, 487] and [0.0, 0.1885, 0.1911, 0.6204]
[train epoch 13/200] | loss 0.36027 | nw acc 0.989 | time 1 min 7 sec
cat 0: [1468, 1, 0, 1] and [0.9986, 0.0007, 0.0, 0.0007]
cat 1: [1, 2431, 6, 6] and [0.0004, 0.9947, 0.0025, 0.0025]
cat 2: [0, 2, 828, 1] and [0.0, 0.0024, 0.9964, 0.0012]
cat 3: [0, 6, 1, 2804] and [0.0, 0.0021, 0.0004, 0.9975]
[test epoch 13/200] | loss 0.298 | nw acc 0.511 | time 0 min 16 sec
cat 0: [0, 27, 25, 83] and [0.0, 0.2, 0.1852, 0.6148]
cat 1: [0, 379, 55, 105] and [0.0, 0.7032, 0.102, 0.1948]
cat 2: [0, 0, 8, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 331, 283, 594] and [0.0, 0.274, 0.2343, 0.4917]
[train epoch 14/200] | loss 0.36241 | nw acc 0.989 | time 1 min 7 sec
cat 0: [1465, 1, 3, 0] and [0.9973, 0.0007, 0.002, 0.0]
cat 1: [2, 2432, 4, 1] and [0.0008, 0.9971, 0.0016, 0.0004]
cat 2: [2, 2, 825, 2] and [0.0024, 0.0024, 0.9928, 0.0024]
cat 3: [0, 5, 3, 2809] and [0.0, 0.0018, 0.0011, 0.9972]
[test epoch 14/200] | loss 0.369 | nw acc 0.407 | time 0 min 16 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [0, 2, 0, 2] and [0.0, 0.5, 0.0, 0.5]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 735, 371, 780] and [0.0, 0.3897, 0.1967, 0.4136]
[train epoch 15/200] | loss 0.42815 | nw acc 0.952 | time 1 min 7 sec
cat 0: [1422, 12, 6, 22] and [0.9726, 0.0082, 0.0041, 0.015]
cat 1: [18, 2312, 27, 45] and [0.0075, 0.9625, 0.0112, 0.0187]
cat 2: [3, 16, 780, 11] and [0.0037, 0.0198, 0.963, 0.0136]
cat 3: [26, 100, 22, 2734] and [0.009, 0.0347, 0.0076, 0.9486]
[test epoch 15/200] | loss 0.288 | nw acc 0.522 | time 0 min 16 sec
cat 0: [0, 7, 2, 18] and [0.0, 0.2593, 0.0741, 0.6667]
cat 1: [0, 343, 51, 158] and [0.0, 0.6214, 0.0924, 0.2862]
cat 2: [0, 142, 137, 84] and [0.0, 0.3912, 0.3774, 0.2314]
cat 3: [0, 245, 181, 522] and [0.0, 0.2584, 0.1909, 0.5506]
[train epoch 16/200] | loss 0.36161 | nw acc 0.99 | time 1 min 7 sec
cat 0: [1463, 2, 0, 1] and [0.998, 0.0014, 0.0, 0.0007]
cat 1: [0, 2433, 1, 3] and [0.0, 0.9984, 0.0004, 0.0012]
cat 2: [1, 0, 833, 0] and [0.0012, 0.0, 0.9988, 0.0]
cat 3: [5, 5, 1, 2808] and [0.0018, 0.0018, 0.0004, 0.9961]
[test epoch 16/200] | loss 0.313 | nw acc 0.468 | time 0 min 16 sec
cat 0: [0, 44, 21, 62] and [0.0, 0.3465, 0.1654, 0.4882]
cat 1: [0, 227, 25, 90] and [0.0, 0.6637, 0.0731, 0.2632]
cat 2: [0, 81, 53, 12] and [0.0, 0.5548, 0.363, 0.0822]
cat 3: [0, 385, 272, 618] and [0.0, 0.302, 0.2133, 0.4847]
[train epoch 17/200] | loss 0.35425 | nw acc 0.99 | time 1 min 7 sec
cat 0: [1466, 1, 0, 0] and [0.9993, 0.0007, 0.0, 0.0]
cat 1: [1, 2433, 2, 0] and [0.0004, 0.9988, 0.0008, 0.0]
cat 2: [0, 0, 832, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [2, 6, 1, 2812] and [0.0007, 0.0021, 0.0004, 0.9968]
[test epoch 17/200] | loss 0.287 | nw acc 0.536 | time 0 min 16 sec
cat 0: [0, 5, 0, 7] and [0.0, 0.4167, 0.0, 0.5833]
cat 1: [0, 328, 34, 148] and [0.0, 0.6431, 0.0667, 0.2902]
cat 2: [0, 138, 106, 32] and [0.0, 0.5, 0.3841, 0.1159]
cat 3: [0, 266, 231, 595] and [0.0, 0.2436, 0.2115, 0.5449]
[train epoch 18/200] | loss 0.35134 | nw acc 0.991 | time 1 min 6 sec
cat 0: [1468, 1, 0, 1] and [0.9986, 0.0007, 0.0, 0.0007]
cat 1: [0, 2436, 1, 0] and [0.0, 0.9996, 0.0004, 0.0]
cat 2: [0, 0, 834, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [1, 3, 0, 2811] and [0.0004, 0.0011, 0.0, 0.9986]
[test epoch 18/200] | loss 0.325 | nw acc 0.471 | time 0 min 16 sec
cat 0: [0, 27, 62, 62] and [0.0, 0.1788, 0.4106, 0.4106]
cat 1: [0, 614, 238, 438] and [0.0, 0.476, 0.1845, 0.3395]
cat 2: [0, 11, 12, 3] and [0.0, 0.4231, 0.4615, 0.1154]
cat 3: [0, 85, 59, 279] and [0.0, 0.2009, 0.1395, 0.6596]
[train epoch 19/200] | loss 0.40879 | nw acc 0.961 | time 1 min 7 sec
cat 0: [1422, 41, 29, 81] and [0.904, 0.0261, 0.0184, 0.0515]
cat 1: [9, 2374, 4, 7] and [0.0038, 0.9916, 0.0017, 0.0029]
cat 2: [5, 1, 798, 1] and [0.0062, 0.0012, 0.9913, 0.0012]
cat 3: [33, 24, 4, 2723] and [0.0119, 0.0086, 0.0014, 0.9781]
[test epoch 19/200] | loss 0.334 | nw acc 0.46 | time 0 min 16 sec
cat 0: [0, 10, 1, 16] and [0.0, 0.3704, 0.037, 0.5926]
cat 1: [0, 143, 13, 31] and [0.0, 0.7647, 0.0695, 0.1658]
cat 2: [0, 6, 7, 2] and [0.0, 0.4, 0.4667, 0.1333]
cat 3: [0, 578, 350, 733] and [0.0, 0.348, 0.2107, 0.4413]
[train epoch 20/200] | loss 0.35533 | nw acc 0.991 | time 1 min 7 sec
cat 0: [1465, 1, 0, 1] and [0.9986, 0.0007, 0.0, 0.0007]
cat 1: [1, 2435, 2, 0] and [0.0004, 0.9988, 0.0008, 0.0]
cat 2: [1, 0, 833, 0] and [0.0012, 0.0, 0.9988, 0.0]
cat 3: [2, 4, 0, 2811] and [0.0007, 0.0014, 0.0, 0.9979]
[test epoch 20/200] | loss 0.307 | nw acc 0.484 | time 0 min 16 sec
cat 0: [0, 28, 4, 48] and [0.0, 0.35, 0.05, 0.6]
cat 1: [0, 235, 41, 105] and [0.0, 0.6168, 0.1076, 0.2756]
cat 2: [0, 128, 119, 53] and [0.0, 0.4267, 0.3967, 0.1767]
cat 3: [0, 346, 207, 576] and [0.0, 0.3065, 0.1833, 0.5102]
[train epoch 21/200] | loss 0.35167 | nw acc 0.991 | time 1 min 7 sec
cat 0: [1468, 1, 0, 1] and [0.9986, 0.0007, 0.0, 0.0007]
cat 1: [1, 2438, 1, 0] and [0.0004, 0.9992, 0.0004, 0.0]
cat 2: [0, 0, 834, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 1, 0, 2811] and [0.0, 0.0004, 0.0, 0.9996]
[test epoch 21/200] | loss 0.337 | nw acc 0.427 | time 0 min 16 sec
cat 0: [0, 0, 1, 6] and [0.0, 0.0, 0.1429, 0.8571]
cat 1: [0, 189, 58, 174] and [0.0, 0.4489, 0.1378, 0.4133]
cat 2: [0, 21, 29, 0] and [0.0, 0.42, 0.58, 0.0]
cat 3: [0, 527, 283, 602] and [0.0, 0.3732, 0.2004, 0.4263]
[train epoch 22/200] | loss 0.40143 | nw acc 0.964 | time 1 min 8 sec
cat 0: [1424, 4, 0, 5] and [0.9937, 0.0028, 0.0, 0.0035]
cat 1: [31, 2394, 46, 62] and [0.0122, 0.9451, 0.0182, 0.0245]
cat 2: [1, 4, 783, 2] and [0.0013, 0.0051, 0.9911, 0.0025]
cat 3: [13, 38, 6, 2743] and [0.0046, 0.0136, 0.0021, 0.9796]
[test epoch 22/200] | loss 0.307 | nw acc 0.457 | time 0 min 16 sec
cat 0: [0, 102, 49, 88] and [0.0, 0.4268, 0.205, 0.3682]
cat 1: [0, 251, 23, 98] and [0.0, 0.6747, 0.0618, 0.2634]
cat 2: [0, 69, 53, 22] and [0.0, 0.4792, 0.3681, 0.1528]
cat 3: [0, 315, 246, 574] and [0.0, 0.2775, 0.2167, 0.5057]
[train epoch 23/200] | loss 0.35235 | nw acc 0.99 | time 1 min 7 sec
cat 0: [1465, 1, 0, 1] and [0.9986, 0.0007, 0.0, 0.0007]
cat 1: [2, 2432, 1, 3] and [0.0008, 0.9975, 0.0004, 0.0012]
cat 2: [0, 2, 834, 0] and [0.0, 0.0024, 0.9976, 0.0]
cat 3: [2, 5, 0, 2808] and [0.0007, 0.0018, 0.0, 0.9975]
[test epoch 23/200] | loss 0.285 | nw acc 0.543 | time 0 min 16 sec
cat 0: [0, 8, 4, 17] and [0.0, 0.2759, 0.1379, 0.5862]
cat 1: [0, 534, 152, 353] and [0.0, 0.514, 0.1463, 0.3397]
cat 2: [0, 153, 141, 44] and [0.0, 0.4527, 0.4172, 0.1302]
cat 3: [0, 42, 74, 368] and [0.0, 0.0868, 0.1529, 0.7603]
[train epoch 24/200] | loss 0.34831 | nw acc 0.991 | time 1 min 7 sec
cat 0: [1468, 1, 0, 0] and [0.9993, 0.0007, 0.0, 0.0]
cat 1: [1, 2436, 0, 0] and [0.0004, 0.9996, 0.0, 0.0]
cat 2: [0, 0, 835, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 3, 0, 2812] and [0.0, 0.0011, 0.0, 0.9989]
[test epoch 24/200] | loss 0.317 | nw acc 0.453 | time 0 min 16 sec
cat 0: [0, 33, 7, 66] and [0.0, 0.3113, 0.066, 0.6226]
cat 1: [0, 305, 55, 203] and [0.0, 0.5417, 0.0977, 0.3606]
cat 2: [0, 94, 71, 20] and [0.0, 0.5081, 0.3838, 0.1081]
cat 3: [0, 305, 238, 493] and [0.0, 0.2944, 0.2297, 0.4759]
[train epoch 25/200] | loss 0.34614 | nw acc 0.992 | time 1 min 7 sec
cat 0: [1469, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2437, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 1, 834, 0] and [0.0, 0.0012, 0.9988, 0.0]
cat 3: [0, 2, 1, 2812] and [0.0, 0.0007, 0.0004, 0.9989]
[test epoch 25/200] | loss 0.294 | nw acc 0.503 | time 0 min 16 sec
cat 0: [0, 17, 3, 42] and [0.0, 0.2742, 0.0484, 0.6774]
cat 1: [0, 362, 60, 251] and [0.0, 0.5379, 0.0892, 0.373]
cat 2: [0, 188, 149, 34] and [0.0, 0.5067, 0.4016, 0.0916]
cat 3: [0, 170, 159, 455] and [0.0, 0.2168, 0.2028, 0.5804]
[train epoch 26/200] | loss 0.3443 | nw acc 0.992 | time 1 min 10 sec
cat 0: [1469, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2439, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 1, 835, 0] and [0.0, 0.0012, 0.9988, 0.0]
cat 3: [0, 0, 0, 2812] and [0.0, 0.0, 0.0, 1.0]
[test epoch 26/200] | loss 0.289 | nw acc 0.527 | time 0 min 16 sec
cat 0: [0, 10, 1, 24] and [0.0, 0.2857, 0.0286, 0.6857]
cat 1: [0, 507, 137, 342] and [0.0, 0.5142, 0.1389, 0.3469]
cat 2: [0, 95, 102, 13] and [0.0, 0.4524, 0.4857, 0.0619]
cat 3: [0, 125, 131, 403] and [0.0, 0.1897, 0.1988, 0.6115]
[train epoch 27/200] | loss 0.34609 | nw acc 0.992 | time 1 min 7 sec
cat 0: [1469, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2438, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 835, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 2, 0, 2812] and [0.0, 0.0007, 0.0, 0.9993]
[test epoch 27/200] | loss 0.317 | nw acc 0.482 | time 0 min 16 sec
cat 0: [0, 8, 24, 16] and [0.0, 0.1667, 0.5, 0.3333]
cat 1: [0, 616, 254, 482] and [0.0, 0.4556, 0.1879, 0.3565]
cat 2: [0, 19, 27, 1] and [0.0, 0.4043, 0.5745, 0.0213]
cat 3: [0, 94, 66, 283] and [0.0, 0.2122, 0.149, 0.6388]
[train epoch 28/200] | loss 0.3661 | nw acc 0.985 | time 1 min 9 sec
cat 0: [1463, 4, 0, 5] and [0.9939, 0.0027, 0.0, 0.0034]
cat 1: [3, 2424, 7, 13] and [0.0012, 0.9906, 0.0029, 0.0053]
cat 2: [0, 1, 826, 2] and [0.0, 0.0012, 0.9964, 0.0024]
cat 3: [3, 11, 2, 2792] and [0.0011, 0.0039, 0.0007, 0.9943]
[test epoch 28/200] | loss 0.322 | nw acc 0.483 | time 0 min 16 sec
cat 0: [0, 13, 10, 31] and [0.0, 0.2407, 0.1852, 0.5741]
cat 1: [0, 389, 102, 360] and [0.0, 0.4571, 0.1199, 0.423]
cat 2: [0, 311, 226, 79] and [0.0, 0.5049, 0.3669, 0.1282]
cat 3: [0, 24, 33, 312] and [0.0, 0.065, 0.0894, 0.8455]
[train epoch 29/200] | loss 0.35251 | nw acc 0.991 | time 1 min 7 sec
cat 0: [1467, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [1, 2434, 0, 0] and [0.0004, 0.9996, 0.0, 0.0]
cat 2: [1, 3, 833, 1] and [0.0012, 0.0036, 0.994, 0.0012]
cat 3: [0, 3, 2, 2811] and [0.0, 0.0011, 0.0007, 0.9982]
[test epoch 29/200] | loss 0.285 | nw acc 0.533 | time 0 min 16 sec
cat 0: [0, 18, 8, 19] and [0.0, 0.4, 0.1778, 0.4222]
cat 1: [0, 428, 102, 186] and [0.0, 0.5978, 0.1425, 0.2598]
cat 2: [0, 7, 18, 0] and [0.0, 0.28, 0.72, 0.0]
cat 3: [0, 284, 243, 577] and [0.0, 0.2572, 0.2201, 0.5226]
[train epoch 30/200] | loss 0.34805 | nw acc 0.992 | time 1 min 7 sec
cat 0: [1469, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2439, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 1, 834, 0] and [0.0, 0.0012, 0.9988, 0.0]
cat 3: [0, 0, 1, 2812] and [0.0, 0.0, 0.0004, 0.9996]
[test epoch 30/200] | loss 0.31 | nw acc 0.479 | time 0 min 16 sec
cat 0: [0, 21, 2, 40] and [0.0, 0.3333, 0.0317, 0.6349]
cat 1: [0, 349, 85, 194] and [0.0, 0.5557, 0.1354, 0.3089]
cat 2: [0, 11, 24, 1] and [0.0, 0.3056, 0.6667, 0.0278]
cat 3: [0, 356, 260, 547] and [0.0, 0.3061, 0.2236, 0.4703]
[train epoch 31/200] | loss 0.34575 | nw acc 0.992 | time 1 min 7 sec
cat 0: [1468, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2440, 0, 1] and [0.0, 0.9996, 0.0, 0.0004]
cat 2: [0, 0, 835, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [1, 0, 0, 2811] and [0.0004, 0.0, 0.0, 0.9996]
[test epoch 31/200] | loss 0.301 | nw acc 0.506 | time 0 min 16 sec
cat 0: [0, 14, 1, 31] and [0.0, 0.3043, 0.0217, 0.6739]
cat 1: [0, 355, 87, 256] and [0.0, 0.5086, 0.1246, 0.3668]
cat 2: [0, 117, 147, 25] and [0.0, 0.4048, 0.5087, 0.0865]
cat 3: [0, 251, 136, 470] and [0.0, 0.2929, 0.1587, 0.5484]
[train epoch 32/200] | loss 0.34622 | nw acc 0.991 | time 1 min 7 sec
cat 0: [1468, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [1, 2438, 0, 2] and [0.0004, 0.9988, 0.0, 0.0008]
cat 2: [0, 0, 835, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 2, 0, 2810] and [0.0, 0.0007, 0.0, 0.9993]
[test epoch 32/200] | loss 0.31 | nw acc 0.498 | time 0 min 16 sec
cat 0: [0, 55, 36, 66] and [0.0, 0.3503, 0.2293, 0.4204]
cat 1: [0, 430, 99, 309] and [0.0, 0.5131, 0.1181, 0.3687]
cat 2: [0, 105, 131, 11] and [0.0, 0.4251, 0.5304, 0.0445]
cat 3: [0, 147, 105, 396] and [0.0, 0.2269, 0.162, 0.6111]
[train epoch 33/200] | loss 0.34523 | nw acc 0.992 | time 1 min 7 sec
cat 0: [1469, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2440, 0, 1] and [0.0, 0.9996, 0.0, 0.0004]
cat 2: [0, 0, 835, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 2811] and [0.0, 0.0, 0.0, 1.0]
[test epoch 33/200] | loss 0.293 | nw acc 0.528 | time 0 min 16 sec
cat 0: [0, 20, 7, 35] and [0.0, 0.3226, 0.1129, 0.5645]
cat 1: [0, 394, 81, 216] and [0.0, 0.5702, 0.1172, 0.3126]
cat 2: [0, 41, 92, 3] and [0.0, 0.3015, 0.6765, 0.0221]
cat 3: [0, 282, 191, 528] and [0.0, 0.2817, 0.1908, 0.5275]
[train epoch 34/200] | loss 0.3445 | nw acc 0.992 | time 1 min 8 sec
cat 0: [1469, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2440, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 835, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 2812] and [0.0, 0.0, 0.0, 1.0]
[test epoch 34/200] | loss 0.295 | nw acc 0.524 | time 0 min 16 sec
cat 0: [0, 9, 0, 18] and [0.0, 0.3333, 0.0, 0.6667]
cat 1: [0, 336, 47, 140] and [0.0, 0.6424, 0.0899, 0.2677]
cat 2: [0, 14, 50, 3] and [0.0, 0.209, 0.7463, 0.0448]
cat 3: [0, 378, 274, 621] and [0.0, 0.2969, 0.2152, 0.4878]
[train epoch 35/200] | loss 0.34522 | nw acc 0.992 | time 1 min 9 sec
cat 0: [1469, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2440, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 835, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 2812] and [0.0, 0.0, 0.0, 1.0]
[test epoch 35/200] | loss 0.302 | nw acc 0.511 | time 0 min 16 sec
cat 0: [0, 19, 1, 26] and [0.0, 0.413, 0.0217, 0.5652]
cat 1: [0, 248, 22, 77] and [0.0, 0.7147, 0.0634, 0.2219]
cat 2: [0, 48, 73, 19] and [0.0, 0.3429, 0.5214, 0.1357]
cat 3: [0, 422, 275, 660] and [0.0, 0.311, 0.2027, 0.4864]
[train epoch 36/200] | loss 0.34449 | nw acc 0.992 | time 1 min 7 sec
cat 0: [1469, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2440, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 835, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 2812] and [0.0, 0.0, 0.0, 1.0]
[test epoch 36/200] | loss 0.393 | nw acc 0.392 | time 0 min 16 sec
cat 0: [0, 4, 8, 2] and [0.0, 0.2857, 0.5714, 0.1429]
cat 1: [0, 731, 351, 748] and [0.0, 0.3995, 0.1918, 0.4087]
cat 2: [0, 2, 11, 22] and [0.0, 0.0571, 0.3143, 0.6286]
cat 3: [0, 0, 1, 10] and [0.0, 0.0, 0.0909, 0.9091]
[train epoch 37/200] | loss 0.39443 | nw acc 0.972 | time 1 min 7 sec
cat 0: [1437, 13, 3, 20] and [0.9756, 0.0088, 0.002, 0.0136]
cat 1: [2, 2395, 7, 27] and [0.0008, 0.9852, 0.0029, 0.0111]
cat 2: [2, 3, 813, 6] and [0.0024, 0.0036, 0.9867, 0.0073]
cat 3: [28, 29, 12, 2759] and [0.0099, 0.0103, 0.0042, 0.9756]
[test epoch 37/200] | loss 0.325 | nw acc 0.491 | time 0 min 16 sec
cat 0: [0, 5, 13, 9] and [0.0, 0.1852, 0.4815, 0.3333]
cat 1: [0, 625, 265, 488] and [0.0, 0.4536, 0.1923, 0.3541]
cat 2: [0, 96, 62, 30] and [0.0, 0.5106, 0.3298, 0.1596]
cat 3: [0, 11, 31, 255] and [0.0, 0.037, 0.1044, 0.8586]
[train epoch 38/200] | loss 0.35922 | nw acc 0.987 | time 1 min 7 sec
cat 0: [1464, 2, 0, 3] and [0.9966, 0.0014, 0.0, 0.002]
cat 1: [0, 2422, 2, 8] and [0.0, 0.9959, 0.0008, 0.0033]
cat 2: [1, 0, 830, 0] and [0.0012, 0.0, 0.9988, 0.0]
cat 3: [4, 16, 3, 2801] and [0.0014, 0.0057, 0.0011, 0.9919]
[test epoch 38/200] | loss 0.303 | nw acc 0.504 | time 0 min 16 sec
cat 0: [0, 32, 5, 24] and [0.0, 0.5246, 0.082, 0.3934]
cat 1: [0, 253, 35, 119] and [0.0, 0.6216, 0.086, 0.2924]
cat 2: [0, 356, 274, 199] and [0.0, 0.4294, 0.3305, 0.24]
cat 3: [0, 96, 57, 440] and [0.0, 0.1619, 0.0961, 0.742]
[train epoch 39/200] | loss 0.34636 | nw acc 0.992 | time 1 min 7 sec
cat 0: [1468, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2440, 0, 1] and [0.0, 0.9996, 0.0, 0.0004]
cat 2: [0, 0, 835, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [1, 0, 0, 2811] and [0.0004, 0.0, 0.0, 0.9996]
[test epoch 39/200] | loss 0.314 | nw acc 0.5 | time 0 min 16 sec
cat 0: [0, 12, 5, 15] and [0.0, 0.375, 0.1562, 0.4688]
cat 1: [0, 291, 47, 149] and [0.0, 0.5975, 0.0965, 0.306]
cat 2: [0, 46, 60, 9] and [0.0, 0.4, 0.5217, 0.0783]
cat 3: [0, 388, 259, 609] and [0.0, 0.3089, 0.2062, 0.4849]
[train epoch 40/200] | loss 0.34668 | nw acc 0.992 | time 1 min 8 sec
cat 0: [1468, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2438, 0, 1] and [0.0, 0.9996, 0.0, 0.0004]
cat 2: [0, 0, 835, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [1, 2, 0, 2811] and [0.0004, 0.0007, 0.0, 0.9989]
[test epoch 40/200] | loss 0.29 | nw acc 0.533 | time 0 min 16 sec
cat 0: [0, 6, 1, 9] and [0.0, 0.375, 0.0625, 0.5625]
cat 1: [0, 625, 240, 395] and [0.0, 0.496, 0.1905, 0.3135]
cat 2: [0, 18, 23, 3] and [0.0, 0.4091, 0.5227, 0.0682]
cat 3: [0, 88, 107, 375] and [0.0, 0.1544, 0.1877, 0.6579]
[train epoch 41/200] | loss 0.34542 | nw acc 0.992 | time 1 min 12 sec
cat 0: [1469, 1, 0, 0] and [0.9993, 0.0007, 0.0, 0.0]
cat 1: [0, 2438, 0, 1] and [0.0, 0.9996, 0.0, 0.0004]
cat 2: [0, 0, 835, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 1, 0, 2811] and [0.0, 0.0004, 0.0, 0.9996]
[test epoch 41/200] | loss 0.316 | nw acc 0.466 | time 0 min 16 sec
cat 0: [0, 16, 10, 22] and [0.0, 0.3333, 0.2083, 0.4583]
cat 1: [0, 340, 94, 236] and [0.0, 0.5075, 0.1403, 0.3522]
cat 2: [0, 26, 32, 2] and [0.0, 0.4333, 0.5333, 0.0333]
cat 3: [0, 355, 235, 522] and [0.0, 0.3192, 0.2113, 0.4694]
[train epoch 42/200] | loss 0.3454 | nw acc 0.992 | time 1 min 7 sec
cat 0: [1469, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2439, 1, 0] and [0.0, 0.9996, 0.0004, 0.0]
cat 2: [0, 0, 834, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 1, 0, 2812] and [0.0, 0.0004, 0.0, 0.9996]
[test epoch 42/200] | loss 0.307 | nw acc 0.471 | time 0 min 16 sec
cat 0: [0, 14, 4, 38] and [0.0, 0.25, 0.0714, 0.6786]
cat 1: [0, 424, 93, 302] and [0.0, 0.5177, 0.1136, 0.3687]
cat 2: [0, 82, 46, 8] and [0.0, 0.6029, 0.3382, 0.0588]
cat 3: [0, 217, 228, 434] and [0.0, 0.2469, 0.2594, 0.4937]
[train epoch 43/200] | loss 0.35137 | nw acc 0.992 | time 1 min 7 sec
cat 0: [1468, 2, 0, 0] and [0.9986, 0.0014, 0.0, 0.0]
cat 1: [0, 2438, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 835, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [1, 0, 0, 2812] and [0.0004, 0.0, 0.0, 0.9996]
[test epoch 43/200] | loss 0.304 | nw acc 0.497 | time 0 min 16 sec
cat 0: [0, 9, 3, 25] and [0.0, 0.2432, 0.0811, 0.6757]
cat 1: [0, 376, 92, 294] and [0.0, 0.4934, 0.1207, 0.3858]
cat 2: [0, 137, 135, 20] and [0.0, 0.4692, 0.4623, 0.0685]
cat 3: [0, 215, 141, 443] and [0.0, 0.2691, 0.1765, 0.5544]
[train epoch 44/200] | loss 0.34562 | nw acc 0.992 | time 1 min 7 sec
cat 0: [1469, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2440, 0, 1] and [0.0, 0.9996, 0.0, 0.0004]
cat 2: [0, 0, 835, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 2811] and [0.0, 0.0, 0.0, 1.0]
[test epoch 44/200] | loss 0.312 | nw acc 0.481 | time 0 min 16 sec
cat 0: [0, 4, 3, 14] and [0.0, 0.1905, 0.1429, 0.6667]
cat 1: [0, 477, 180, 354] and [0.0, 0.4718, 0.178, 0.3501]
cat 2: [0, 49, 40, 8] and [0.0, 0.5052, 0.4124, 0.0825]
cat 3: [0, 207, 148, 406] and [0.0, 0.272, 0.1945, 0.5335]
[train epoch 45/200] | loss 0.34737 | nw acc 0.992 | time 1 min 7 sec
cat 0: [1469, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2440, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 834, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 1, 2812] and [0.0, 0.0, 0.0004, 0.9996]
[test epoch 45/200] | loss 0.374 | nw acc 0.409 | time 0 min 16 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [0, 3, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 734, 371, 782] and [0.0, 0.389, 0.1966, 0.4144]
[train epoch 46/200] | loss 0.452 | nw acc 0.939 | time 1 min 7 sec
cat 0: [1388, 16, 12, 27] and [0.9619, 0.0111, 0.0083, 0.0187]
cat 1: [20, 2317, 33, 51] and [0.0083, 0.957, 0.0136, 0.0211]
cat 2: [37, 56, 757, 43] and [0.0414, 0.0627, 0.8477, 0.0482]
cat 3: [24, 51, 33, 2691] and [0.0086, 0.0182, 0.0118, 0.9614]
[test epoch 46/200] | loss 0.319 | nw acc 0.461 | time 0 min 16 sec
cat 0: [0, 86, 67, 73] and [0.0, 0.3805, 0.2965, 0.323]
cat 1: [0, 186, 19, 61] and [0.0, 0.6992, 0.0714, 0.2293]
cat 2: [0, 144, 64, 13] and [0.0, 0.6516, 0.2896, 0.0588]
cat 3: [0, 321, 221, 635] and [0.0, 0.2727, 0.1878, 0.5395]
[train epoch 47/200] | loss 0.35686 | nw acc 0.99 | time 1 min 7 sec
cat 0: [1464, 0, 0, 5] and [0.9966, 0.0, 0.0, 0.0034]
cat 1: [1, 2435, 1, 1] and [0.0004, 0.9988, 0.0004, 0.0004]
cat 2: [2, 1, 832, 0] and [0.0024, 0.0012, 0.9964, 0.0]
cat 3: [2, 4, 2, 2806] and [0.0007, 0.0014, 0.0007, 0.9972]
[test epoch 47/200] | loss 0.312 | nw acc 0.48 | time 0 min 16 sec
cat 0: [0, 21, 8, 14] and [0.0, 0.4884, 0.186, 0.3256]
cat 1: [0, 484, 217, 338] and [0.0, 0.4658, 0.2089, 0.3253]
cat 2: [0, 27, 21, 14] and [0.0, 0.4355, 0.3387, 0.2258]
cat 3: [0, 205, 125, 416] and [0.0, 0.2748, 0.1676, 0.5576]
[train epoch 48/200] | loss 0.34656 | nw acc 0.992 | time 1 min 7 sec
cat 0: [1469, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2440, 0, 2] and [0.0, 0.9992, 0.0, 0.0008]
cat 2: [0, 0, 835, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 2810] and [0.0, 0.0, 0.0, 1.0]
[test epoch 48/200] | loss 0.302 | nw acc 0.51 | time 0 min 16 sec
cat 0: [0, 22, 10, 30] and [0.0, 0.3548, 0.1613, 0.4839]
cat 1: [0, 487, 184, 323] and [0.0, 0.4899, 0.1851, 0.3249]
cat 2: [0, 119, 107, 43] and [0.0, 0.4424, 0.3978, 0.1599]
cat 3: [0, 109, 70, 386] and [0.0, 0.1929, 0.1239, 0.6832]
[train epoch 49/200] | loss 0.34655 | nw acc 0.992 | time 1 min 7 sec
cat 0: [1469, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2439, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 835, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 1, 0, 2812] and [0.0, 0.0004, 0.0, 0.9996]
[test epoch 49/200] | loss 0.295 | nw acc 0.517 | time 0 min 16 sec
cat 0: [0, 5, 4, 13] and [0.0, 0.2273, 0.1818, 0.5909]
cat 1: [0, 560, 174, 365] and [0.0, 0.5096, 0.1583, 0.3321]
cat 2: [0, 52, 40, 11] and [0.0, 0.5049, 0.3883, 0.1068]
cat 3: [0, 120, 153, 393] and [0.0, 0.1802, 0.2297, 0.5901]
[train epoch 50/200] | loss 0.34575 | nw acc 0.992 | time 1 min 7 sec
cat 0: [1469, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2440, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 835, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 2812] and [0.0, 0.0, 0.0, 1.0]
[test epoch 50/200] | loss 0.31 | nw acc 0.492 | time 0 min 16 sec
cat 0: [0, 11, 7, 13] and [0.0, 0.3548, 0.2258, 0.4194]
cat 1: [0, 397, 117, 241] and [0.0, 0.5258, 0.155, 0.3192]
cat 2: [0, 22, 23, 3] and [0.0, 0.4583, 0.4792, 0.0625]
cat 3: [0, 307, 224, 525] and [0.0, 0.2907, 0.2121, 0.4972]
[train epoch 51/200] | loss 0.34425 | nw acc 0.992 | time 1 min 7 sec
cat 0: [1469, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2440, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 835, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 2812] and [0.0, 0.0, 0.0, 1.0]
[test epoch 51/200] | loss 0.299 | nw acc 0.497 | time 0 min 16 sec
cat 0: [0, 22, 10, 29] and [0.0, 0.3607, 0.1639, 0.4754]
cat 1: [0, 466, 141, 286] and [0.0, 0.5218, 0.1579, 0.3203]
cat 2: [0, 38, 33, 12] and [0.0, 0.4578, 0.3976, 0.1446]
cat 3: [0, 211, 187, 455] and [0.0, 0.2474, 0.2192, 0.5334]
[train epoch 52/200] | loss 0.35107 | nw acc 0.992 | time 1 min 7 sec
cat 0: [1469, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2438, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 834, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 2, 1, 2812] and [0.0, 0.0007, 0.0004, 0.9989]
[test epoch 52/200] | loss 0.313 | nw acc 0.481 | time 0 min 16 sec
cat 0: [0, 21, 11, 21] and [0.0, 0.3962, 0.2075, 0.3962]
cat 1: [0, 426, 143, 286] and [0.0, 0.4982, 0.1673, 0.3345]
cat 2: [0, 20, 29, 6] and [0.0, 0.3636, 0.5273, 0.1091]
cat 3: [0, 270, 188, 469] and [0.0, 0.2913, 0.2028, 0.5059]
[train epoch 53/200] | loss 0.3602 | nw acc 0.987 | time 1 min 8 sec
cat 0: [1461, 1, 0, 1] and [0.9986, 0.0007, 0.0, 0.0007]
cat 1: [7, 2426, 1, 14] and [0.0029, 0.991, 0.0004, 0.0057]
cat 2: [0, 2, 833, 0] and [0.0, 0.0024, 0.9976, 0.0]
cat 3: [1, 11, 1, 2797] and [0.0004, 0.0039, 0.0004, 0.9954]
[test epoch 53/200] | loss 0.294 | nw acc 0.51 | time 0 min 16 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [0, 332, 58, 135] and [0.0, 0.6324, 0.1105, 0.2571]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 405, 313, 647] and [0.0, 0.2967, 0.2293, 0.474]
[train epoch 54/200] | loss 0.3469 | nw acc 0.992 | time 1 min 7 sec
cat 0: [1469, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2438, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 835, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 2, 0, 2812] and [0.0, 0.0007, 0.0, 0.9993]
[test epoch 54/200] | loss 0.335 | nw acc 0.406 | time 0 min 16 sec
cat 0: [0, 69, 36, 85] and [0.0, 0.3632, 0.1895, 0.4474]
cat 1: [0, 236, 74, 165] and [0.0, 0.4968, 0.1558, 0.3474]
cat 2: [0, 72, 25, 13] and [0.0, 0.6545, 0.2273, 0.1182]
cat 3: [0, 360, 236, 519] and [0.0, 0.3229, 0.2117, 0.4655]
[train epoch 55/200] | loss 0.36182 | nw acc 0.986 | time 1 min 7 sec
cat 0: [1462, 3, 1, 4] and [0.9946, 0.002, 0.0007, 0.0027]
cat 1: [6, 2423, 2, 12] and [0.0025, 0.9918, 0.0008, 0.0049]
cat 2: [0, 2, 832, 0] and [0.0, 0.0024, 0.9976, 0.0]
cat 3: [1, 12, 0, 2796] and [0.0004, 0.0043, 0.0, 0.9954]
[test epoch 55/200] | loss 0.314 | nw acc 0.487 | time 0 min 16 sec
cat 0: [0, 22, 12, 6] and [0.0, 0.55, 0.3, 0.15]
cat 1: [0, 439, 120, 314] and [0.0, 0.5029, 0.1375, 0.3597]
cat 2: [0, 63, 46, 12] and [0.0, 0.5207, 0.3802, 0.0992]
cat 3: [0, 213, 193, 450] and [0.0, 0.2488, 0.2255, 0.5257]
[train epoch 56/200] | loss 0.34752 | nw acc 0.992 | time 1 min 8 sec
cat 0: [1468, 0, 0, 1] and [0.9993, 0.0, 0.0, 0.0007]
cat 1: [1, 2439, 0, 1] and [0.0004, 0.9992, 0.0, 0.0004]
cat 2: [0, 0, 835, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 1, 0, 2810] and [0.0, 0.0004, 0.0, 0.9996]
[test epoch 56/200] | loss 0.327 | nw acc 0.463 | time 0 min 16 sec
cat 0: [0, 11, 5, 18] and [0.0, 0.3235, 0.1471, 0.5294]
cat 1: [0, 397, 151, 339] and [0.0, 0.4476, 0.1702, 0.3822]
cat 2: [0, 132, 103, 36] and [0.0, 0.4871, 0.3801, 0.1328]
cat 3: [0, 197, 112, 389] and [0.0, 0.2822, 0.1605, 0.5573]
[train epoch 57/200] | loss 0.34442 | nw acc 0.992 | time 1 min 7 sec
cat 0: [1469, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2440, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 835, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 2812] and [0.0, 0.0, 0.0, 1.0]
[test epoch 57/200] | loss 0.335 | nw acc 0.44 | time 0 min 17 sec
cat 0: [0, 17, 6, 54] and [0.0, 0.2208, 0.0779, 0.7013]
cat 1: [0, 289, 70, 215] and [0.0, 0.5035, 0.122, 0.3746]
cat 2: [0, 72, 52, 10] and [0.0, 0.5373, 0.3881, 0.0746]
cat 3: [0, 359, 243, 503] and [0.0, 0.3249, 0.2199, 0.4552]
[train epoch 58/200] | loss 0.34808 | nw acc 0.991 | time 1 min 7 sec
cat 0: [1469, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2438, 3, 3] and [0.0, 0.9975, 0.0012, 0.0012]
cat 2: [0, 1, 832, 0] and [0.0, 0.0012, 0.9988, 0.0]
cat 3: [0, 1, 0, 2809] and [0.0, 0.0004, 0.0, 0.9996]
[test epoch 58/200] | loss 0.296 | nw acc 0.528 | time 0 min 16 sec
cat 0: [0, 13, 8, 22] and [0.0, 0.3023, 0.186, 0.5116]
cat 1: [0, 339, 48, 164] and [0.0, 0.6152, 0.0871, 0.2976]
cat 2: [0, 78, 98, 20] and [0.0, 0.398, 0.5, 0.102]
cat 3: [0, 307, 217, 576] and [0.0, 0.2791, 0.1973, 0.5236]
[train epoch 59/200] | loss 0.34466 | nw acc 0.992 | time 1 min 8 sec
cat 0: [1469, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2440, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 835, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 2812] and [0.0, 0.0, 0.0, 1.0]
[test epoch 59/200] | loss 0.298 | nw acc 0.504 | time 0 min 16 sec
cat 0: [0, 19, 8, 38] and [0.0, 0.2923, 0.1231, 0.5846]
cat 1: [0, 423, 99, 251] and [0.0, 0.5472, 0.1281, 0.3247]
cat 2: [0, 60, 67, 16] and [0.0, 0.4196, 0.4685, 0.1119]
cat 3: [0, 235, 197, 477] and [0.0, 0.2585, 0.2167, 0.5248]
[train epoch 60/200] | loss 0.34409 | nw acc 0.992 | time 1 min 7 sec
cat 0: [1469, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2440, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 835, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 2812] and [0.0, 0.0, 0.0, 1.0]
[test epoch 60/200] | loss 0.308 | nw acc 0.496 | time 0 min 16 sec
cat 0: [0, 5, 3, 17] and [0.0, 0.2, 0.12, 0.68]
cat 1: [0, 522, 213, 357] and [0.0, 0.478, 0.1951, 0.3269]
cat 2: [0, 54, 35, 13] and [0.0, 0.5294, 0.3431, 0.1275]
cat 3: [0, 156, 120, 395] and [0.0, 0.2325, 0.1788, 0.5887]
[train epoch 61/200] | loss 0.34381 | nw acc 0.992 | time 1 min 7 sec
cat 0: [1469, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2440, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 835, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 2812] and [0.0, 0.0, 0.0, 1.0]
[test epoch 61/200] | loss 0.311 | nw acc 0.496 | time 0 min 16 sec
cat 0: [0, 17, 6, 47] and [0.0, 0.2429, 0.0857, 0.6714]
cat 1: [0, 291, 56, 150] and [0.0, 0.5855, 0.1127, 0.3018]
cat 2: [0, 101, 93, 17] and [0.0, 0.4787, 0.4408, 0.0806]
cat 3: [0, 328, 216, 568] and [0.0, 0.295, 0.1942, 0.5108]
[train epoch 62/200] | loss 0.34413 | nw acc 0.992 | time 1 min 8 sec
cat 0: [1469, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2440, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 835, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 2812] and [0.0, 0.0, 0.0, 1.0]
[test epoch 62/200] | loss 0.303 | nw acc 0.511 | time 0 min 16 sec
cat 0: [0, 2, 1, 6] and [0.0, 0.2222, 0.1111, 0.6667]
cat 1: [0, 489, 156, 296] and [0.0, 0.5197, 0.1658, 0.3146]
cat 2: [0, 42, 23, 10] and [0.0, 0.56, 0.3067, 0.1333]
cat 3: [0, 204, 191, 470] and [0.0, 0.2358, 0.2208, 0.5434]
[train epoch 63/200] | loss 0.34408 | nw acc 0.992 | time 1 min 7 sec
cat 0: [1469, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2440, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 835, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 2812] and [0.0, 0.0, 0.0, 1.0]
[test epoch 63/200] | loss 0.314 | nw acc 0.485 | time 0 min 16 sec
cat 0: [0, 13, 1, 24] and [0.0, 0.3421, 0.0263, 0.6316]
cat 1: [0, 333, 89, 190] and [0.0, 0.5441, 0.1454, 0.3105]
cat 2: [0, 71, 41, 11] and [0.0, 0.5772, 0.3333, 0.0894]
cat 3: [0, 320, 240, 557] and [0.0, 0.2865, 0.2149, 0.4987]
[train epoch 64/200] | loss 0.34371 | nw acc 0.992 | time 1 min 7 sec
cat 0: [1469, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2440, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 835, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 2812] and [0.0, 0.0, 0.0, 1.0]
[test epoch 64/200] | loss 0.315 | nw acc 0.468 | time 0 min 16 sec
cat 0: [0, 12, 7, 40] and [0.0, 0.2034, 0.1186, 0.678]
cat 1: [0, 361, 97, 239] and [0.0, 0.5179, 0.1392, 0.3429]
cat 2: [0, 71, 47, 12] and [0.0, 0.5462, 0.3615, 0.0923]
cat 3: [0, 293, 220, 491] and [0.0, 0.2918, 0.2191, 0.489]
[train epoch 65/200] | loss 0.3437 | nw acc 0.992 | time 1 min 8 sec
cat 0: [1469, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2440, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 835, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 2812] and [0.0, 0.0, 0.0, 1.0]
[test epoch 65/200] | loss 0.311 | nw acc 0.481 | time 0 min 17 sec
cat 0: [0, 13, 6, 40] and [0.0, 0.2203, 0.1017, 0.678]
cat 1: [0, 373, 102, 232] and [0.0, 0.5276, 0.1443, 0.3281]
cat 2: [0, 84, 55, 15] and [0.0, 0.5455, 0.3571, 0.0974]
cat 3: [0, 267, 208, 495] and [0.0, 0.2753, 0.2144, 0.5103]
[train epoch 66/200] | loss 0.34376 | nw acc 0.992 | time 1 min 7 sec
cat 0: [1469, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2440, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 835, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 2812] and [0.0, 0.0, 0.0, 1.0]
[test epoch 66/200] | loss 0.308 | nw acc 0.487 | time 0 min 16 sec
cat 0: [0, 18, 6, 31] and [0.0, 0.3273, 0.1091, 0.5636]
cat 1: [0, 359, 108, 225] and [0.0, 0.5188, 0.1561, 0.3251]
cat 2: [0, 71, 66, 16] and [0.0, 0.4641, 0.4314, 0.1046]
cat 3: [0, 289, 191, 510] and [0.0, 0.2919, 0.1929, 0.5152]
[train epoch 67/200] | loss 0.34372 | nw acc 0.992 | time 1 min 7 sec
cat 0: [1469, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2440, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 835, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 2812] and [0.0, 0.0, 0.0, 1.0]
[test epoch 67/200] | loss 0.317 | nw acc 0.458 | time 0 min 16 sec
cat 0: [0, 14, 4, 39] and [0.0, 0.2456, 0.0702, 0.6842]
cat 1: [0, 401, 143, 294] and [0.0, 0.4785, 0.1706, 0.3508]
cat 2: [0, 87, 54, 24] and [0.0, 0.5273, 0.3273, 0.1455]
cat 3: [0, 235, 170, 425] and [0.0, 0.2831, 0.2048, 0.512]
[train epoch 68/200] | loss 0.34368 | nw acc 0.992 | time 1 min 7 sec
cat 0: [1469, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2440, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 835, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 2812] and [0.0, 0.0, 0.0, 1.0]
[test epoch 68/200] | loss 0.313 | nw acc 0.478 | time 0 min 16 sec
cat 0: [0, 16, 7, 48] and [0.0, 0.2254, 0.0986, 0.6761]
cat 1: [0, 408, 123, 268] and [0.0, 0.5106, 0.1539, 0.3354]
cat 2: [0, 88, 63, 20] and [0.0, 0.5146, 0.3684, 0.117]
cat 3: [0, 225, 178, 446] and [0.0, 0.265, 0.2097, 0.5253]
[train epoch 69/200] | loss 0.34943 | nw acc 0.992 | time 1 min 7 sec
cat 0: [1469, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2440, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 834, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 1, 2812] and [0.0, 0.0, 0.0004, 0.9996]
[test epoch 69/200] | loss 0.301 | nw acc 0.517 | time 0 min 16 sec
cat 0: [0, 5, 1, 13] and [0.0, 0.2632, 0.0526, 0.6842]
cat 1: [0, 350, 37, 207] and [0.0, 0.5892, 0.0623, 0.3485]
cat 2: [0, 157, 167, 87] and [0.0, 0.382, 0.4063, 0.2117]
cat 3: [0, 225, 166, 475] and [0.0, 0.2598, 0.1917, 0.5485]
