MaunaNet4Aug(
  (conv1): Conv2d(1, 3, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn1): BatchNorm2d(3, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool1): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv2): Conv2d(3, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
  (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool2): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv3): Conv2d(64, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
  (bn3): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool3): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv4): Conv2d(128, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
  (bn4): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool4): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (avgpool): AvgPool2d(kernel_size=4, stride=4, padding=0)
  (fc1): Linear(in_features=1024, out_features=4, bias=True)
)
MaunaNet4Aug(
  (conv1): Conv2d(1, 3, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn1): BatchNorm2d(3, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool1): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv2): Conv2d(3, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
  (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool2): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv3): Conv2d(64, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
  (bn3): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool3): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv4): Conv2d(128, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
  (bn4): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool4): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (avgpool): AvgPool2d(kernel_size=7, stride=7, padding=0)
  (fc1): Linear(in_features=256, out_features=4, bias=True)
)
[train epoch 1/10] | loss 1.177 | nw acc 0.485 | time 3 min 7 sec
cat 0: [444, 210, 106, 132] and [0.4978, 0.2354, 0.1188, 0.148]
cat 1: [609, 1379, 423, 804] and [0.1894, 0.4289, 0.1316, 0.2501]
cat 2: [15, 25, 8, 15] and [0.2381, 0.3968, 0.127, 0.2381]
cat 3: [401, 826, 298, 1861] and [0.1184, 0.2439, 0.088, 0.5496]
[test epoch 1/10] | loss 0.336 | nw acc 0.389 | time 0 min 17 sec
cat 0: [0, 20, 79, 78] and [0.0, 0.113, 0.4463, 0.4407]
cat 1: [0, 705, 267, 663] and [0.0, 0.4312, 0.1633, 0.4055]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 12, 25, 41] and [0.0, 0.1538, 0.3205, 0.5256]
[train epoch 2/10] | loss 1.1063 | nw acc 0.534 | time 2 min 59 sec
cat 0: [609, 247, 139, 163] and [0.5259, 0.2133, 0.12, 0.1408]
cat 1: [494, 1433, 329, 637] and [0.1708, 0.4953, 0.1137, 0.2202]
cat 2: [18, 23, 30, 18] and [0.2022, 0.2584, 0.3371, 0.2022]
cat 3: [348, 737, 337, 1994] and [0.1019, 0.2157, 0.0987, 0.5837]
[test epoch 2/10] | loss 0.405 | nw acc 0.374 | time 0 min 21 sec
cat 0: [0, 23, 57, 83] and [0.0, 0.1411, 0.3497, 0.5092]
cat 1: [0, 710, 306, 690] and [0.0, 0.4162, 0.1794, 0.4045]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 4, 8, 9] and [0.0, 0.1905, 0.381, 0.4286]
[train epoch 3/10] | loss 1.0637 | nw acc 0.547 | time 2 min 58 sec
cat 0: [644, 248, 164, 179] and [0.5215, 0.2008, 0.1328, 0.1449]
cat 1: [478, 1457, 278, 605] and [0.1696, 0.517, 0.0987, 0.2147]
cat 2: [37, 51, 72, 35] and [0.1897, 0.2615, 0.3692, 0.1795]
cat 3: [310, 684, 321, 1993] and [0.0937, 0.2068, 0.097, 0.6025]
[test epoch 3/10] | loss 0.315 | nw acc 0.446 | time 0 min 26 sec
cat 0: [0, 63, 71, 59] and [0.0, 0.3264, 0.3679, 0.3057]
cat 1: [0, 415, 125, 286] and [0.0, 0.5024, 0.1513, 0.3462]
cat 2: [0, 28, 23, 19] and [0.0, 0.4, 0.3286, 0.2714]
cat 3: [0, 231, 152, 418] and [0.0, 0.2884, 0.1898, 0.5218]
[train epoch 4/10] | loss 1.0212 | nw acc 0.587 | time 3 min 3 sec
cat 0: [746, 235, 148, 180] and [0.5699, 0.1795, 0.1131, 0.1375]
cat 1: [412, 1519, 274, 501] and [0.1523, 0.5613, 0.1013, 0.1851]
cat 2: [34, 36, 118, 42] and [0.1478, 0.1565, 0.513, 0.1826]
cat 3: [277, 650, 295, 2089] and [0.0837, 0.1963, 0.0891, 0.6309]
[test epoch 4/10] | loss 0.281 | nw acc 0.511 | time 0 min 23 sec
cat 0: [0, 6, 7, 8] and [0.0, 0.2857, 0.3333, 0.381]
cat 1: [0, 464, 89, 247] and [0.0, 0.58, 0.1113, 0.3088]
cat 2: [0, 65, 69, 79] and [0.0, 0.3052, 0.3239, 0.3709]
cat 3: [0, 202, 206, 448] and [0.0, 0.236, 0.2407, 0.5234]
[train epoch 5/10] | loss 0.99096 | nw acc 0.609 | time 3 min 7 sec
cat 0: [792, 207, 147, 191] and [0.5924, 0.1548, 0.1099, 0.1429]
cat 1: [377, 1572, 256, 441] and [0.1425, 0.5941, 0.0967, 0.1667]
cat 2: [53, 65, 146, 53] and [0.1672, 0.205, 0.4606, 0.1672]
cat 3: [247, 596, 286, 2127] and [0.0759, 0.183, 0.0878, 0.6533]
[test epoch 5/10] | loss 0.302 | nw acc 0.494 | time 0 min 27 sec
cat 0: [0, 10, 16, 12] and [0.0, 0.2632, 0.4211, 0.3158]
cat 1: [0, 178, 39, 44] and [0.0, 0.682, 0.1494, 0.1686]
cat 2: [0, 18, 51, 7] and [0.0, 0.2368, 0.6711, 0.0921]
cat 3: [0, 531, 265, 719] and [0.0, 0.3505, 0.1749, 0.4746]
[train epoch 6/10] | loss 0.95368 | nw acc 0.633 | time 3 min 7 sec
cat 0: [803, 228, 139, 193] and [0.5891, 0.1673, 0.102, 0.1416]
cat 1: [345, 1651, 216, 413] and [0.1314, 0.629, 0.0823, 0.1573]
cat 2: [65, 54, 206, 44] and [0.1762, 0.1463, 0.5583, 0.1192]
cat 3: [256, 507, 274, 2162] and [0.08, 0.1585, 0.0857, 0.6758]
[test epoch 6/10] | loss 0.401 | nw acc 0.41 | time 0 min 15 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 2: [0, 442, 222, 217] and [0.0, 0.5017, 0.252, 0.2463]
cat 3: [0, 295, 149, 565] and [0.0, 0.2924, 0.1477, 0.56]
[train epoch 7/10] | loss 0.91887 | nw acc 0.648 | time 3 min 11 sec
cat 0: [850, 203, 127, 188] and [0.6213, 0.1484, 0.0928, 0.1374]
cat 1: [296, 1651, 218, 372] and [0.1167, 0.6508, 0.0859, 0.1466]
cat 2: [70, 64, 255, 73] and [0.1515, 0.1385, 0.5519, 0.158]
cat 3: [253, 522, 235, 2179] and [0.0793, 0.1637, 0.0737, 0.6833]
[test epoch 7/10] | loss 0.359 | nw acc 0.412 | time 0 min 25 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [0, 725, 353, 715] and [0.0, 0.4044, 0.1969, 0.3988]
cat 2: [0, 1, 4, 4] and [0.0, 0.1111, 0.4444, 0.4444]
cat 3: [0, 11, 14, 63] and [0.0, 0.125, 0.1591, 0.7159]
[train epoch 8/10] | loss 0.90858 | nw acc 0.657 | time 3 min 13 sec
cat 0: [873, 192, 132, 194] and [0.6276, 0.138, 0.0949, 0.1395]
cat 1: [243, 1678, 204, 362] and [0.0977, 0.6747, 0.082, 0.1456]
cat 2: [90, 78, 285, 87] and [0.1667, 0.1444, 0.5278, 0.1611]
cat 3: [263, 492, 214, 2169] and [0.0838, 0.1568, 0.0682, 0.6912]
[test epoch 8/10] | loss 0.373 | nw acc 0.32 | time 0 min 16 sec
cat 0: [0, 260, 172, 317] and [0.0, 0.3471, 0.2296, 0.4232]
cat 1: [0, 464, 130, 314] and [0.0, 0.511, 0.1432, 0.3458]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 13, 69, 151] and [0.0, 0.0558, 0.2961, 0.6481]
MaunaNet4Aug(
  (conv1): Conv2d(1, 3, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn1): BatchNorm2d(3, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool1): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv2): Conv2d(3, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
  (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool2): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv3): Conv2d(64, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
  (bn3): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool3): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv4): Conv2d(128, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
  (bn4): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool4): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (avgpool): AvgPool2d(kernel_size=7, stride=7, padding=0)
  (fc1): Linear(in_features=256, out_features=4, bias=True)
)
[train epoch 1/10] | loss 1.1883 | nw acc 0.478 | time 3 min 7 sec
cat 0: [202, 118, 55, 85] and [0.4391, 0.2565, 0.1196, 0.1848]
cat 1: [537, 1404, 460, 753] and [0.1703, 0.4451, 0.1458, 0.2387]
cat 2: [56, 65, 66, 65] and [0.2222, 0.2579, 0.2619, 0.2579]
cat 3: [380, 954, 384, 1972] and [0.103, 0.2585, 0.1041, 0.5344]
[test epoch 1/10] | loss 0.335 | nw acc 0.42 | time 0 min 16 sec
cat 0: [93, 80, 20, 39] and [0.4009, 0.3448, 0.0862, 0.1681]
cat 1: [0, 9, 0, 2] and [0.0, 0.8182, 0.0, 0.1818]
cat 2: [35, 26, 42, 15] and [0.2966, 0.2203, 0.3559, 0.1271]
cat 3: [166, 521, 179, 663] and [0.1086, 0.3407, 0.1171, 0.4336]
[train epoch 2/10] | loss 1.118 | nw acc 0.512 | time 3 min 1 sec
cat 0: [280, 104, 50, 113] and [0.5119, 0.1901, 0.0914, 0.2066]
cat 1: [436, 1428, 405, 615] and [0.1512, 0.4951, 0.1404, 0.2132]
cat 2: [124, 116, 146, 101] and [0.2546, 0.2382, 0.2998, 0.2074]
cat 3: [335, 893, 364, 2046] and [0.0921, 0.2455, 0.1001, 0.5624]
[test epoch 2/10] | loss 0.284 | nw acc 0.517 | time 0 min 22 sec
cat 0: [173, 135, 85, 109] and [0.3446, 0.2689, 0.1693, 0.2171]
cat 1: [19, 248, 19, 59] and [0.0551, 0.7188, 0.0551, 0.171]
cat 2: [38, 65, 80, 60] and [0.1564, 0.2675, 0.3292, 0.2469]
cat 3: [64, 188, 57, 491] and [0.08, 0.235, 0.0712, 0.6138]
[train epoch 3/10] | loss 1.0541 | nw acc 0.57 | time 3 min 13 sec
cat 0: [388, 139, 81, 134] and [0.5229, 0.1873, 0.1092, 0.1806]
cat 1: [419, 1634, 375, 509] and [0.1427, 0.5564, 0.1277, 0.1733]
cat 2: [100, 84, 153, 68] and [0.2469, 0.2074, 0.3778, 0.1679]
cat 3: [268, 684, 356, 2164] and [0.0772, 0.197, 0.1025, 0.6233]
[test epoch 3/10] | loss 0.394 | nw acc 0.305 | time 0 min 26 sec
cat 0: [156, 181, 54, 251] and [0.243, 0.2819, 0.0841, 0.391]
cat 1: [25, 256, 42, 301] and [0.0401, 0.4103, 0.0673, 0.4824]
cat 2: [111, 178, 137, 130] and [0.1996, 0.3201, 0.2464, 0.2338]
cat 3: [2, 21, 8, 37] and [0.0294, 0.3088, 0.1176, 0.5441]
[train epoch 4/10] | loss 0.99444 | nw acc 0.607 | time 3 min 6 sec
cat 0: [513, 149, 93, 140] and [0.5732, 0.1665, 0.1039, 0.1564]
cat 1: [314, 1690, 364, 431] and [0.1122, 0.6038, 0.13, 0.154]
cat 2: [107, 102, 182, 66] and [0.2341, 0.2232, 0.3982, 0.1444]
cat 3: [241, 600, 326, 2238] and [0.0708, 0.1762, 0.0957, 0.6573]
[test epoch 4/10] | loss 0.27 | nw acc 0.569 | time 0 min 29 sec
cat 0: [190, 94, 78, 111] and [0.4017, 0.1987, 0.1649, 0.2347]
cat 1: [70, 413, 75, 119] and [0.1034, 0.61, 0.1108, 0.1758]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [34, 129, 88, 489] and [0.0459, 0.1743, 0.1189, 0.6608]
[train epoch 5/10] | loss 0.95034 | nw acc 0.63 | time 3 min 11 sec
cat 0: [556, 159, 83, 137] and [0.5947, 0.1701, 0.0888, 0.1465]
cat 1: [257, 1744, 304, 377] and [0.0958, 0.6503, 0.1133, 0.1406]
cat 2: [84, 80, 223, 83] and [0.1787, 0.1702, 0.4745, 0.1766]
cat 3: [278, 558, 355, 2278] and [0.0801, 0.1609, 0.1023, 0.6567]
[test epoch 5/10] | loss 0.274 | nw acc 0.556 | time 0 min 21 sec
cat 0: [100, 7, 9, 15] and [0.7634, 0.0534, 0.0687, 0.1145]
cat 1: [158, 572, 186, 309] and [0.129, 0.4669, 0.1518, 0.2522]
cat 2: [0, 0, 1, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [36, 57, 45, 395] and [0.0675, 0.1069, 0.0844, 0.7411]
[train epoch 6/10] | loss 0.94163 | nw acc 0.646 | time 3 min 18 sec
cat 0: [581, 179, 105, 140] and [0.5781, 0.1781, 0.1045, 0.1393]
cat 1: [274, 1782, 298, 373] and [0.1005, 0.6535, 0.1093, 0.1368]
cat 2: [71, 99, 289, 93] and [0.1286, 0.1793, 0.5236, 0.1685]
cat 3: [249, 481, 273, 2269] and [0.0761, 0.147, 0.0834, 0.6935]
[test epoch 6/10] | loss 0.344 | nw acc 0.463 | time 0 min 28 sec
cat 0: [106, 64, 15, 24] and [0.5072, 0.3062, 0.0718, 0.1148]
cat 1: [0, 10, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [100, 174, 148, 71] and [0.2028, 0.3529, 0.3002, 0.144]
cat 3: [88, 388, 78, 624] and [0.0747, 0.3294, 0.0662, 0.5297]
[train epoch 7/10] | loss 0.91881 | nw acc 0.656 | time 3 min 15 sec
cat 0: [602, 152, 72, 122] and [0.635, 0.1603, 0.0759, 0.1287]
cat 1: [257, 1782, 297, 361] and [0.0953, 0.6607, 0.1101, 0.1339]
cat 2: [56, 106, 315, 93] and [0.0982, 0.186, 0.5526, 0.1632]
cat 3: [260, 501, 281, 2299] and [0.0778, 0.15, 0.0841, 0.6881]
[test epoch 7/10] | loss 0.248 | nw acc 0.608 | time 0 min 27 sec
cat 0: [145, 58, 24, 64] and [0.4983, 0.1993, 0.0825, 0.2199]
cat 1: [38, 340, 43, 29] and [0.0844, 0.7556, 0.0956, 0.0644]
cat 2: [33, 23, 80, 23] and [0.2075, 0.1447, 0.5031, 0.1447]
cat 3: [78, 215, 94, 603] and [0.0788, 0.2172, 0.0949, 0.6091]
[train epoch 8/10] | loss 0.89682 | nw acc 0.664 | time 3 min 20 sec
cat 0: [634, 164, 79, 173] and [0.6038, 0.1562, 0.0752, 0.1648]
cat 1: [237, 1815, 272, 336] and [0.0891, 0.6823, 0.1023, 0.1263]
cat 2: [75, 95, 361, 117] and [0.1157, 0.1466, 0.5571, 0.1806]
cat 3: [229, 467, 253, 2249] and [0.0716, 0.146, 0.0791, 0.7033]
[test epoch 8/10] | loss 0.252 | nw acc 0.605 | time 0 min 26 sec
cat 0: [72, 2, 2, 17] and [0.7742, 0.0215, 0.0215, 0.1828]
cat 1: [179, 558, 155, 192] and [0.1651, 0.5148, 0.143, 0.1771]
cat 2: [2, 5, 24, 2] and [0.0606, 0.1515, 0.7273, 0.0606]
cat 3: [41, 71, 60, 508] and [0.0603, 0.1044, 0.0882, 0.7471]
[train epoch 9/10] | loss 0.88548 | nw acc 0.673 | time 3 min 17 sec
cat 0: [658, 151, 85, 150] and [0.6303, 0.1446, 0.0814, 0.1437]
cat 1: [227, 1853, 300, 348] and [0.0832, 0.6793, 0.11, 0.1276]
cat 2: [54, 91, 342, 108] and [0.0908, 0.1529, 0.5748, 0.1815]
cat 3: [236, 446, 238, 2269] and [0.074, 0.1399, 0.0746, 0.7115]
[test epoch 9/10] | loss 0.288 | nw acc 0.528 | time 0 min 26 sec
cat 0: [158, 60, 8, 23] and [0.6345, 0.241, 0.0321, 0.0924]
cat 1: [1, 120, 10, 7] and [0.0072, 0.8696, 0.0725, 0.0507]
cat 2: [9, 10, 51, 5] and [0.12, 0.1333, 0.68, 0.0667]
cat 3: [126, 446, 172, 684] and [0.0882, 0.3123, 0.1204, 0.479]
[train epoch 10/10] | loss 0.88452 | nw acc 0.678 | time 3 min 32 sec
cat 0: [674, 171, 107, 143] and [0.6155, 0.1562, 0.0977, 0.1306]
cat 1: [209, 1821, 264, 311] and [0.0802, 0.699, 0.1013, 0.1194]
cat 2: [77, 88, 348, 103] and [0.125, 0.1429, 0.5649, 0.1672]
cat 3: [215, 461, 246, 2318] and [0.0664, 0.1423, 0.0759, 0.7154]
[test epoch 10/10] | loss 0.332 | nw acc 0.425 | time 0 min 27 sec
cat 0: [4, 1, 0, 2] and [0.5714, 0.1429, 0.0, 0.2857]
cat 1: [267, 618, 237, 523] and [0.1623, 0.3757, 0.1441, 0.3179]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [23, 17, 4, 194] and [0.0966, 0.0714, 0.0168, 0.8151]
