BenchMarkBn(
  (conv1): Conv2d(1, 3, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn1): BatchNorm2d(3, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool1): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (drop1): Dropout2d(p=0.5)
  (conv2): Conv2d(3, 16, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn2): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool2): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (drop2): Dropout2d(p=0.5)
  (conv3): Conv2d(16, 32, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn3): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool3): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (drop3): Dropout2d(p=0.25)
  (fc1): Linear(in_features=1568, out_features=4, bias=True)
)
BenchMarkBn(
  (conv1): Conv2d(1, 3, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn1): BatchNorm2d(3, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool1): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (drop1): Dropout2d(p=0.5)
  (conv2): Conv2d(3, 16, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn2): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool2): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (drop2): Dropout2d(p=0.5)
  (conv3): Conv2d(16, 32, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn3): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool3): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (drop3): Dropout2d(p=0.25)
  (fc1): Linear(in_features=1568, out_features=4, bias=True)
)
[train epoch 1/100] | loss 1.2813 | nw acc 0.398 | time 1 min 41 sec
cat 0: [236, 97, 59, 129] and [0.453, 0.1862, 0.1132, 0.2476]
cat 1: [439, 1031, 388, 907] and [0.1588, 0.3729, 0.1403, 0.328]
cat 2: [3, 13, 0, 13] and [0.1034, 0.4483, 0.0, 0.4483]
cat 3: [791, 1299, 388, 1763] and [0.1865, 0.3063, 0.0915, 0.4157]
[test epoch 1/100] | loss 0.327 | nw acc 0.37 | time 0 min 22 sec
cat 0: [0, 49, 36, 22] and [0.0, 0.4579, 0.3364, 0.2056]
cat 1: [0, 145, 117, 195] and [0.0, 0.3173, 0.256, 0.4267]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 543, 218, 565] and [0.0, 0.4095, 0.1644, 0.4261]
[train epoch 2/100] | loss 1.2569 | nw acc 0.429 | time 1 min 39 sec
cat 0: [305, 78, 69, 106] and [0.5466, 0.1398, 0.1237, 0.19]
cat 1: [421, 1159, 351, 902] and [0.1486, 0.4091, 0.1239, 0.3184]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [743, 1203, 415, 1804] and [0.1784, 0.2888, 0.0996, 0.4331]
[test epoch 2/100] | loss 0.343 | nw acc 0.368 | time 0 min 22 sec
cat 0: [0, 25, 77, 47] and [0.0, 0.1678, 0.5168, 0.3154]
cat 1: [0, 143, 106, 171] and [0.0, 0.3405, 0.2524, 0.4071]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 569, 188, 564] and [0.0, 0.4307, 0.1423, 0.4269]
[train epoch 3/100] | loss 1.2243 | nw acc 0.456 | time 1 min 52 sec
cat 0: [430, 143, 113, 180] and [0.4965, 0.1651, 0.1305, 0.2079]
cat 1: [296, 1138, 342, 727] and [0.1183, 0.4547, 0.1366, 0.2905]
cat 2: [0, 1, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 3: [743, 1158, 380, 1905] and [0.1775, 0.2766, 0.0908, 0.4551]
[test epoch 3/100] | loss 0.335 | nw acc 0.384 | time 0 min 21 sec
cat 0: [0, 33, 81, 37] and [0.0, 0.2185, 0.5364, 0.245]
cat 1: [0, 498, 218, 506] and [0.0, 0.4075, 0.1784, 0.4141]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 206, 72, 239] and [0.0, 0.3985, 0.1393, 0.4623]
[train epoch 4/100] | loss 1.202 | nw acc 0.471 | time 1 min 48 sec
cat 0: [461, 127, 110, 166] and [0.5336, 0.147, 0.1273, 0.1921]
cat 1: [309, 1156, 349, 676] and [0.1241, 0.4643, 0.1402, 0.2715]
cat 2: [0, 1, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 3: [699, 1156, 376, 1970] and [0.1664, 0.2752, 0.0895, 0.4689]
[test epoch 4/100] | loss 0.33 | nw acc 0.365 | time 0 min 29 sec
cat 0: [0, 36, 70, 43] and [0.0, 0.2416, 0.4698, 0.2886]
cat 1: [0, 455, 218, 494] and [0.0, 0.3899, 0.1868, 0.4233]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 246, 83, 245] and [0.0, 0.4286, 0.1446, 0.4268]
[train epoch 5/100] | loss 1.2064 | nw acc 0.47 | time 1 min 38 sec
cat 0: [458, 124, 85, 170] and [0.5472, 0.1481, 0.1016, 0.2031]
cat 1: [282, 1130, 350, 651] and [0.1169, 0.4683, 0.145, 0.2698]
cat 2: [0, 0, 1, 3] and [0.0, 0.0, 0.25, 0.75]
cat 3: [729, 1186, 399, 1988] and [0.1695, 0.2757, 0.0927, 0.4621]
[test epoch 5/100] | loss 0.321 | nw acc 0.403 | time 0 min 18 sec
cat 0: [0, 62, 85, 50] and [0.0, 0.3147, 0.4315, 0.2538]
cat 1: [0, 422, 179, 380] and [0.0, 0.4302, 0.1825, 0.3874]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 253, 107, 352] and [0.0, 0.3553, 0.1503, 0.4944]
[train epoch 6/100] | loss 1.1716 | nw acc 0.482 | time 1 min 49 sec
cat 0: [545, 130, 100, 182] and [0.5695, 0.1358, 0.1045, 0.1902]
cat 1: [293, 1198, 365, 699] and [0.1147, 0.4689, 0.1429, 0.2736]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [631, 1112, 370, 1931] and [0.156, 0.275, 0.0915, 0.4775]
[test epoch 6/100] | loss 0.321 | nw acc 0.412 | time 0 min 19 sec
cat 0: [0, 72, 94, 61] and [0.0, 0.3172, 0.4141, 0.2687]
cat 1: [0, 453, 175, 383] and [0.0, 0.4481, 0.1731, 0.3788]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 212, 102, 338] and [0.0, 0.3252, 0.1564, 0.5184]
[train epoch 7/100] | loss 1.1613 | nw acc 0.495 | time 1 min 43 sec
cat 0: [622, 155, 109, 159] and [0.5952, 0.1483, 0.1043, 0.1522]
cat 1: [291, 1203, 398, 706] and [0.112, 0.463, 0.1532, 0.2717]
cat 2: [5, 2, 0, 1] and [0.625, 0.25, 0.0, 0.125]
cat 3: [551, 1080, 328, 1946] and [0.1411, 0.2766, 0.084, 0.4983]
[test epoch 7/100] | loss 0.327 | nw acc 0.379 | time 0 min 20 sec
cat 0: [0, 58, 77, 51] and [0.0, 0.3118, 0.414, 0.2742]
cat 1: [0, 414, 206, 417] and [0.0, 0.3992, 0.1986, 0.4021]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 265, 88, 314] and [0.0, 0.3973, 0.1319, 0.4708]
[train epoch 8/100] | loss 1.1511 | nw acc 0.491 | time 1 min 46 sec
cat 0: [632, 116, 92, 145] and [0.6416, 0.1178, 0.0934, 0.1472]
cat 1: [334, 1241, 410, 800] and [0.1199, 0.4456, 0.1472, 0.2873]
cat 2: [15, 36, 12, 14] and [0.1948, 0.4675, 0.1558, 0.1818]
cat 3: [488, 1047, 321, 1853] and [0.1316, 0.2823, 0.0865, 0.4996]
[test epoch 8/100] | loss 0.335 | nw acc 0.365 | time 0 min 26 sec
cat 0: [0, 97, 98, 68] and [0.0, 0.3688, 0.3726, 0.2586]
cat 1: [0, 363, 164, 377] and [0.0, 0.4015, 0.1814, 0.417]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 277, 109, 337] and [0.0, 0.3831, 0.1508, 0.4661]
[train epoch 9/100] | loss 1.1332 | nw acc 0.514 | time 1 min 40 sec
cat 0: [663, 138, 89, 155] and [0.6344, 0.1321, 0.0852, 0.1483]
cat 1: [284, 1217, 380, 618] and [0.1136, 0.487, 0.1521, 0.2473]
cat 2: [3, 12, 4, 7] and [0.1154, 0.4615, 0.1538, 0.2692]
cat 3: [519, 1073, 362, 2032] and [0.1302, 0.2692, 0.0908, 0.5098]
[test epoch 9/100] | loss 0.341 | nw acc 0.346 | time 0 min 25 sec
cat 0: [0, 115, 119, 117] and [0.0, 0.3276, 0.339, 0.3333]
cat 1: [0, 393, 180, 393] and [0.0, 0.4068, 0.1863, 0.4068]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 229, 72, 272] and [0.0, 0.3997, 0.1257, 0.4747]
[train epoch 10/100] | loss 1.1218 | nw acc 0.525 | time 1 min 46 sec
cat 0: [754, 136, 95, 166] and [0.6551, 0.1182, 0.0825, 0.1442]
cat 1: [285, 1281, 416, 685] and [0.1069, 0.4803, 0.156, 0.2568]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [430, 1023, 324, 1961] and [0.115, 0.2737, 0.0867, 0.5246]
[test epoch 10/100] | loss 0.322 | nw acc 0.408 | time 0 min 18 sec
cat 0: [0, 56, 81, 51] and [0.0, 0.2979, 0.4309, 0.2713]
cat 1: [0, 542, 227, 489] and [0.0, 0.4308, 0.1804, 0.3887]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 139, 63, 242] and [0.0, 0.3131, 0.1419, 0.545]
[train epoch 11/100] | loss 1.1172 | nw acc 0.524 | time 1 min 34 sec
cat 0: [727, 134, 114, 159] and [0.6411, 0.1182, 0.1005, 0.1402]
cat 1: [252, 1245, 395, 631] and [0.0999, 0.4935, 0.1566, 0.2501]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [490, 1061, 326, 2022] and [0.1257, 0.2721, 0.0836, 0.5186]
[test epoch 11/100] | loss 0.315 | nw acc 0.434 | time 0 min 26 sec
cat 0: [0, 51, 82, 43] and [0.0, 0.2898, 0.4659, 0.2443]
cat 1: [0, 530, 213, 435] and [0.0, 0.4499, 0.1808, 0.3693]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 156, 76, 304] and [0.0, 0.291, 0.1418, 0.5672]
[train epoch 12/100] | loss 1.1027 | nw acc 0.538 | time 1 min 32 sec
cat 0: [804, 152, 110, 185] and [0.6427, 0.1215, 0.0879, 0.1479]
cat 1: [227, 1319, 398, 653] and [0.0874, 0.5079, 0.1533, 0.2514]
cat 2: [2, 7, 8, 7] and [0.0833, 0.2917, 0.3333, 0.2917]
cat 3: [436, 962, 319, 1967] and [0.1183, 0.2611, 0.0866, 0.5339]
[test epoch 12/100] | loss 0.332 | nw acc 0.359 | time 0 min 25 sec
cat 0: [0, 62, 101, 82] and [0.0, 0.2531, 0.4122, 0.3347]
cat 1: [0, 311, 161, 321] and [0.0, 0.3922, 0.203, 0.4048]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 364, 109, 379] and [0.0, 0.4272, 0.1279, 0.4448]
[train epoch 13/100] | loss 1.0898 | nw acc 0.545 | time 1 min 32 sec
cat 0: [778, 138, 104, 172] and [0.6527, 0.1158, 0.0872, 0.1443]
cat 1: [235, 1311, 382, 585] and [0.0935, 0.5217, 0.152, 0.2328]
cat 2: [4, 11, 15, 7] and [0.1081, 0.2973, 0.4054, 0.1892]
cat 3: [452, 980, 334, 2048] and [0.1185, 0.2569, 0.0876, 0.537]
[test epoch 13/100] | loss 0.315 | nw acc 0.395 | time 0 min 17 sec
cat 0: [0, 27, 76, 18] and [0.0, 0.2231, 0.6281, 0.1488]
cat 1: [0, 338, 193, 343] and [0.0, 0.3867, 0.2208, 0.3924]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 372, 102, 421] and [0.0, 0.4156, 0.114, 0.4704]
[train epoch 14/100] | loss 1.0858 | nw acc 0.552 | time 1 min 26 sec
cat 0: [796, 106, 106, 145] and [0.6904, 0.0919, 0.0919, 0.1258]
cat 1: [221, 1339, 356, 619] and [0.0872, 0.5282, 0.1404, 0.2442]
cat 2: [4, 19, 34, 11] and [0.0588, 0.2794, 0.5, 0.1618]
cat 3: [448, 976, 339, 2037] and [0.1179, 0.2568, 0.0892, 0.5361]
[test epoch 14/100] | loss 0.325 | nw acc 0.384 | time 0 min 23 sec
cat 0: [0, 57, 91, 47] and [0.0, 0.2923, 0.4667, 0.241]
cat 1: [0, 221, 106, 232] and [0.0, 0.3953, 0.1896, 0.415]
cat 2: [0, 0, 18, 5] and [0.0, 0.0, 0.7826, 0.2174]
cat 3: [0, 459, 156, 498] and [0.0, 0.4124, 0.1402, 0.4474]
[train epoch 15/100] | loss 1.068 | nw acc 0.566 | time 1 min 33 sec
cat 0: [823, 124, 105, 138] and [0.6916, 0.1042, 0.0882, 0.116]
cat 1: [218, 1343, 358, 558] and [0.088, 0.5422, 0.1445, 0.2253]
cat 2: [10, 37, 58, 30] and [0.0741, 0.2741, 0.4296, 0.2222]
cat 3: [418, 936, 314, 2086] and [0.1113, 0.2493, 0.0836, 0.5557]
[test epoch 15/100] | loss 0.33 | nw acc 0.369 | time 0 min 18 sec
cat 0: [0, 85, 115, 92] and [0.0, 0.2911, 0.3938, 0.3151]
cat 1: [0, 302, 126, 295] and [0.0, 0.4177, 0.1743, 0.408]
cat 2: [0, 7, 31, 20] and [0.0, 0.1207, 0.5345, 0.3448]
cat 3: [0, 343, 99, 375] and [0.0, 0.4198, 0.1212, 0.459]
[train epoch 16/100] | loss 1.0603 | nw acc 0.568 | time 1 min 36 sec
cat 0: [848, 111, 86, 131] and [0.7211, 0.0944, 0.0731, 0.1114]
cat 1: [211, 1342, 347, 609] and [0.0841, 0.5349, 0.1383, 0.2427]
cat 2: [14, 34, 88, 24] and [0.0875, 0.2125, 0.55, 0.15]
cat 3: [396, 953, 314, 2048] and [0.1067, 0.2568, 0.0846, 0.5519]
[test epoch 16/100] | loss 0.324 | nw acc 0.368 | time 0 min 28 sec
cat 0: [0, 72, 97, 76] and [0.0, 0.2939, 0.3959, 0.3102]
cat 1: [0, 397, 176, 401] and [0.0, 0.4076, 0.1807, 0.4117]
cat 2: [0, 1, 12, 8] and [0.0, 0.0476, 0.5714, 0.381]
cat 3: [0, 267, 86, 297] and [0.0, 0.4108, 0.1323, 0.4569]
[train epoch 17/100] | loss 1.0427 | nw acc 0.569 | time 1 min 23 sec
cat 0: [858, 126, 96, 161] and [0.6914, 0.1015, 0.0774, 0.1297]
cat 1: [252, 1381, 362, 626] and [0.0961, 0.5269, 0.1381, 0.2388]
cat 2: [5, 42, 101, 29] and [0.0282, 0.2373, 0.5706, 0.1638]
cat 3: [354, 891, 276, 1996] and [0.1007, 0.2533, 0.0785, 0.5675]
[test epoch 17/100] | loss 0.311 | nw acc 0.402 | time 0 min 27 sec
cat 0: [0, 53, 86, 39] and [0.0, 0.2978, 0.4831, 0.2191]
cat 1: [0, 314, 144, 299] and [0.0, 0.4148, 0.1902, 0.395]
cat 2: [0, 1, 15, 1] and [0.0, 0.0588, 0.8824, 0.0588]
cat 3: [0, 369, 126, 443] and [0.0, 0.3934, 0.1343, 0.4723]
[train epoch 18/100] | loss 1.0478 | nw acc 0.574 | time 1 min 29 sec
cat 0: [864, 93, 72, 129] and [0.7461, 0.0803, 0.0622, 0.1114]
cat 1: [238, 1329, 334, 582] and [0.0959, 0.5352, 0.1345, 0.2344]
cat 2: [11, 47, 116, 36] and [0.0524, 0.2238, 0.5524, 0.1714]
cat 3: [356, 971, 313, 2065] and [0.0961, 0.2621, 0.0845, 0.5574]
[test epoch 18/100] | loss 0.306 | nw acc 0.443 | time 0 min 18 sec
cat 0: [0, 19, 49, 17] and [0.0, 0.2235, 0.5765, 0.2]
cat 1: [0, 373, 168, 308] and [0.0, 0.4393, 0.1979, 0.3628]
cat 2: [0, 8, 28, 8] and [0.0, 0.1818, 0.6364, 0.1818]
cat 3: [0, 337, 126, 449] and [0.0, 0.3695, 0.1382, 0.4923]
[train epoch 19/100] | loss 1.029 | nw acc 0.587 | time 1 min 29 sec
cat 0: [872, 87, 85, 120] and [0.7491, 0.0747, 0.073, 0.1031]
cat 1: [226, 1426, 334, 598] and [0.0875, 0.5519, 0.1293, 0.2314]
cat 2: [4, 36, 108, 28] and [0.0227, 0.2045, 0.6136, 0.1591]
cat 3: [367, 891, 308, 2066] and [0.101, 0.2453, 0.0848, 0.5688]
[test epoch 19/100] | loss 0.318 | nw acc 0.4 | time 0 min 24 sec
cat 0: [0, 47, 92, 49] and [0.0, 0.25, 0.4894, 0.2606]
cat 1: [0, 234, 71, 219] and [0.0, 0.4466, 0.1355, 0.4179]
cat 2: [0, 27, 46, 26] and [0.0, 0.2727, 0.4646, 0.2626]
cat 3: [0, 429, 162, 488] and [0.0, 0.3976, 0.1501, 0.4523]
[train epoch 20/100] | loss 1.0562 | nw acc 0.567 | time 1 min 33 sec
cat 0: [811, 85, 87, 112] and [0.7406, 0.0776, 0.0795, 0.1023]
cat 1: [198, 1223, 324, 504] and [0.088, 0.5438, 0.1441, 0.2241]
cat 2: [9, 42, 105, 19] and [0.0514, 0.24, 0.6, 0.1086]
cat 3: [451, 1090, 319, 2177] and [0.1117, 0.27, 0.079, 0.5393]
[test epoch 20/100] | loss 0.323 | nw acc 0.374 | time 0 min 24 sec
cat 0: [0, 46, 87, 61] and [0.0, 0.2371, 0.4485, 0.3144]
cat 1: [0, 365, 153, 385] and [0.0, 0.4042, 0.1694, 0.4264]
cat 2: [0, 15, 41, 23] and [0.0, 0.1899, 0.519, 0.2911]
cat 3: [0, 311, 90, 313] and [0.0, 0.4356, 0.1261, 0.4384]
[train epoch 21/100] | loss 1.0411 | nw acc 0.574 | time 1 min 28 sec
cat 0: [857, 85, 85, 128] and [0.742, 0.0736, 0.0736, 0.1108]
cat 1: [265, 1448, 377, 692] and [0.0953, 0.5205, 0.1355, 0.2487]
cat 2: [11, 39, 104, 33] and [0.0588, 0.2086, 0.5561, 0.1765]
cat 3: [336, 868, 269, 1959] and [0.0979, 0.2529, 0.0784, 0.5708]
[test epoch 21/100] | loss 0.312 | nw acc 0.392 | time 0 min 22 sec
cat 0: [0, 36, 82, 35] and [0.0, 0.2353, 0.5359, 0.2288]
cat 1: [0, 283, 132, 297] and [0.0, 0.3975, 0.1854, 0.4171]
cat 2: [0, 8, 30, 11] and [0.0, 0.1633, 0.6122, 0.2245]
cat 3: [0, 410, 127, 439] and [0.0, 0.4201, 0.1301, 0.4498]
[train epoch 22/100] | loss 1.0119 | nw acc 0.591 | time 1 min 29 sec
cat 0: [884, 87, 75, 105] and [0.768, 0.0756, 0.0652, 0.0912]
cat 1: [214, 1377, 351, 555] and [0.0857, 0.5515, 0.1406, 0.2223]
cat 2: [8, 51, 123, 37] and [0.0365, 0.2329, 0.5616, 0.1689]
cat 3: [363, 925, 286, 2115] and [0.0984, 0.2507, 0.0775, 0.5733]
[test epoch 22/100] | loss 0.313 | nw acc 0.396 | time 0 min 23 sec
cat 0: [0, 43, 94, 57] and [0.0, 0.2216, 0.4845, 0.2938]
cat 1: [0, 295, 111, 286] and [0.0, 0.4263, 0.1604, 0.4133]
cat 2: [0, 15, 45, 18] and [0.0, 0.1923, 0.5769, 0.2308]
cat 3: [0, 384, 121, 421] and [0.0, 0.4147, 0.1307, 0.4546]
[train epoch 23/100] | loss 1.0131 | nw acc 0.589 | time 1 min 30 sec
cat 0: [840, 79, 79, 117] and [0.7534, 0.0709, 0.0709, 0.1049]
cat 1: [254, 1445, 349, 597] and [0.096, 0.5463, 0.1319, 0.2257]
cat 2: [9, 45, 116, 16] and [0.0484, 0.2419, 0.6237, 0.086]
cat 3: [366, 871, 291, 2082] and [0.1014, 0.2413, 0.0806, 0.5767]
[test epoch 23/100] | loss 0.317 | nw acc 0.416 | time 0 min 22 sec
cat 0: [0, 61, 86, 44] and [0.0, 0.3194, 0.4503, 0.2304]
cat 1: [0, 399, 149, 376] and [0.0, 0.4318, 0.1613, 0.4069]
cat 2: [0, 45, 54, 17] and [0.0, 0.3879, 0.4655, 0.1466]
cat 3: [0, 232, 82, 345] and [0.0, 0.352, 0.1244, 0.5235]
[train epoch 24/100] | loss 1.0084 | nw acc 0.597 | time 1 min 40 sec
cat 0: [898, 101, 80, 136] and [0.7391, 0.0831, 0.0658, 0.1119]
cat 1: [205, 1447, 321, 575] and [0.0805, 0.5679, 0.126, 0.2257]
cat 2: [14, 48, 142, 38] and [0.0579, 0.1983, 0.5868, 0.157]
cat 3: [352, 844, 292, 2063] and [0.0991, 0.2377, 0.0822, 0.581]
[test epoch 24/100] | loss 0.318 | nw acc 0.423 | time 0 min 23 sec
cat 0: [0, 29, 65, 15] and [0.0, 0.2661, 0.5963, 0.1376]
cat 1: [0, 479, 200, 471] and [0.0, 0.4165, 0.1739, 0.4096]
cat 2: [0, 69, 51, 14] and [0.0, 0.5149, 0.3806, 0.1045]
cat 3: [0, 160, 55, 282] and [0.0, 0.3219, 0.1107, 0.5674]
[train epoch 25/100] | loss 1.007 | nw acc 0.603 | time 1 min 28 sec
cat 0: [883, 106, 92, 107] and [0.7433, 0.0892, 0.0774, 0.0901]
cat 1: [250, 1461, 330, 586] and [0.0952, 0.5561, 0.1256, 0.2231]
cat 2: [7, 51, 156, 25] and [0.0293, 0.2134, 0.6527, 0.1046]
cat 3: [329, 822, 257, 2094] and [0.0939, 0.2347, 0.0734, 0.5979]
[test epoch 25/100] | loss 0.312 | nw acc 0.408 | time 0 min 17 sec
cat 0: [0, 20, 57, 8] and [0.0, 0.2353, 0.6706, 0.0941]
cat 1: [0, 284, 122, 313] and [0.0, 0.395, 0.1697, 0.4353]
cat 2: [0, 31, 53, 14] and [0.0, 0.3163, 0.5408, 0.1429]
cat 3: [0, 402, 139, 447] and [0.0, 0.4069, 0.1407, 0.4524]
[train epoch 26/100] | loss 1.0049 | nw acc 0.598 | time 1 min 28 sec
cat 0: [875, 90, 84, 109] and [0.7556, 0.0777, 0.0725, 0.0941]
cat 1: [212, 1443, 343, 587] and [0.082, 0.5582, 0.1327, 0.2271]
cat 2: [13, 47, 141, 23] and [0.058, 0.2098, 0.6295, 0.1027]
cat 3: [369, 860, 267, 2093] and [0.1028, 0.2396, 0.0744, 0.5832]
[test epoch 26/100] | loss 0.335 | nw acc 0.351 | time 0 min 20 sec
cat 0: [0, 85, 115, 88] and [0.0, 0.2951, 0.3993, 0.3056]
cat 1: [0, 279, 107, 340] and [0.0, 0.3843, 0.1474, 0.4683]
cat 2: [0, 24, 60, 20] and [0.0, 0.2308, 0.5769, 0.1923]
cat 3: [0, 349, 89, 334] and [0.0, 0.4521, 0.1153, 0.4326]
[train epoch 27/100] | loss 0.99552 | nw acc 0.604 | time 1 min 30 sec
cat 0: [877, 82, 94, 98] and [0.7619, 0.0712, 0.0817, 0.0851]
cat 1: [207, 1423, 297, 564] and [0.0831, 0.5713, 0.1192, 0.2264]
cat 2: [17, 63, 179, 31] and [0.0586, 0.2172, 0.6172, 0.1069]
cat 3: [368, 872, 265, 2119] and [0.1015, 0.2406, 0.0731, 0.5847]
[test epoch 27/100] | loss 0.339 | nw acc 0.345 | time 0 min 19 sec
cat 0: [0, 97, 130, 117] and [0.0, 0.282, 0.3779, 0.3401]
cat 1: [0, 320, 121, 357] and [0.0, 0.401, 0.1516, 0.4474]
cat 2: [0, 13, 44, 10] and [0.0, 0.194, 0.6567, 0.1493]
cat 3: [0, 307, 76, 298] and [0.0, 0.4508, 0.1116, 0.4376]
[train epoch 28/100] | loss 0.99059 | nw acc 0.609 | time 1 min 28 sec
cat 0: [906, 101, 82, 119] and [0.75, 0.0836, 0.0679, 0.0985]
cat 1: [204, 1469, 327, 540] and [0.0803, 0.5783, 0.1287, 0.2126]
cat 2: [10, 46, 135, 27] and [0.0459, 0.211, 0.6193, 0.1239]
cat 3: [349, 824, 291, 2126] and [0.0972, 0.2295, 0.0811, 0.5922]
[test epoch 28/100] | loss 0.331 | nw acc 0.373 | time 0 min 16 sec
cat 0: [0, 48, 85, 39] and [0.0, 0.2791, 0.4942, 0.2267]
cat 1: [0, 327, 144, 386] and [0.0, 0.3816, 0.168, 0.4504]
cat 2: [0, 23, 45, 12] and [0.0, 0.2875, 0.5625, 0.15]
cat 3: [0, 339, 97, 345] and [0.0, 0.4341, 0.1242, 0.4417]
[train epoch 29/100] | loss 0.98425 | nw acc 0.609 | time 1 min 44 sec
cat 0: [920, 83, 80, 80] and [0.7911, 0.0714, 0.0688, 0.0688]
cat 1: [193, 1441, 321, 577] and [0.0762, 0.5691, 0.1268, 0.2279]
cat 2: [15, 53, 151, 27] and [0.061, 0.2154, 0.6138, 0.1098]
cat 3: [341, 863, 283, 2128] and [0.0943, 0.2387, 0.0783, 0.5887]
[test epoch 29/100] | loss 0.328 | nw acc 0.385 | time 0 min 23 sec
cat 0: [0, 61, 101, 61] and [0.0, 0.2735, 0.4529, 0.2735]
cat 1: [0, 250, 100, 276] and [0.0, 0.3994, 0.1597, 0.4409]
cat 2: [0, 28, 71, 26] and [0.0, 0.224, 0.568, 0.208]
cat 3: [0, 398, 99, 419] and [0.0, 0.4345, 0.1081, 0.4574]
