BenchMarkAug(
  (conv1): Conv2d(1, 3, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (pool1): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (drop1): Dropout2d(p=0.2)
  (conv2): Conv2d(3, 16, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (pool2): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (drop2): Dropout2d(p=0.2)
  (conv3): Conv2d(16, 64, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (pool3): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (drop3): Dropout2d(p=0.2)
  (fc1): Linear(in_features=576, out_features=4, bias=True)
  (softmax): Softmax()
)
train patients [42 40 24 53  2 55 22 17 29 18 51  8 14  5 19 43 15 46  7 45  1 34 13 44
 31  6 30 47 25 23 10 50 54  3  0]
train labels [1111 2105  798 3241]
test patients [41 48 35  4 11 32 36 12 49]
test labels [ 358 1072  408  353]

[train epoch 1/100] | loss 1.3032 | nw acc 0.439 | time 1 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [74, 145, 48, 182] and [0.1648, 0.3229, 0.1069, 0.4053]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1037, 1960, 750, 3059] and [0.1524, 0.288, 0.1102, 0.4495]
[test epoch 1/100] | loss 0.46 | nw acc 0.158 | time 1 min 22 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [358, 1072, 408, 353] and [0.1634, 0.4893, 0.1862, 0.1611]
[train epoch 2/100] | loss 1.2884 | nw acc 0.444 | time 1 min 5 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1111, 2105, 798, 3241] and [0.1531, 0.2901, 0.11, 0.4467]
[test epoch 2/100] | loss 0.446 | nw acc 0.158 | time 0 min 23 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [358, 1072, 408, 353] and [0.1634, 0.4893, 0.1862, 0.1611]
[train epoch 3/100] | loss 1.2694 | nw acc 0.455 | time 1 min 16 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [122, 330, 122, 248] and [0.1484, 0.4015, 0.1484, 0.3017]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [989, 1775, 676, 2993] and [0.1537, 0.2759, 0.1051, 0.4653]
[test epoch 3/100] | loss 0.453 | nw acc 0.182 | time 0 min 25 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [79, 76, 34, 22] and [0.3744, 0.3602, 0.1611, 0.1043]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [279, 996, 374, 331] and [0.1409, 0.503, 0.1889, 0.1672]
[train epoch 4/100] | loss 1.2669 | nw acc 0.458 | time 1 min 23 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [301, 641, 277, 542] and [0.1709, 0.364, 0.1573, 0.3078]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [810, 1464, 521, 2699] and [0.1474, 0.2665, 0.0948, 0.4913]
[test epoch 4/100] | loss 0.433 | nw acc 0.291 | time 0 min 30 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [279, 415, 178, 116] and [0.2824, 0.42, 0.1802, 0.1174]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [79, 657, 230, 237] and [0.0657, 0.5461, 0.1912, 0.197]
[train epoch 5/100] | loss 1.2644 | nw acc 0.464 | time 1 min 43 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [307, 730, 286, 585] and [0.1609, 0.3826, 0.1499, 0.3066]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [804, 1375, 512, 2656] and [0.1504, 0.2572, 0.0958, 0.4967]
[test epoch 5/100] | loss 0.437 | nw acc 0.292 | time 0 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [286, 403, 173, 103] and [0.2964, 0.4176, 0.1793, 0.1067]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [72, 669, 235, 250] and [0.0587, 0.5457, 0.1917, 0.2039]
[train epoch 6/100] | loss 1.2632 | nw acc 0.469 | time 1 min 46 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [325, 763, 294, 584] and [0.1653, 0.3881, 0.1495, 0.297]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [786, 1342, 504, 2657] and [0.1486, 0.2537, 0.0953, 0.5024]
[test epoch 6/100] | loss 0.443 | nw acc 0.258 | time 0 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [252, 277, 131, 52] and [0.3539, 0.389, 0.184, 0.073]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [106, 795, 277, 301] and [0.0717, 0.5375, 0.1873, 0.2035]
[train epoch 7/100] | loss 1.2576 | nw acc 0.48 | time 1 min 45 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [335, 796, 296, 538] and [0.1705, 0.4051, 0.1506, 0.2738]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [776, 1309, 502, 2703] and [0.1467, 0.2474, 0.0949, 0.511]
[test epoch 7/100] | loss 0.436 | nw acc 0.294 | time 0 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [289, 413, 182, 108] and [0.2913, 0.4163, 0.1835, 0.1089]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [69, 659, 226, 245] and [0.0575, 0.5496, 0.1885, 0.2043]
[train epoch 8/100] | loss 1.2602 | nw acc 0.476 | time 1 min 45 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [341, 814, 301, 581] and [0.1674, 0.3996, 0.1478, 0.2852]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [770, 1291, 497, 2660] and [0.1476, 0.2474, 0.0952, 0.5098]
[test epoch 8/100] | loss 0.441 | nw acc 0.275 | time 0 min 30 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [260, 319, 142, 57] and [0.3342, 0.41, 0.1825, 0.0733]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [98, 753, 266, 296] and [0.0694, 0.5329, 0.1883, 0.2095]
[train epoch 9/100] | loss 1.26 | nw acc 0.479 | time 1 min 44 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [329, 794, 278, 539] and [0.1696, 0.4093, 0.1433, 0.2778]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [782, 1311, 520, 2702] and [0.1471, 0.2467, 0.0978, 0.5084]
[test epoch 9/100] | loss 0.447 | nw acc 0.252 | time 0 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [242, 266, 126, 54] and [0.3517, 0.3866, 0.1831, 0.0785]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [116, 806, 282, 299] and [0.0772, 0.5363, 0.1876, 0.1989]
[train epoch 10/100] | loss 1.2599 | nw acc 0.471 | time 1 min 43 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [351, 783, 283, 589] and [0.175, 0.3903, 0.1411, 0.2936]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [760, 1322, 515, 2652] and [0.1448, 0.2519, 0.0981, 0.5052]
[test epoch 10/100] | loss 0.442 | nw acc 0.28 | time 0 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [267, 323, 148, 49] and [0.3393, 0.4104, 0.1881, 0.0623]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [91, 749, 260, 304] and [0.0648, 0.5335, 0.1852, 0.2165]
[train epoch 11/100] | loss 1.2564 | nw acc 0.483 | time 1 min 45 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [328, 793, 278, 509] and [0.1719, 0.4156, 0.1457, 0.2668]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [783, 1312, 520, 2732] and [0.1464, 0.2454, 0.0973, 0.5109]
[test epoch 11/100] | loss 0.44 | nw acc 0.283 | time 0 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [275, 379, 188, 97] and [0.2929, 0.4036, 0.2002, 0.1033]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [83, 693, 220, 256] and [0.0663, 0.5535, 0.1757, 0.2045]
[train epoch 12/100] | loss 1.2526 | nw acc 0.483 | time 1 min 44 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [351, 854, 327, 569] and [0.1671, 0.4065, 0.1556, 0.2708]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [760, 1251, 471, 2672] and [0.1475, 0.2427, 0.0914, 0.5184]
[test epoch 12/100] | loss 0.434 | nw acc 0.299 | time 0 min 32 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [287, 416, 198, 99] and [0.287, 0.416, 0.198, 0.099]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [71, 656, 210, 254] and [0.0596, 0.5508, 0.1763, 0.2133]
[train epoch 13/100] | loss 1.2568 | nw acc 0.486 | time 1 min 46 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [329, 795, 279, 490] and [0.1738, 0.42, 0.1474, 0.2588]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [782, 1310, 519, 2751] and [0.1458, 0.2443, 0.0968, 0.5131]
[test epoch 13/100] | loss 0.434 | nw acc 0.312 | time 0 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [291, 449, 193, 104] and [0.2806, 0.433, 0.1861, 0.1003]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [67, 623, 215, 249] and [0.0581, 0.5399, 0.1863, 0.2158]
[train epoch 14/100] | loss 1.2592 | nw acc 0.479 | time 1 min 45 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [299, 780, 271, 529] and [0.1591, 0.4151, 0.1442, 0.2815]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [812, 1325, 527, 2712] and [0.151, 0.2465, 0.098, 0.5045]
[test epoch 14/100] | loss 0.438 | nw acc 0.284 | time 0 min 33 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [282, 356, 165, 73] and [0.3219, 0.4064, 0.1884, 0.0833]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [76, 716, 243, 280] and [0.0578, 0.5445, 0.1848, 0.2129]
[train epoch 15/100] | loss 1.26 | nw acc 0.477 | time 1 min 46 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [305, 742, 281, 506] and [0.1663, 0.4046, 0.1532, 0.2759]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [806, 1363, 517, 2735] and [0.1487, 0.2514, 0.0954, 0.5045]
[test epoch 15/100] | loss 0.439 | nw acc 0.292 | time 0 min 30 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [274, 383, 167, 81] and [0.3028, 0.4232, 0.1845, 0.0895]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [84, 689, 241, 272] and [0.0653, 0.5358, 0.1874, 0.2115]
[train epoch 16/100] | loss 1.2589 | nw acc 0.478 | time 1 min 44 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [333, 801, 278, 556] and [0.1692, 0.407, 0.1413, 0.2825]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [778, 1304, 520, 2685] and [0.1472, 0.2466, 0.0984, 0.5078]
[test epoch 16/100] | loss 0.441 | nw acc 0.283 | time 0 min 30 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [266, 348, 162, 67] and [0.3155, 0.4128, 0.1922, 0.0795]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [92, 724, 246, 286] and [0.0682, 0.5371, 0.1825, 0.2122]
[train epoch 17/100] | loss 1.2586 | nw acc 0.481 | time 1 min 46 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [336, 802, 279, 533] and [0.1723, 0.4113, 0.1431, 0.2733]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [775, 1303, 519, 2708] and [0.1461, 0.2456, 0.0978, 0.5105]
[test epoch 17/100] | loss 0.439 | nw acc 0.295 | time 0 min 32 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [280, 381, 159, 74] and [0.3132, 0.4262, 0.1779, 0.0828]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [78, 691, 249, 279] and [0.0601, 0.5328, 0.192, 0.2151]
[train epoch 18/100] | loss 1.2535 | nw acc 0.491 | time 1 min 46 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [300, 812, 270, 474] and [0.1616, 0.4375, 0.1455, 0.2554]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [811, 1293, 528, 2767] and [0.1502, 0.2395, 0.0978, 0.5125]
[test epoch 18/100] | loss 0.438 | nw acc 0.294 | time 0 min 32 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [278, 382, 172, 76] and [0.3062, 0.4207, 0.1894, 0.0837]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [80, 690, 236, 277] and [0.0624, 0.5378, 0.1839, 0.2159]
[train epoch 19/100] | loss 1.2547 | nw acc 0.485 | time 1 min 46 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [327, 771, 290, 470] and [0.176, 0.415, 0.1561, 0.253]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [784, 1334, 508, 2771] and [0.1453, 0.2472, 0.0941, 0.5134]
[test epoch 19/100] | loss 0.437 | nw acc 0.293 | time 0 min 32 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [272, 380, 156, 77] and [0.3073, 0.4294, 0.1763, 0.087]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [86, 692, 252, 276] and [0.0658, 0.5299, 0.193, 0.2113]
[train epoch 20/100] | loss 1.2555 | nw acc 0.485 | time 1 min 45 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [311, 776, 261, 481] and [0.17, 0.4243, 0.1427, 0.263]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [800, 1329, 537, 2760] and [0.1474, 0.2449, 0.099, 0.5087]
[test epoch 20/100] | loss 0.435 | nw acc 0.29 | time 0 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [285, 396, 177, 99] and [0.2978, 0.4138, 0.185, 0.1034]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [73, 676, 231, 254] and [0.0592, 0.5478, 0.1872, 0.2058]
[train epoch 21/100] | loss 1.2549 | nw acc 0.485 | time 1 min 45 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [374, 823, 309, 526] and [0.1841, 0.405, 0.1521, 0.2589]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [737, 1282, 489, 2715] and [0.1411, 0.2455, 0.0936, 0.5198]
[test epoch 21/100] | loss 0.442 | nw acc 0.275 | time 0 min 30 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [261, 325, 151, 61] and [0.3271, 0.4073, 0.1892, 0.0764]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [97, 747, 257, 292] and [0.0696, 0.5363, 0.1845, 0.2096]
[train epoch 22/100] | loss 1.2524 | nw acc 0.49 | time 1 min 44 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [366, 880, 289, 545] and [0.176, 0.4231, 0.1389, 0.262]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [745, 1225, 509, 2696] and [0.144, 0.2367, 0.0984, 0.521]
[test epoch 22/100] | loss 0.444 | nw acc 0.272 | time 0 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [244, 291, 126, 34] and [0.3511, 0.4187, 0.1813, 0.0489]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [114, 781, 282, 319] and [0.0762, 0.5221, 0.1885, 0.2132]
[train epoch 23/100] | loss 1.2524 | nw acc 0.488 | time 1 min 43 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [332, 822, 252, 502] and [0.174, 0.4308, 0.1321, 0.2631]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [779, 1283, 546, 2739] and [0.1457, 0.2399, 0.1021, 0.5122]
[test epoch 23/100] | loss 0.439 | nw acc 0.288 | time 0 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [273, 348, 149, 55] and [0.3309, 0.4218, 0.1806, 0.0667]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [85, 724, 259, 298] and [0.0622, 0.53, 0.1896, 0.2182]
[train epoch 24/100] | loss 1.2573 | nw acc 0.48 | time 1 min 44 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [299, 756, 273, 492] and [0.1643, 0.4154, 0.15, 0.2703]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [812, 1349, 525, 2749] and [0.1494, 0.2482, 0.0966, 0.5058]
[test epoch 24/100] | loss 0.435 | nw acc 0.297 | time 0 min 32 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [282, 384, 182, 71] and [0.3069, 0.4178, 0.198, 0.0773]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [76, 688, 226, 282] and [0.0597, 0.5409, 0.1777, 0.2217]
[train epoch 25/100] | loss 1.2564 | nw acc 0.481 | time 1 min 47 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [331, 778, 269, 511] and [0.1752, 0.4119, 0.1424, 0.2705]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [780, 1327, 529, 2730] and [0.1454, 0.2473, 0.0986, 0.5088]
[test epoch 25/100] | loss 0.44 | nw acc 0.284 | time 0 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [257, 337, 147, 53] and [0.3237, 0.4244, 0.1851, 0.0668]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [101, 735, 261, 300] and [0.0723, 0.5261, 0.1868, 0.2147]
[train epoch 26/100] | loss 1.2545 | nw acc 0.486 | time 1 min 44 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [338, 820, 286, 517] and [0.1724, 0.4182, 0.1458, 0.2636]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [773, 1285, 512, 2724] and [0.146, 0.2427, 0.0967, 0.5145]
[test epoch 26/100] | loss 0.433 | nw acc 0.306 | time 0 min 30 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [299, 430, 194, 97] and [0.2931, 0.4216, 0.1902, 0.0951]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [59, 642, 214, 256] and [0.0504, 0.5482, 0.1827, 0.2186]
[train epoch 27/100] | loss 1.2557 | nw acc 0.482 | time 1 min 45 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [324, 784, 269, 510] and [0.1717, 0.4155, 0.1426, 0.2703]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [787, 1321, 529, 2731] and [0.1466, 0.2461, 0.0985, 0.5088]
[test epoch 27/100] | loss 0.427 | nw acc 0.323 | time 0 min 30 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [299, 471, 210, 100] and [0.2769, 0.4361, 0.1944, 0.0926]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [59, 601, 198, 253] and [0.0531, 0.541, 0.1782, 0.2277]
[train epoch 28/100] | loss 1.2551 | nw acc 0.483 | time 1 min 44 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [304, 805, 281, 522] and [0.159, 0.421, 0.147, 0.273]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [807, 1300, 517, 2719] and [0.151, 0.2433, 0.0968, 0.5089]
[test epoch 28/100] | loss 0.44 | nw acc 0.28 | time 0 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [264, 344, 163, 69] and [0.3143, 0.4095, 0.194, 0.0821]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [94, 728, 245, 284] and [0.0696, 0.5389, 0.1813, 0.2102]
[train epoch 29/100] | loss 1.2544 | nw acc 0.487 | time 1 min 45 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [332, 807, 283, 498] and [0.1729, 0.4203, 0.1474, 0.2594]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [779, 1298, 515, 2743] and [0.146, 0.2433, 0.0965, 0.5142]
[test epoch 29/100] | loss 0.445 | nw acc 0.262 | time 0 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [245, 287, 135, 53] and [0.3403, 0.3986, 0.1875, 0.0736]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [113, 785, 273, 300] and [0.0768, 0.5337, 0.1856, 0.2039]
[train epoch 30/100] | loss 1.2534 | nw acc 0.485 | time 1 min 42 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [322, 793, 284, 495] and [0.17, 0.4187, 0.1499, 0.2614]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [789, 1312, 514, 2746] and [0.1472, 0.2447, 0.0959, 0.5122]
[test epoch 30/100] | loss 0.44 | nw acc 0.28 | time 0 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [266, 336, 151, 61] and [0.3268, 0.4128, 0.1855, 0.0749]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [92, 736, 257, 292] and [0.0668, 0.5345, 0.1866, 0.2121]
[train epoch 31/100] | loss 1.2519 | nw acc 0.483 | time 1 min 44 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [308, 789, 290, 509] and [0.1624, 0.4161, 0.153, 0.2685]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [803, 1316, 508, 2732] and [0.1498, 0.2456, 0.0948, 0.5098]
[test epoch 31/100] | loss 0.436 | nw acc 0.292 | time 0 min 32 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [271, 372, 168, 71] and [0.3073, 0.4218, 0.1905, 0.0805]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [87, 700, 240, 282] and [0.0665, 0.5348, 0.1833, 0.2154]
[train epoch 32/100] | loss 1.2499 | nw acc 0.487 | time 1 min 45 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [336, 818, 280, 503] and [0.1735, 0.4223, 0.1446, 0.2597]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [775, 1287, 518, 2738] and [0.1457, 0.242, 0.0974, 0.5149]
[test epoch 32/100] | loss 0.434 | nw acc 0.3 | time 0 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [289, 401, 189, 82] and [0.3007, 0.4173, 0.1967, 0.0853]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [69, 671, 219, 271] and [0.0561, 0.5455, 0.178, 0.2203]
[train epoch 33/100] | loss 1.2482 | nw acc 0.492 | time 1 min 44 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [352, 862, 283, 516] and [0.1749, 0.4282, 0.1406, 0.2563]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [759, 1243, 515, 2725] and [0.1448, 0.2371, 0.0982, 0.5198]
[test epoch 33/100] | loss 0.439 | nw acc 0.289 | time 0 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [258, 351, 144, 57] and [0.3185, 0.4333, 0.1778, 0.0704]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [100, 721, 264, 296] and [0.0724, 0.5221, 0.1912, 0.2143]
[train epoch 34/100] | loss 1.2511 | nw acc 0.492 | time 1 min 47 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [328, 839, 253, 492] and [0.1715, 0.4388, 0.1323, 0.2573]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [783, 1266, 545, 2749] and [0.1465, 0.2369, 0.102, 0.5145]
[test epoch 34/100] | loss 0.432 | nw acc 0.312 | time 0 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [283, 409, 190, 63] and [0.2995, 0.4328, 0.2011, 0.0667]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [75, 663, 218, 290] and [0.0602, 0.5321, 0.175, 0.2327]
[train epoch 35/100] | loss 1.2492 | nw acc 0.487 | time 1 min 44 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [338, 837, 290, 523] and [0.17, 0.421, 0.1459, 0.2631]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [773, 1268, 508, 2718] and [0.1468, 0.2407, 0.0964, 0.516]
[test epoch 35/100] | loss 0.435 | nw acc 0.292 | time 0 min 30 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [279, 397, 175, 97] and [0.2943, 0.4188, 0.1846, 0.1023]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [79, 675, 233, 256] and [0.0636, 0.543, 0.1874, 0.206]
[train epoch 36/100] | loss 1.2497 | nw acc 0.486 | time 1 min 47 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [338, 836, 306, 532] and [0.168, 0.4155, 0.1521, 0.2644]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [773, 1269, 492, 2709] and [0.1474, 0.242, 0.0938, 0.5167]
[test epoch 36/100] | loss 0.439 | nw acc 0.292 | time 0 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [258, 359, 160, 58] and [0.309, 0.4299, 0.1916, 0.0695]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [100, 713, 248, 295] and [0.0737, 0.5258, 0.1829, 0.2176]
[train epoch 37/100] | loss 1.2486 | nw acc 0.491 | time 1 min 44 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [335, 825, 274, 481] and [0.1749, 0.4308, 0.1431, 0.2512]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [776, 1280, 524, 2760] and [0.1453, 0.2397, 0.0981, 0.5169]
[test epoch 37/100] | loss 0.434 | nw acc 0.303 | time 0 min 30 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [270, 390, 181, 65] and [0.298, 0.4305, 0.1998, 0.0717]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [88, 682, 227, 288] and [0.0685, 0.5307, 0.1767, 0.2241]
[train epoch 38/100] | loss 1.2571 | nw acc 0.48 | time 1 min 44 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [325, 762, 272, 499] and [0.1749, 0.4101, 0.1464, 0.2686]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [786, 1343, 526, 2742] and [0.1456, 0.2488, 0.0975, 0.5081]
[test epoch 38/100] | loss 0.429 | nw acc 0.306 | time 0 min 32 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [295, 394, 194, 62] and [0.3122, 0.4169, 0.2053, 0.0656]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [63, 678, 214, 291] and [0.0506, 0.5441, 0.1717, 0.2335]
[train epoch 39/100] | loss 1.2495 | nw acc 0.488 | time 1 min 43 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [371, 817, 295, 499] and [0.1872, 0.4122, 0.1488, 0.2518]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [740, 1288, 503, 2742] and [0.1403, 0.2443, 0.0954, 0.52]
[test epoch 39/100] | loss 0.436 | nw acc 0.292 | time 0 min 29 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [281, 374, 174, 72] and [0.3119, 0.4151, 0.1931, 0.0799]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [77, 698, 234, 281] and [0.0597, 0.5411, 0.1814, 0.2178]
[train epoch 40/100] | loss 1.2492 | nw acc 0.495 | time 1 min 43 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [324, 806, 286, 437] and [0.1749, 0.435, 0.1543, 0.2358]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [787, 1299, 512, 2804] and [0.1457, 0.2405, 0.0948, 0.5191]
[test epoch 40/100] | loss 0.432 | nw acc 0.302 | time 0 min 32 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [290, 418, 190, 95] and [0.292, 0.4209, 0.1913, 0.0957]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [68, 654, 218, 258] and [0.0568, 0.5459, 0.182, 0.2154]
[train epoch 41/100] | loss 1.2519 | nw acc 0.481 | time 1 min 42 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [348, 825, 301, 554] and [0.1716, 0.4068, 0.1484, 0.2732]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [763, 1280, 497, 2687] and [0.146, 0.2449, 0.0951, 0.5141]
[test epoch 41/100] | loss 0.438 | nw acc 0.292 | time 0 min 32 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [264, 360, 153, 59] and [0.3158, 0.4306, 0.183, 0.0706]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [94, 712, 255, 294] and [0.0694, 0.5255, 0.1882, 0.217]
[train epoch 42/100] | loss 1.2499 | nw acc 0.489 | time 1 min 46 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [348, 805, 292, 480] and [0.1808, 0.4182, 0.1517, 0.2494]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [763, 1300, 506, 2761] and [0.1432, 0.2439, 0.0949, 0.518]
[test epoch 42/100] | loss 0.428 | nw acc 0.32 | time 0 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [286, 467, 199, 104] and [0.2708, 0.4422, 0.1884, 0.0985]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [72, 605, 209, 249] and [0.0634, 0.533, 0.1841, 0.2194]
[train epoch 43/100] | loss 1.2511 | nw acc 0.486 | time 1 min 44 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [328, 799, 295, 493] and [0.1713, 0.4172, 0.154, 0.2574]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [783, 1306, 503, 2748] and [0.1466, 0.2446, 0.0942, 0.5146]
[test epoch 43/100] | loss 0.437 | nw acc 0.29 | time 0 min 32 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [267, 362, 162, 66] and [0.3116, 0.4224, 0.189, 0.077]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [91, 710, 246, 287] and [0.0682, 0.5322, 0.1844, 0.2151]
[train epoch 44/100] | loss 1.2523 | nw acc 0.484 | time 1 min 45 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [354, 817, 316, 527] and [0.1758, 0.4057, 0.1569, 0.2617]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [757, 1288, 482, 2714] and [0.1444, 0.2458, 0.092, 0.5178]
[test epoch 44/100] | loss 0.425 | nw acc 0.318 | time 0 min 30 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [281, 438, 204, 79] and [0.2804, 0.4371, 0.2036, 0.0788]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [77, 634, 204, 274] and [0.0648, 0.5332, 0.1716, 0.2304]
[train epoch 45/100] | loss 1.2494 | nw acc 0.486 | time 1 min 46 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [332, 796, 280, 493] and [0.1746, 0.4187, 0.1473, 0.2593]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [779, 1309, 518, 2748] and [0.1455, 0.2445, 0.0968, 0.5133]
[test epoch 45/100] | loss 0.433 | nw acc 0.3 | time 0 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [276, 374, 164, 54] and [0.318, 0.4309, 0.1889, 0.0622]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [82, 698, 244, 299] and [0.062, 0.5276, 0.1844, 0.226]
[train epoch 46/100] | loss 1.2526 | nw acc 0.487 | time 1 min 46 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [360, 846, 308, 537] and [0.1755, 0.4125, 0.1502, 0.2618]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [751, 1259, 490, 2704] and [0.1443, 0.2419, 0.0942, 0.5196]
[test epoch 46/100] | loss 0.425 | nw acc 0.325 | time 0 min 29 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [294, 465, 209, 90] and [0.2779, 0.4395, 0.1975, 0.0851]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [64, 607, 199, 263] and [0.0565, 0.5357, 0.1756, 0.2321]
[train epoch 47/100] | loss 1.2503 | nw acc 0.484 | time 1 min 44 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [357, 834, 283, 543] and [0.177, 0.4135, 0.1403, 0.2692]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [754, 1271, 515, 2698] and [0.1439, 0.2426, 0.0983, 0.5151]
[test epoch 47/100] | loss 0.433 | nw acc 0.294 | time 0 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [288, 384, 186, 78] and [0.3077, 0.4103, 0.1987, 0.0833]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [70, 688, 222, 275] and [0.0558, 0.5482, 0.1769, 0.2191]
[train epoch 48/100] | loss 1.2501 | nw acc 0.487 | time 1 min 45 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [349, 832, 292, 520] and [0.1751, 0.4175, 0.1465, 0.2609]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [762, 1273, 506, 2721] and [0.1448, 0.2419, 0.0962, 0.5171]
[test epoch 48/100] | loss 0.431 | nw acc 0.3 | time 0 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [293, 412, 193, 92] and [0.296, 0.4162, 0.1949, 0.0929]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [65, 660, 215, 261] and [0.0541, 0.5495, 0.179, 0.2173]
[train epoch 49/100] | loss 1.248 | nw acc 0.491 | time 1 min 43 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [370, 844, 308, 501] and [0.1829, 0.4172, 0.1522, 0.2477]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [741, 1261, 490, 2740] and [0.1416, 0.241, 0.0937, 0.5237]
[test epoch 49/100] | loss 0.437 | nw acc 0.292 | time 0 min 29 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [270, 351, 160, 51] and [0.3245, 0.4219, 0.1923, 0.0613]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [88, 721, 248, 302] and [0.0648, 0.5305, 0.1825, 0.2222]
[train epoch 50/100] | loss 1.2476 | nw acc 0.49 | time 1 min 43 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [373, 864, 309, 529] and [0.1798, 0.4164, 0.1489, 0.2549]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [738, 1241, 489, 2712] and [0.1425, 0.2396, 0.0944, 0.5236]
[test epoch 50/100] | loss 0.432 | nw acc 0.305 | time 0 min 32 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [277, 388, 158, 57] and [0.3148, 0.4409, 0.1795, 0.0648]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [81, 684, 250, 296] and [0.0618, 0.5217, 0.1907, 0.2258]
[train epoch 51/100] | loss 1.2476 | nw acc 0.49 | time 1 min 48 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [356, 825, 279, 494] and [0.1822, 0.4222, 0.1428, 0.2528]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [755, 1280, 519, 2747] and [0.1424, 0.2415, 0.0979, 0.5182]
[test epoch 51/100] | loss 0.436 | nw acc 0.288 | time 0 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [261, 358, 161, 65] and [0.3089, 0.4237, 0.1905, 0.0769]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [97, 714, 247, 288] and [0.0721, 0.5305, 0.1835, 0.214]
[train epoch 52/100] | loss 1.2446 | nw acc 0.492 | time 1 min 45 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [388, 839, 303, 491] and [0.192, 0.4151, 0.1499, 0.2429]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [723, 1266, 495, 2750] and [0.1381, 0.2419, 0.0946, 0.5254]
[test epoch 52/100] | loss 0.433 | nw acc 0.302 | time 0 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [275, 379, 182, 56] and [0.3083, 0.4249, 0.204, 0.0628]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [83, 693, 226, 297] and [0.0639, 0.5335, 0.174, 0.2286]
[train epoch 53/100] | loss 1.2483 | nw acc 0.486 | time 1 min 45 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [359, 854, 318, 551] and [0.1724, 0.4102, 0.1527, 0.2646]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [752, 1251, 480, 2690] and [0.1454, 0.2418, 0.0928, 0.52]
[test epoch 53/100] | loss 0.437 | nw acc 0.284 | time 0 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [268, 350, 166, 67] and [0.3149, 0.4113, 0.1951, 0.0787]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [90, 722, 242, 286] and [0.0672, 0.5388, 0.1806, 0.2134]
[train epoch 54/100] | loss 1.2453 | nw acc 0.494 | time 1 min 42 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [354, 820, 312, 455] and [0.1824, 0.4225, 0.1607, 0.2344]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [757, 1285, 486, 2786] and [0.1425, 0.2418, 0.0915, 0.5243]
[test epoch 54/100] | loss 0.427 | nw acc 0.319 | time 0 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [303, 462, 209, 101] and [0.2819, 0.4298, 0.1944, 0.094]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [55, 610, 199, 252] and [0.0493, 0.5466, 0.1783, 0.2258]
[train epoch 55/100] | loss 1.247 | nw acc 0.488 | time 1 min 45 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [353, 853, 317, 536] and [0.1714, 0.4143, 0.154, 0.2603]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [758, 1252, 481, 2705] and [0.1459, 0.241, 0.0926, 0.5206]
[test epoch 55/100] | loss 0.428 | nw acc 0.316 | time 0 min 32 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [283, 425, 198, 71] and [0.2897, 0.435, 0.2027, 0.0727]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [75, 647, 210, 282] and [0.0618, 0.5329, 0.173, 0.2323]
[train epoch 56/100] | loss 1.2497 | nw acc 0.489 | time 1 min 41 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [369, 866, 313, 536] and [0.1771, 0.4155, 0.1502, 0.2572]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [742, 1239, 485, 2705] and [0.1435, 0.2396, 0.0938, 0.5231]
[test epoch 56/100] | loss 0.427 | nw acc 0.317 | time 0 min 30 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [314, 463, 210, 107] and [0.287, 0.4232, 0.192, 0.0978]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [44, 609, 198, 246] and [0.0401, 0.5552, 0.1805, 0.2242]
[train epoch 57/100] | loss 1.2458 | nw acc 0.494 | time 1 min 45 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [348, 843, 283, 477] and [0.1784, 0.4321, 0.1451, 0.2445]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [763, 1262, 515, 2764] and [0.1439, 0.2379, 0.0971, 0.5211]
[test epoch 57/100] | loss 0.441 | nw acc 0.275 | time 0 min 29 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [276, 340, 154, 78] and [0.3255, 0.4009, 0.1816, 0.092]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [82, 732, 254, 275] and [0.0611, 0.545, 0.1891, 0.2048]
[train epoch 58/100] | loss 1.2477 | nw acc 0.49 | time 1 min 40 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [329, 809, 275, 478] and [0.174, 0.4278, 0.1454, 0.2528]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [782, 1296, 523, 2763] and [0.1458, 0.2416, 0.0975, 0.5151]
[test epoch 58/100] | loss 0.433 | nw acc 0.295 | time 0 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [278, 367, 179, 59] and [0.3148, 0.4156, 0.2027, 0.0668]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [80, 705, 229, 294] and [0.0612, 0.539, 0.1751, 0.2248]
[train epoch 59/100] | loss 1.2484 | nw acc 0.485 | time 1 min 41 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [351, 834, 289, 534] and [0.1748, 0.4153, 0.1439, 0.2659]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [760, 1271, 509, 2707] and [0.1448, 0.2422, 0.097, 0.5159]
[test epoch 59/100] | loss 0.432 | nw acc 0.298 | time 0 min 30 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [290, 383, 174, 69] and [0.3166, 0.4181, 0.19, 0.0753]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [68, 689, 234, 284] and [0.0533, 0.5404, 0.1835, 0.2227]
[train epoch 60/100] | loss 1.2443 | nw acc 0.494 | time 1 min 45 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [395, 869, 298, 508] and [0.1908, 0.4198, 0.144, 0.2454]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [716, 1236, 500, 2733] and [0.1381, 0.2384, 0.0964, 0.5271]
[test epoch 60/100] | loss 0.431 | nw acc 0.301 | time 0 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [288, 409, 187, 87] and [0.2966, 0.4212, 0.1926, 0.0896]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [70, 663, 221, 266] and [0.0574, 0.5434, 0.1811, 0.218]
[train epoch 61/100] | loss 1.2455 | nw acc 0.493 | time 1 min 41 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [365, 841, 282, 486] and [0.1849, 0.426, 0.1429, 0.2462]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [746, 1264, 516, 2755] and [0.1413, 0.2393, 0.0977, 0.5217]
[test epoch 61/100] | loss 0.431 | nw acc 0.304 | time 0 min 30 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [278, 392, 177, 65] and [0.3048, 0.4298, 0.1941, 0.0713]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [80, 680, 231, 288] and [0.0625, 0.5317, 0.1806, 0.2252]
[train epoch 62/100] | loss 1.2416 | nw acc 0.494 | time 1 min 45 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [361, 871, 305, 507] and [0.1766, 0.4261, 0.1492, 0.248]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [750, 1234, 493, 2734] and [0.1439, 0.2368, 0.0946, 0.5247]
[test epoch 62/100] | loss 0.428 | nw acc 0.323 | time 0 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [301, 465, 202, 95] and [0.2832, 0.4374, 0.19, 0.0894]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [57, 607, 206, 258] and [0.0505, 0.5381, 0.1826, 0.2287]
[train epoch 63/100] | loss 1.244 | nw acc 0.491 | time 1 min 42 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [354, 869, 303, 528] and [0.1723, 0.4231, 0.1475, 0.2571]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [757, 1236, 495, 2713] and [0.1455, 0.2376, 0.0952, 0.5216]
[test epoch 63/100] | loss 0.434 | nw acc 0.291 | time 0 min 31 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [281, 390, 185, 91] and [0.2967, 0.4118, 0.1954, 0.0961]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [77, 682, 223, 262] and [0.0619, 0.5482, 0.1793, 0.2106]
[train epoch 64/100] | loss 1.244 | nw acc 0.495 | time 1 min 44 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [360, 887, 316, 518] and [0.173, 0.4262, 0.1519, 0.2489]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [751, 1218, 482, 2723] and [0.1451, 0.2354, 0.0932, 0.5263]
[test epoch 64/100] | loss 0.439 | nw acc 0.287 | time 0 min 32 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [263, 342, 161, 53] and [0.3211, 0.4176, 0.1966, 0.0647]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [95, 730, 247, 300] and [0.0692, 0.5321, 0.18, 0.2187]
[train epoch 65/100] | loss 1.2412 | nw acc 0.499 | time 1 min 41 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [400, 884, 299, 482] and [0.1937, 0.4281, 0.1448, 0.2334]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [711, 1221, 499, 2759] and [0.137, 0.2353, 0.0961, 0.5316]
[test epoch 65/100] | loss 0.434 | nw acc 0.297 | time 0 min 32 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [286, 380, 189, 67] and [0.3102, 0.4121, 0.205, 0.0727]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [72, 692, 219, 286] and [0.0567, 0.5453, 0.1726, 0.2254]
[train epoch 66/100] | loss 1.2466 | nw acc 0.49 | time 1 min 45 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [353, 835, 308, 503] and [0.1766, 0.4177, 0.1541, 0.2516]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [758, 1270, 490, 2738] and [0.1442, 0.2416, 0.0932, 0.5209]
[test epoch 66/100] | loss 0.438 | nw acc 0.284 | time 0 min 32 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [269, 339, 151, 56] and [0.3301, 0.416, 0.1853, 0.0687]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [89, 733, 257, 297] and [0.0647, 0.5327, 0.1868, 0.2158]
