MaunaNet4Drop(
  (conv1): Conv2d(1, 3, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn1): BatchNorm2d(3, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (drop1): Dropout2d(p=0.2)
  (pool1): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv2): Conv2d(3, 64, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (drop2): Dropout2d(p=0.2)
  (pool2): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv3): Conv2d(64, 128, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn3): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (drop3): Dropout2d(p=0.2)
  (pool3): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv4): Conv2d(128, 256, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn4): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (drop4): Dropout2d(p=0.2)
  (pool4): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (avgpool): AvgPool2d(kernel_size=2, stride=2, padding=0)
  (fc1): Linear(in_features=256, out_features=4, bias=True)
  (softmax): Softmax()
)
train patients [42 40 24 53  2 55 22 17 29 18 51  8 14  5 19 43 15 46  7 45  1 34 13 44
 31  6 30 47 25 23 10 50 54  3  0]
train labels [1111 2105  798 3241]
test patients [41 48 35  4 11 32 36 12 49]
test labels [ 358 1072  408  353]

[train epoch 1/100] | loss 1.244 | nw acc 0.493 | time 1 min 32 sec
cat 0: [192, 36, 19, 160] and [0.4717, 0.0885, 0.0467, 0.3931]
cat 1: [211, 823, 293, 497] and [0.1157, 0.4512, 0.1606, 0.2725]
cat 2: [3, 6, 2, 7] and [0.1667, 0.3333, 0.1111, 0.3889]
cat 3: [705, 1240, 484, 2577] and [0.1408, 0.2477, 0.0967, 0.5148]
[test epoch 1/100] | loss 0.462 | nw acc 0.187 | time 0 min 29 sec
cat 0: [1, 3, 0, 0] and [0.25, 0.75, 0.0, 0.0]
cat 1: [30, 65, 9, 0] and [0.2885, 0.625, 0.0865, 0.0]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [327, 1004, 399, 353] and [0.157, 0.482, 0.1916, 0.1695]
[train epoch 2/100] | loss 1.1932 | nw acc 0.554 | time 1 min 53 sec
cat 0: [410, 43, 17, 213] and [0.6003, 0.063, 0.0249, 0.3119]
cat 1: [217, 1021, 292, 417] and [0.1115, 0.5244, 0.15, 0.2142]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [484, 1041, 489, 2611] and [0.1046, 0.2251, 0.1057, 0.5645]
[test epoch 2/100] | loss 0.413 | nw acc 0.387 | time 0 min 35 sec
cat 0: [64, 301, 46, 28] and [0.1458, 0.6856, 0.1048, 0.0638]
cat 1: [250, 533, 227, 56] and [0.2345, 0.5, 0.2129, 0.0525]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [44, 238, 135, 269] and [0.0641, 0.3469, 0.1968, 0.3921]
[train epoch 3/100] | loss 1.1627 | nw acc 0.584 | time 1 min 58 sec
cat 0: [515, 68, 54, 234] and [0.5913, 0.0781, 0.062, 0.2687]
cat 1: [212, 1143, 273, 403] and [0.1044, 0.5628, 0.1344, 0.1984]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [384, 894, 471, 2604] and [0.0882, 0.2054, 0.1082, 0.5982]
[test epoch 3/100] | loss 0.455 | nw acc 0.204 | time 0 min 36 sec
cat 0: [3, 6, 0, 2] and [0.2727, 0.5455, 0.0, 0.1818]
cat 1: [126, 106, 24, 4] and [0.4846, 0.4077, 0.0923, 0.0154]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [229, 960, 384, 347] and [0.1193, 0.5, 0.2, 0.1807]
[train epoch 4/100] | loss 1.1356 | nw acc 0.613 | time 1 min 58 sec
cat 0: [661, 97, 67, 240] and [0.6207, 0.0911, 0.0629, 0.2254]
cat 1: [149, 1208, 294, 398] and [0.0727, 0.5896, 0.1435, 0.1942]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [301, 800, 437, 2603] and [0.0727, 0.1932, 0.1055, 0.6286]
[test epoch 4/100] | loss 0.399 | nw acc 0.421 | time 0 min 35 sec
cat 0: [192, 168, 78, 20] and [0.4192, 0.3668, 0.1703, 0.0437]
cat 1: [96, 448, 147, 29] and [0.1333, 0.6222, 0.2042, 0.0403]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [70, 456, 183, 304] and [0.0691, 0.4501, 0.1807, 0.3001]
[train epoch 5/100] | loss 1.1133 | nw acc 0.638 | time 1 min 58 sec
cat 0: [729, 84, 92, 222] and [0.6469, 0.0745, 0.0816, 0.197]
cat 1: [107, 1259, 256, 353] and [0.0542, 0.6375, 0.1296, 0.1787]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [275, 762, 450, 2666] and [0.0662, 0.1835, 0.1084, 0.6419]
[test epoch 5/100] | loss 0.395 | nw acc 0.437 | time 0 min 36 sec
cat 0: [242, 304, 129, 43] and [0.337, 0.4234, 0.1797, 0.0599]
cat 1: [83, 470, 148, 43] and [0.1116, 0.6317, 0.1989, 0.0578]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [33, 298, 131, 267] and [0.0453, 0.4088, 0.1797, 0.3663]
[train epoch 6/100] | loss 1.0898 | nw acc 0.66 | time 1 min 56 sec
cat 0: [779, 99, 114, 211] and [0.6475, 0.0823, 0.0948, 0.1754]
cat 1: [98, 1353, 279, 349] and [0.0471, 0.6508, 0.1342, 0.1679]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [234, 653, 405, 2681] and [0.0589, 0.1644, 0.1019, 0.6748]
[test epoch 6/100] | loss 0.385 | nw acc 0.485 | time 0 min 35 sec
cat 0: [188, 128, 57, 28] and [0.4688, 0.3192, 0.1421, 0.0698]
cat 1: [123, 664, 212, 90] and [0.1129, 0.6097, 0.1947, 0.0826]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [47, 280, 139, 235] and [0.067, 0.3994, 0.1983, 0.3352]
[train epoch 7/100] | loss 1.0667 | nw acc 0.689 | time 1 min 56 sec
cat 0: [859, 100, 101, 169] and [0.6989, 0.0814, 0.0822, 0.1375]
cat 1: [78, 1422, 248, 328] and [0.0376, 0.685, 0.1195, 0.158]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [174, 583, 449, 2744] and [0.0441, 0.1476, 0.1137, 0.6947]
[test epoch 7/100] | loss 0.392 | nw acc 0.458 | time 0 min 34 sec
cat 0: [156, 69, 32, 7] and [0.5909, 0.2614, 0.1212, 0.0265]
cat 1: [166, 598, 232, 73] and [0.1553, 0.5594, 0.217, 0.0683]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [36, 405, 144, 273] and [0.042, 0.472, 0.1678, 0.3182]
[train epoch 8/100] | loss 1.0525 | nw acc 0.7 | time 1 min 56 sec
cat 0: [862, 81, 112, 165] and [0.7066, 0.0664, 0.0918, 0.1352]
cat 1: [88, 1507, 272, 340] and [0.0399, 0.6828, 0.1232, 0.1541]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [161, 517, 414, 2736] and [0.0421, 0.1351, 0.1082, 0.7147]
[test epoch 8/100] | loss 0.384 | nw acc 0.488 | time 0 min 35 sec
cat 0: [137, 43, 24, 17] and [0.6199, 0.1946, 0.1086, 0.0769]
cat 1: [183, 717, 257, 97] and [0.1459, 0.5718, 0.2049, 0.0774]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [38, 312, 127, 239] and [0.0531, 0.4358, 0.1774, 0.3338]
[train epoch 9/100] | loss 1.038 | nw acc 0.714 | time 1 min 56 sec
cat 0: [862, 77, 102, 165] and [0.7148, 0.0638, 0.0846, 0.1368]
cat 1: [75, 1530, 285, 257] and [0.0349, 0.7126, 0.1327, 0.1197]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [174, 498, 411, 2819] and [0.0446, 0.1276, 0.1053, 0.7225]
[test epoch 9/100] | loss 0.398 | nw acc 0.422 | time 0 min 35 sec
cat 0: [161, 53, 7, 6] and [0.7093, 0.2335, 0.0308, 0.0264]
cat 1: [107, 521, 214, 83] and [0.1157, 0.5632, 0.2314, 0.0897]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [90, 498, 187, 264] and [0.0866, 0.4793, 0.18, 0.2541]
[train epoch 10/100] | loss 1.0327 | nw acc 0.716 | time 1 min 58 sec
cat 0: [860, 71, 101, 152] and [0.7264, 0.06, 0.0853, 0.1284]
cat 1: [77, 1549, 248, 276] and [0.0358, 0.7205, 0.1153, 0.1284]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [174, 485, 449, 2813] and [0.0444, 0.1237, 0.1145, 0.7174]
[test epoch 10/100] | loss 0.391 | nw acc 0.463 | time 0 min 35 sec
cat 0: [174, 91, 24, 13] and [0.5762, 0.3013, 0.0795, 0.043]
cat 1: [142, 759, 318, 237] and [0.0975, 0.5213, 0.2184, 0.1628]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [42, 222, 66, 103] and [0.097, 0.5127, 0.1524, 0.2379]
[train epoch 11/100] | loss 1.0132 | nw acc 0.737 | time 2 min 1 sec
cat 0: [917, 65, 98, 119] and [0.7648, 0.0542, 0.0817, 0.0992]
cat 1: [71, 1616, 254, 275] and [0.032, 0.7292, 0.1146, 0.1241]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [123, 424, 446, 2847] and [0.032, 0.1104, 0.1161, 0.7414]
[test epoch 11/100] | loss 0.391 | nw acc 0.458 | time 0 min 35 sec
cat 0: [126, 35, 4, 2] and [0.7545, 0.2096, 0.024, 0.012]
cat 1: [175, 600, 262, 51] and [0.1608, 0.5515, 0.2408, 0.0469]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [57, 437, 142, 300] and [0.0609, 0.4669, 0.1517, 0.3205]
[train epoch 12/100] | loss 1.0058 | nw acc 0.745 | time 1 min 58 sec
cat 0: [916, 78, 115, 135] and [0.7363, 0.0627, 0.0924, 0.1085]
cat 1: [72, 1662, 242, 249] and [0.0324, 0.747, 0.1088, 0.1119]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [123, 365, 441, 2857] and [0.0325, 0.0964, 0.1165, 0.7546]
[test epoch 12/100] | loss 0.415 | nw acc 0.366 | time 0 min 34 sec
cat 0: [219, 95, 28, 19] and [0.6066, 0.2632, 0.0776, 0.0526]
cat 1: [56, 311, 207, 45] and [0.0905, 0.5024, 0.3344, 0.0727]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [83, 666, 173, 289] and [0.0685, 0.55, 0.1429, 0.2386]
[train epoch 13/100] | loss 0.99889 | nw acc 0.752 | time 1 min 57 sec
cat 0: [923, 76, 95, 98] and [0.7743, 0.0638, 0.0797, 0.0822]
cat 1: [70, 1654, 247, 231] and [0.0318, 0.7511, 0.1122, 0.1049]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [118, 375, 456, 2912] and [0.0306, 0.0971, 0.1181, 0.7542]
[test epoch 13/100] | loss 0.383 | nw acc 0.493 | time 0 min 33 sec
cat 0: [125, 25, 0, 4] and [0.8117, 0.1623, 0.0, 0.026]
cat 1: [197, 816, 358, 186] and [0.1265, 0.5241, 0.2299, 0.1195]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [36, 231, 50, 163] and [0.075, 0.4813, 0.1042, 0.3396]
[train epoch 14/100] | loss 0.9882 | nw acc 0.762 | time 1 min 57 sec
cat 0: [939, 62, 99, 112] and [0.7748, 0.0512, 0.0817, 0.0924]
cat 1: [55, 1709, 265, 216] and [0.0245, 0.7612, 0.118, 0.0962]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [117, 334, 434, 2913] and [0.0308, 0.0879, 0.1143, 0.767]
[test epoch 14/100] | loss 0.389 | nw acc 0.468 | time 0 min 34 sec
cat 0: [153, 55, 5, 8] and [0.6923, 0.2489, 0.0226, 0.0362]
cat 1: [168, 766, 345, 216] and [0.1124, 0.5124, 0.2308, 0.1445]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [37, 251, 58, 129] and [0.0779, 0.5284, 0.1221, 0.2716]
[train epoch 15/100] | loss 0.98268 | nw acc 0.768 | time 1 min 59 sec
cat 0: [945, 52, 83, 87] and [0.8098, 0.0446, 0.0711, 0.0746]
cat 1: [53, 1708, 240, 205] and [0.024, 0.7743, 0.1088, 0.0929]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [113, 345, 475, 2949] and [0.0291, 0.0889, 0.1224, 0.7597]
[test epoch 15/100] | loss 0.396 | nw acc 0.438 | time 0 min 35 sec
cat 0: [225, 166, 46, 36] and [0.4757, 0.351, 0.0973, 0.0761]
cat 1: [79, 506, 258, 67] and [0.0868, 0.556, 0.2835, 0.0736]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [54, 400, 104, 250] and [0.0668, 0.495, 0.1287, 0.3094]
[train epoch 16/100] | loss 0.97461 | nw acc 0.775 | time 1 min 57 sec
cat 0: [957, 57, 81, 91] and [0.8069, 0.0481, 0.0683, 0.0767]
cat 1: [58, 1758, 249, 210] and [0.0255, 0.7727, 0.1095, 0.0923]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [96, 290, 468, 2940] and [0.0253, 0.0764, 0.1234, 0.7749]
[test epoch 16/100] | loss 0.388 | nw acc 0.475 | time 0 min 33 sec
cat 0: [192, 67, 6, 3] and [0.7164, 0.25, 0.0224, 0.0112]
cat 1: [106, 622, 290, 100] and [0.0948, 0.5564, 0.2594, 0.0894]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [60, 383, 112, 250] and [0.0745, 0.4758, 0.1391, 0.3106]
[train epoch 17/100] | loss 0.96983 | nw acc 0.78 | time 1 min 55 sec
cat 0: [958, 50, 73, 92] and [0.8167, 0.0426, 0.0622, 0.0784]
cat 1: [52, 1801, 260, 214] and [0.0223, 0.774, 0.1117, 0.092]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [101, 254, 465, 2935] and [0.0269, 0.0676, 0.1238, 0.7816]
[test epoch 17/100] | loss 0.4 | nw acc 0.422 | time 0 min 35 sec
cat 0: [175, 46, 7, 6] and [0.7479, 0.1966, 0.0299, 0.0256]
cat 1: [80, 483, 259, 59] and [0.0908, 0.5482, 0.294, 0.067]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [103, 543, 142, 288] and [0.0957, 0.5046, 0.132, 0.2677]
[train epoch 18/100] | loss 0.96105 | nw acc 0.787 | time 1 min 55 sec
cat 0: [969, 52, 99, 81] and [0.8068, 0.0433, 0.0824, 0.0674]
cat 1: [48, 1807, 253, 192] and [0.0209, 0.7857, 0.11, 0.0835]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [94, 246, 446, 2968] and [0.025, 0.0655, 0.1188, 0.7906]
[test epoch 18/100] | loss 0.392 | nw acc 0.456 | time 0 min 38 sec
cat 0: [225, 180, 28, 25] and [0.4913, 0.393, 0.0611, 0.0546]
cat 1: [100, 631, 313, 163] and [0.0829, 0.5228, 0.2593, 0.135]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [33, 261, 67, 165] and [0.0627, 0.4962, 0.1274, 0.3137]
[train epoch 19/100] | loss 0.95898 | nw acc 0.792 | time 2 min 4 sec
cat 0: [1008, 45, 94, 80] and [0.8215, 0.0367, 0.0766, 0.0652]
cat 1: [33, 1807, 256, 194] and [0.0144, 0.7891, 0.1118, 0.0847]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [70, 253, 448, 2967] and [0.0187, 0.0677, 0.1199, 0.7937]
[test epoch 19/100] | loss 0.425 | nw acc 0.332 | time 0 min 34 sec
cat 0: [192, 107, 23, 6] and [0.5854, 0.3262, 0.0701, 0.0183]
cat 1: [49, 224, 164, 20] and [0.1072, 0.4902, 0.3589, 0.0438]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [117, 741, 221, 327] and [0.0832, 0.527, 0.1572, 0.2326]
[train epoch 20/100] | loss 0.9488 | nw acc 0.802 | time 1 min 57 sec
cat 0: [1015, 39, 81, 56] and [0.8522, 0.0327, 0.068, 0.047]
cat 1: [33, 1828, 240, 173] and [0.0145, 0.8039, 0.1055, 0.0761]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [63, 238, 477, 3012] and [0.0166, 0.0628, 0.1259, 0.7947]
[test epoch 20/100] | loss 0.39 | nw acc 0.457 | time 0 min 35 sec
cat 0: [176, 81, 11, 3] and [0.6494, 0.2989, 0.0406, 0.0111]
cat 1: [90, 585, 294, 87] and [0.0852, 0.554, 0.2784, 0.0824]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [92, 406, 103, 263] and [0.1065, 0.4699, 0.1192, 0.3044]
[train epoch 21/100] | loss 0.94871 | nw acc 0.801 | time 1 min 57 sec
cat 0: [992, 45, 85, 76] and [0.828, 0.0376, 0.071, 0.0634]
cat 1: [52, 1861, 263, 173] and [0.0221, 0.7923, 0.112, 0.0736]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [67, 199, 450, 2992] and [0.0181, 0.0537, 0.1214, 0.8069]
[test epoch 21/100] | loss 0.395 | nw acc 0.448 | time 0 min 35 sec
cat 0: [170, 100, 8, 2] and [0.6071, 0.3571, 0.0286, 0.0071]
cat 1: [124, 570, 291, 88] and [0.1156, 0.5312, 0.2712, 0.082]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [64, 402, 109, 263] and [0.0764, 0.4797, 0.1301, 0.3138]
[train epoch 22/100] | loss 0.94115 | nw acc 0.807 | time 1 min 59 sec
cat 0: [996, 35, 89, 75] and [0.8335, 0.0293, 0.0745, 0.0628]
cat 1: [43, 1873, 253, 150] and [0.0185, 0.8077, 0.1091, 0.0647]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [72, 197, 456, 3016] and [0.0192, 0.0527, 0.1219, 0.8062]
[test epoch 22/100] | loss 0.381 | nw acc 0.499 | time 0 min 35 sec
cat 0: [193, 198, 9, 14] and [0.4662, 0.4783, 0.0217, 0.0338]
cat 1: [120, 744, 349, 159] and [0.0875, 0.5423, 0.2544, 0.1159]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [45, 130, 50, 180] and [0.1111, 0.321, 0.1235, 0.4444]
[train epoch 23/100] | loss 0.94045 | nw acc 0.809 | time 1 min 56 sec
cat 0: [999, 26, 103, 60] and [0.8409, 0.0219, 0.0867, 0.0505]
cat 1: [37, 1859, 268, 138] and [0.0161, 0.8076, 0.1164, 0.0599]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [75, 220, 427, 3043] and [0.0199, 0.0584, 0.1134, 0.8082]
[test epoch 23/100] | loss 0.379 | nw acc 0.502 | time 0 min 35 sec
cat 0: [172, 142, 8, 7] and [0.5228, 0.4316, 0.0243, 0.0213]
cat 1: [157, 738, 329, 131] and [0.1159, 0.5446, 0.2428, 0.0967]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [29, 192, 71, 215] and [0.0572, 0.3787, 0.14, 0.4241]
[train epoch 24/100] | loss 0.93404 | nw acc 0.815 | time 1 min 58 sec
cat 0: [1007, 30, 84, 48] and [0.8614, 0.0257, 0.0719, 0.0411]
cat 1: [37, 1890, 253, 144] and [0.0159, 0.8133, 0.1089, 0.062]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [67, 185, 461, 3049] and [0.0178, 0.0492, 0.1225, 0.8105]
[test epoch 24/100] | loss 0.396 | nw acc 0.446 | time 0 min 39 sec
cat 0: [189, 163, 18, 13] and [0.4935, 0.4256, 0.047, 0.0339]
cat 1: [136, 554, 299, 83] and [0.1269, 0.5168, 0.2789, 0.0774]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [33, 355, 91, 257] and [0.0448, 0.4823, 0.1236, 0.3492]
[train epoch 25/100] | loss 0.93143 | nw acc 0.819 | time 1 min 57 sec
cat 0: [1023, 29, 89, 60] and [0.8518, 0.0241, 0.0741, 0.05]
cat 1: [32, 1901, 248, 131] and [0.0138, 0.8222, 0.1073, 0.0567]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [56, 175, 461, 3050] and [0.015, 0.0468, 0.1232, 0.8151]
[test epoch 25/100] | loss 0.403 | nw acc 0.426 | time 0 min 36 sec
cat 0: [209, 248, 33, 29] and [0.4027, 0.4778, 0.0636, 0.0559]
cat 1: [106, 507, 286, 85] and [0.1077, 0.5152, 0.2907, 0.0864]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [43, 317, 89, 239] and [0.0625, 0.4608, 0.1294, 0.3474]
[train epoch 26/100] | loss 0.92574 | nw acc 0.823 | time 1 min 56 sec
cat 0: [1026, 30, 84, 46] and [0.8651, 0.0253, 0.0708, 0.0388]
cat 1: [36, 1899, 256, 116] and [0.0156, 0.8231, 0.111, 0.0503]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [49, 176, 458, 3079] and [0.013, 0.0468, 0.1217, 0.8184]
[test epoch 26/100] | loss 0.397 | nw acc 0.438 | time 0 min 35 sec
cat 0: [137, 37, 1, 3] and [0.7697, 0.2079, 0.0056, 0.0169]
cat 1: [108, 608, 323, 115] and [0.0936, 0.5269, 0.2799, 0.0997]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [113, 427, 84, 235] and [0.1315, 0.4971, 0.0978, 0.2736]
[train epoch 27/100] | loss 0.92807 | nw acc 0.821 | time 1 min 59 sec
cat 0: [1018, 26, 76, 46] and [0.8731, 0.0223, 0.0652, 0.0395]
cat 1: [39, 1901, 269, 123] and [0.0167, 0.8152, 0.1154, 0.0527]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [54, 178, 453, 3072] and [0.0144, 0.0474, 0.1206, 0.8177]
[test epoch 27/100] | loss 0.413 | nw acc 0.391 | time 0 min 35 sec
cat 0: [218, 167, 27, 16] and [0.5093, 0.3902, 0.0631, 0.0374]
cat 1: [47, 397, 261, 77] and [0.0601, 0.5077, 0.3338, 0.0985]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [93, 508, 120, 260] and [0.0948, 0.5178, 0.1223, 0.265]
[train epoch 28/100] | loss 0.92079 | nw acc 0.828 | time 1 min 57 sec
cat 0: [1023, 13, 72, 41] and [0.8903, 0.0113, 0.0627, 0.0357]
cat 1: [41, 1938, 280, 121] and [0.0172, 0.8143, 0.1176, 0.0508]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [47, 154, 446, 3079] and [0.0126, 0.0413, 0.1197, 0.8264]
[test epoch 28/100] | loss 0.393 | nw acc 0.454 | time 0 min 35 sec
cat 0: [155, 47, 2, 3] and [0.7488, 0.2271, 0.0097, 0.0145]
cat 1: [96, 607, 325, 94] and [0.0856, 0.541, 0.2897, 0.0838]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [107, 418, 81, 256] and [0.1241, 0.4849, 0.094, 0.297]
[train epoch 29/100] | loss 0.91877 | nw acc 0.828 | time 1 min 58 sec
cat 0: [1031, 25, 65, 51] and [0.8797, 0.0213, 0.0555, 0.0435]
cat 1: [29, 1927, 257, 108] and [0.0125, 0.8302, 0.1107, 0.0465]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [51, 153, 476, 3082] and [0.0136, 0.0407, 0.1265, 0.8192]
[test epoch 29/100] | loss 0.393 | nw acc 0.46 | time 0 min 34 sec
cat 0: [216, 120, 9, 14] and [0.6017, 0.3343, 0.0251, 0.039]
cat 1: [66, 531, 294, 55] and [0.0698, 0.5613, 0.3108, 0.0581]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [76, 421, 105, 284] and [0.0858, 0.4752, 0.1185, 0.3205]
[train epoch 30/100] | loss 0.92283 | nw acc 0.824 | time 1 min 56 sec
cat 0: [1015, 24, 73, 54] and [0.8705, 0.0206, 0.0626, 0.0463]
cat 1: [34, 1929, 281, 117] and [0.0144, 0.817, 0.119, 0.0496]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [62, 152, 444, 3070] and [0.0166, 0.0408, 0.1191, 0.8235]
[test epoch 30/100] | loss 0.396 | nw acc 0.445 | time 0 min 37 sec
cat 0: [180, 151, 10, 4] and [0.5217, 0.4377, 0.029, 0.0116]
cat 1: [112, 532, 310, 65] and [0.1099, 0.5221, 0.3042, 0.0638]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [66, 389, 88, 284] and [0.0798, 0.4704, 0.1064, 0.3434]
[train epoch 31/100] | loss 0.91161 | nw acc 0.837 | time 2 min 2 sec
cat 0: [1042, 16, 60, 39] and [0.9006, 0.0138, 0.0519, 0.0337]
cat 1: [30, 1967, 276, 103] and [0.0126, 0.8279, 0.1162, 0.0434]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [39, 122, 462, 3099] and [0.0105, 0.0328, 0.1241, 0.8326]
[test epoch 31/100] | loss 0.397 | nw acc 0.445 | time 0 min 34 sec
cat 0: [162, 149, 6, 5] and [0.5031, 0.4627, 0.0186, 0.0155]
cat 1: [120, 632, 333, 146] and [0.0975, 0.5134, 0.2705, 0.1186]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [76, 291, 69, 202] and [0.1191, 0.4561, 0.1082, 0.3166]
[train epoch 32/100] | loss 0.91515 | nw acc 0.835 | time 1 min 55 sec
cat 0: [1042, 25, 59, 27] and [0.9037, 0.0217, 0.0512, 0.0234]
cat 1: [23, 1924, 260, 87] and [0.01, 0.8387, 0.1133, 0.0379]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [46, 156, 479, 3127] and [0.0121, 0.041, 0.1258, 0.8212]
[test epoch 32/100] | loss 0.385 | nw acc 0.482 | time 0 min 35 sec
cat 0: [208, 112, 8, 9] and [0.6172, 0.3323, 0.0237, 0.0267]
cat 1: [106, 694, 339, 166] and [0.0812, 0.5318, 0.2598, 0.1272]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [44, 266, 61, 178] and [0.0801, 0.4845, 0.1111, 0.3242]
[train epoch 33/100] | loss 0.9169 | nw acc 0.83 | time 1 min 55 sec
cat 0: [1028, 20, 67, 43] and [0.8877, 0.0173, 0.0579, 0.0371]
cat 1: [26, 1945, 291, 113] and [0.0109, 0.8189, 0.1225, 0.0476]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [57, 140, 440, 3085] and [0.0153, 0.0376, 0.1182, 0.8289]
[test epoch 33/100] | loss 0.388 | nw acc 0.47 | time 0 min 35 sec
cat 0: [171, 88, 2, 6] and [0.6404, 0.3296, 0.0075, 0.0225]
cat 1: [117, 708, 348, 174] and [0.0869, 0.5256, 0.2584, 0.1292]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [70, 276, 58, 173] and [0.1213, 0.4783, 0.1005, 0.2998]
[train epoch 34/100] | loss 0.90582 | nw acc 0.841 | time 1 min 55 sec
cat 0: [1057, 24, 74, 29] and [0.8927, 0.0203, 0.0625, 0.0245]
cat 1: [23, 1963, 286, 96] and [0.0097, 0.829, 0.1208, 0.0405]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [31, 118, 438, 3116] and [0.0084, 0.0319, 0.1183, 0.8415]
[test epoch 34/100] | loss 0.387 | nw acc 0.477 | time 0 min 34 sec
cat 0: [209, 98, 6, 8] and [0.6511, 0.3053, 0.0187, 0.0249]
cat 1: [63, 623, 325, 108] and [0.0563, 0.5567, 0.2904, 0.0965]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [86, 351, 77, 237] and [0.1145, 0.4674, 0.1025, 0.3156]
[train epoch 35/100] | loss 0.90416 | nw acc 0.843 | time 1 min 57 sec
cat 0: [1045, 23, 84, 30] and [0.8841, 0.0195, 0.0711, 0.0254]
cat 1: [19, 1988, 267, 93] and [0.008, 0.8399, 0.1128, 0.0393]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [47, 94, 447, 3118] and [0.0127, 0.0254, 0.1206, 0.8413]
[test epoch 35/100] | loss 0.4 | nw acc 0.429 | time 0 min 34 sec
cat 0: [197, 236, 14, 10] and [0.4311, 0.5164, 0.0306, 0.0219]
cat 1: [75, 536, 322, 116] and [0.0715, 0.511, 0.307, 0.1106]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [86, 300, 72, 227] and [0.1255, 0.438, 0.1051, 0.3314]
[train epoch 36/100] | loss 0.90425 | nw acc 0.844 | time 2 min 5 sec
cat 0: [1043, 18, 72, 35] and [0.893, 0.0154, 0.0616, 0.03]
cat 1: [17, 1986, 292, 78] and [0.0072, 0.8369, 0.1231, 0.0329]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [51, 101, 434, 3128] and [0.0137, 0.0272, 0.1169, 0.8422]
[test epoch 36/100] | loss 0.385 | nw acc 0.486 | time 0 min 36 sec
cat 0: [217, 168, 7, 14] and [0.5345, 0.4138, 0.0172, 0.0345]
cat 1: [97, 704, 354, 171] and [0.0732, 0.5309, 0.267, 0.129]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [44, 200, 47, 168] and [0.0959, 0.4357, 0.1024, 0.366]
[train epoch 37/100] | loss 0.88837 | nw acc 0.863 | time 1 min 56 sec
cat 0: [1033, 18, 38, 23] and [0.929, 0.0162, 0.0342, 0.0207]
cat 1: [18, 1920, 194, 62] and [0.0082, 0.8751, 0.0884, 0.0283]
cat 2: [15, 63, 258, 74] and [0.0366, 0.1537, 0.6293, 0.1805]
cat 3: [45, 104, 308, 3082] and [0.0127, 0.0294, 0.087, 0.8709]
[test epoch 37/100] | loss 0.399 | nw acc 0.427 | time 0 min 35 sec
cat 0: [118, 89, 3, 0] and [0.5619, 0.4238, 0.0143, 0.0]
cat 1: [98, 598, 315, 93] and [0.0888, 0.5417, 0.2853, 0.0842]
cat 2: [82, 118, 23, 43] and [0.3083, 0.4436, 0.0865, 0.1617]
cat 3: [60, 267, 67, 217] and [0.0982, 0.437, 0.1097, 0.3552]
[train epoch 38/100] | loss 0.87805 | nw acc 0.873 | time 1 min 57 sec
cat 0: [1028, 25, 46, 38] and [0.9041, 0.022, 0.0405, 0.0334]
cat 1: [24, 1902, 140, 74] and [0.0112, 0.8888, 0.0654, 0.0346]
cat 2: [19, 72, 397, 87] and [0.033, 0.1252, 0.6904, 0.1513]
cat 3: [40, 106, 215, 3042] and [0.0118, 0.0311, 0.0632, 0.8939]
[test epoch 38/100] | loss 0.394 | nw acc 0.446 | time 0 min 37 sec
cat 0: [190, 177, 10, 7] and [0.4948, 0.4609, 0.026, 0.0182]
cat 1: [58, 505, 277, 54] and [0.0649, 0.5649, 0.3098, 0.0604]
cat 2: [19, 95, 37, 26] and [0.1073, 0.5367, 0.209, 0.1469]
cat 3: [91, 295, 84, 266] and [0.1236, 0.4008, 0.1141, 0.3614]
[train epoch 39/100] | loss 0.86012 | nw acc 0.892 | time 1 min 59 sec
cat 0: [1026, 16, 39, 23] and [0.9293, 0.0145, 0.0353, 0.0208]
cat 1: [16, 1950, 117, 68] and [0.0074, 0.9066, 0.0544, 0.0316]
cat 2: [22, 54, 464, 85] and [0.0352, 0.0864, 0.7424, 0.136]
cat 3: [47, 85, 178, 3065] and [0.0139, 0.0252, 0.0527, 0.9081]
[test epoch 39/100] | loss 0.409 | nw acc 0.382 | time 0 min 34 sec
cat 0: [164, 82, 2, 1] and [0.6586, 0.3293, 0.008, 0.004]
cat 1: [49, 407, 266, 73] and [0.0616, 0.5119, 0.3346, 0.0918]
cat 2: [89, 367, 98, 92] and [0.1378, 0.5681, 0.1517, 0.1424]
cat 3: [56, 216, 42, 187] and [0.1118, 0.4311, 0.0838, 0.3733]
[train epoch 40/100] | loss 0.84966 | nw acc 0.903 | time 1 min 58 sec
cat 0: [1028, 20, 36, 25] and [0.927, 0.018, 0.0325, 0.0225]
cat 1: [19, 1953, 82, 63] and [0.009, 0.9225, 0.0387, 0.0298]
cat 2: [19, 56, 538, 87] and [0.0271, 0.08, 0.7686, 0.1243]
cat 3: [45, 76, 142, 3066] and [0.0135, 0.0228, 0.0427, 0.921]
[test epoch 40/100] | loss 0.417 | nw acc 0.362 | time 0 min 35 sec
cat 0: [131, 80, 0, 3] and [0.6121, 0.3738, 0.0, 0.014]
cat 1: [39, 373, 201, 90] and [0.0555, 0.5306, 0.2859, 0.128]
cat 2: [99, 508, 192, 145] and [0.1049, 0.5381, 0.2034, 0.1536]
cat 3: [89, 111, 15, 115] and [0.2697, 0.3364, 0.0455, 0.3485]
[train epoch 41/100] | loss 0.84685 | nw acc 0.904 | time 1 min 55 sec
cat 0: [1025, 11, 28, 26] and [0.9404, 0.0101, 0.0257, 0.0239]
cat 1: [22, 1947, 80, 61] and [0.0104, 0.9227, 0.0379, 0.0289]
cat 2: [19, 42, 551, 80] and [0.0275, 0.0607, 0.7962, 0.1156]
cat 3: [45, 105, 139, 3074] and [0.0134, 0.0312, 0.0413, 0.9141]
[test epoch 41/100] | loss 0.411 | nw acc 0.375 | time 0 min 37 sec
cat 0: [145, 103, 2, 11] and [0.5556, 0.3946, 0.0077, 0.0421]
cat 1: [52, 421, 263, 86] and [0.0633, 0.5122, 0.32, 0.1046]
cat 2: [110, 498, 135, 117] and [0.1279, 0.5791, 0.157, 0.136]
cat 3: [51, 50, 8, 139] and [0.2056, 0.2016, 0.0323, 0.5605]
[train epoch 42/100] | loss 0.83188 | nw acc 0.92 | time 1 min 58 sec
cat 0: [1041, 15, 17, 21] and [0.9516, 0.0137, 0.0155, 0.0192]
cat 1: [15, 1971, 70, 56] and [0.0071, 0.9332, 0.0331, 0.0265]
cat 2: [12, 37, 597, 61] and [0.017, 0.0523, 0.8444, 0.0863]
cat 3: [43, 82, 114, 3103] and [0.0129, 0.0245, 0.0341, 0.9285]
[test epoch 42/100] | loss 0.418 | nw acc 0.356 | time 0 min 36 sec
cat 0: [159, 117, 3, 15] and [0.5408, 0.398, 0.0102, 0.051]
cat 1: [36, 351, 227, 82] and [0.0517, 0.5043, 0.3261, 0.1178]
cat 2: [104, 537, 167, 136] and [0.1102, 0.5689, 0.1769, 0.1441]
cat 3: [59, 67, 11, 120] and [0.2296, 0.2607, 0.0428, 0.4669]
[train epoch 43/100] | loss 0.82921 | nw acc 0.922 | time 1 min 59 sec
cat 0: [1039, 11, 32, 16] and [0.9463, 0.01, 0.0291, 0.0146]
cat 1: [11, 1971, 49, 63] and [0.0053, 0.9413, 0.0234, 0.0301]
cat 2: [14, 39, 616, 63] and [0.0191, 0.0533, 0.8415, 0.0861]
cat 3: [47, 84, 101, 3099] and [0.0141, 0.0252, 0.0303, 0.9304]
[test epoch 43/100] | loss 0.424 | nw acc 0.342 | time 0 min 35 sec
cat 0: [152, 130, 5, 9] and [0.5135, 0.4392, 0.0169, 0.0304]
cat 1: [72, 507, 308, 97] and [0.0732, 0.5152, 0.313, 0.0986]
cat 2: [97, 424, 94, 233] and [0.1144, 0.5, 0.1108, 0.2748]
cat 3: [37, 11, 1, 14] and [0.5873, 0.1746, 0.0159, 0.2222]
[train epoch 44/100] | loss 0.82012 | nw acc 0.93 | time 1 min 59 sec
cat 0: [1037, 10, 22, 22] and [0.9505, 0.0092, 0.0202, 0.0202]
cat 1: [18, 1993, 38, 64] and [0.0085, 0.9432, 0.018, 0.0303]
cat 2: [11, 30, 654, 53] and [0.0147, 0.0401, 0.8743, 0.0709]
cat 3: [45, 72, 84, 3102] and [0.0136, 0.0218, 0.0254, 0.9391]
[test epoch 44/100] | loss 0.418 | nw acc 0.36 | time 0 min 34 sec
cat 0: [127, 65, 1, 4] and [0.6447, 0.3299, 0.0051, 0.0203]
cat 1: [57, 512, 325, 119] and [0.0563, 0.5054, 0.3208, 0.1175]
cat 2: [102, 432, 78, 141] and [0.1355, 0.5737, 0.1036, 0.1873]
cat 3: [72, 63, 4, 89] and [0.3158, 0.2763, 0.0175, 0.3904]
[train epoch 45/100] | loss 0.82165 | nw acc 0.931 | time 1 min 56 sec
cat 0: [1031, 16, 13, 20] and [0.9546, 0.0148, 0.012, 0.0185]
cat 1: [21, 1971, 49, 56] and [0.01, 0.9399, 0.0234, 0.0267]
cat 2: [9, 33, 664, 42] and [0.012, 0.0441, 0.8877, 0.0561]
cat 3: [50, 85, 72, 3123] and [0.015, 0.0255, 0.0216, 0.9378]
[test epoch 45/100] | loss 0.415 | nw acc 0.375 | time 0 min 34 sec
cat 0: [159, 139, 3, 8] and [0.5146, 0.4498, 0.0097, 0.0259]
cat 1: [45, 444, 303, 82] and [0.0515, 0.508, 0.3467, 0.0938]
cat 2: [90, 289, 64, 91] and [0.1685, 0.5412, 0.1199, 0.1704]
cat 3: [64, 200, 38, 172] and [0.135, 0.4219, 0.0802, 0.3629]
[train epoch 46/100] | loss 0.81462 | nw acc 0.938 | time 2 min 0 sec
cat 0: [1049, 11, 18, 27] and [0.9493, 0.01, 0.0163, 0.0244]
cat 1: [18, 1997, 45, 53] and [0.0085, 0.9451, 0.0213, 0.0251]
cat 2: [12, 22, 671, 31] and [0.0163, 0.0299, 0.9117, 0.0421]
cat 3: [32, 75, 64, 3130] and [0.0097, 0.0227, 0.0194, 0.9482]
[test epoch 46/100] | loss 0.423 | nw acc 0.347 | time 0 min 34 sec
cat 0: [97, 66, 0, 4] and [0.5808, 0.3952, 0.0, 0.024]
cat 1: [37, 395, 264, 59] and [0.049, 0.5232, 0.3497, 0.0781]
cat 2: [138, 421, 98, 103] and [0.1816, 0.5539, 0.1289, 0.1355]
cat 3: [86, 190, 46, 187] and [0.169, 0.3733, 0.0904, 0.3674]
[train epoch 47/100] | loss 0.81329 | nw acc 0.936 | time 1 min 55 sec
cat 0: [1052, 10, 13, 19] and [0.9616, 0.0091, 0.0119, 0.0174]
cat 1: [19, 1985, 44, 53] and [0.009, 0.9448, 0.0209, 0.0252]
cat 2: [9, 25, 668, 45] and [0.012, 0.0335, 0.8942, 0.0602]
cat 3: [31, 85, 73, 3124] and [0.0094, 0.0257, 0.022, 0.943]
[test epoch 47/100] | loss 0.407 | nw acc 0.406 | time 0 min 37 sec
cat 0: [112, 61, 1, 2] and [0.6364, 0.3466, 0.0057, 0.0114]
cat 1: [102, 701, 366, 244] and [0.0722, 0.4961, 0.259, 0.1727]
cat 2: [108, 256, 34, 44] and [0.2443, 0.5792, 0.0769, 0.0995]
cat 3: [36, 54, 7, 63] and [0.225, 0.3375, 0.0437, 0.3937]
[train epoch 48/100] | loss 0.80805 | nw acc 0.942 | time 1 min 57 sec
cat 0: [1050, 16, 13, 26] and [0.9502, 0.0145, 0.0118, 0.0235]
cat 1: [24, 2000, 42, 58] and [0.0113, 0.9416, 0.0198, 0.0273]
cat 2: [5, 20, 690, 25] and [0.0068, 0.027, 0.9324, 0.0338]
cat 3: [32, 69, 53, 3132] and [0.0097, 0.021, 0.0161, 0.9531]
[test epoch 48/100] | loss 0.411 | nw acc 0.389 | time 0 min 35 sec
cat 0: [154, 156, 3, 8] and [0.4798, 0.486, 0.0093, 0.0249]
cat 1: [86, 548, 331, 177] and [0.0753, 0.4799, 0.2898, 0.155]
cat 2: [74, 274, 50, 49] and [0.1655, 0.613, 0.1119, 0.1096]
cat 3: [44, 94, 24, 119] and [0.1566, 0.3345, 0.0854, 0.4235]
[train epoch 49/100] | loss 0.8057 | nw acc 0.944 | time 2 min 1 sec
cat 0: [1042, 8, 12, 12] and [0.9702, 0.0074, 0.0112, 0.0112]
cat 1: [23, 1992, 29, 47] and [0.011, 0.9527, 0.0139, 0.0225]
cat 2: [9, 17, 700, 31] and [0.0119, 0.0225, 0.9247, 0.041]
cat 3: [37, 88, 57, 3151] and [0.0111, 0.0264, 0.0171, 0.9454]
[test epoch 49/100] | loss 0.418 | nw acc 0.364 | time 0 min 35 sec
cat 0: [171, 174, 7, 20] and [0.4597, 0.4677, 0.0188, 0.0538]
cat 1: [30, 445, 300, 107] and [0.034, 0.5045, 0.3401, 0.1213]
cat 2: [86, 367, 92, 119] and [0.1295, 0.5527, 0.1386, 0.1792]
cat 3: [71, 86, 9, 107] and [0.2601, 0.315, 0.033, 0.3919]
[train epoch 50/100] | loss 0.80912 | nw acc 0.94 | time 1 min 59 sec
cat 0: [1047, 13, 10, 20] and [0.9606, 0.0119, 0.0092, 0.0183]
cat 1: [25, 1982, 28, 58] and [0.0119, 0.947, 0.0134, 0.0277]
cat 2: [7, 16, 695, 28] and [0.0094, 0.0214, 0.9316, 0.0375]
cat 3: [32, 94, 65, 3135] and [0.0096, 0.0283, 0.0195, 0.9426]
[test epoch 50/100] | loss 0.42 | nw acc 0.366 | time 0 min 35 sec
cat 0: [89, 49, 1, 0] and [0.6403, 0.3525, 0.0072, 0.0]
cat 1: [99, 521, 312, 131] and [0.0931, 0.4901, 0.2935, 0.1232]
cat 2: [91, 140, 27, 39] and [0.3064, 0.4714, 0.0909, 0.1313]
cat 3: [79, 362, 68, 183] and [0.1142, 0.5231, 0.0983, 0.2645]
[train epoch 51/100] | loss 0.8001 | nw acc 0.949 | time 1 min 55 sec
cat 0: [1056, 21, 10, 13] and [0.96, 0.0191, 0.0091, 0.0118]
cat 1: [19, 2005, 18, 49] and [0.0091, 0.9589, 0.0086, 0.0234]
cat 2: [8, 15, 710, 24] and [0.0106, 0.0198, 0.9379, 0.0317]
cat 3: [28, 64, 60, 3155] and [0.0085, 0.0194, 0.0181, 0.954]
[test epoch 51/100] | loss 0.432 | nw acc 0.313 | time 0 min 37 sec
cat 0: [101, 106, 1, 4] and [0.4764, 0.5, 0.0047, 0.0189]
cat 1: [33, 420, 279, 151] and [0.0374, 0.4757, 0.316, 0.171]
cat 2: [149, 459, 118, 136] and [0.1729, 0.5325, 0.1369, 0.1578]
cat 3: [75, 87, 10, 62] and [0.3205, 0.3718, 0.0427, 0.265]
[train epoch 52/100] | loss 0.80209 | nw acc 0.947 | time 2 min 0 sec
cat 0: [1040, 6, 9, 25] and [0.963, 0.0056, 0.0083, 0.0231]
cat 1: [19, 2018, 22, 50] and [0.009, 0.9569, 0.0104, 0.0237]
cat 2: [7, 19, 716, 30] and [0.0091, 0.0246, 0.9275, 0.0389]
cat 3: [45, 62, 51, 3136] and [0.0137, 0.0188, 0.0155, 0.952]
[test epoch 52/100] | loss 0.416 | nw acc 0.37 | time 0 min 35 sec
cat 0: [117, 116, 1, 6] and [0.4875, 0.4833, 0.0042, 0.025]
cat 1: [46, 500, 307, 128] and [0.0469, 0.5097, 0.3129, 0.1305]
cat 2: [126, 317, 77, 85] and [0.2083, 0.524, 0.1273, 0.1405]
cat 3: [69, 139, 23, 134] and [0.189, 0.3808, 0.063, 0.3671]
[train epoch 53/100] | loss 0.79836 | nw acc 0.951 | time 1 min 59 sec
cat 0: [1058, 9, 8, 18] and [0.968, 0.0082, 0.0073, 0.0165]
cat 1: [19, 2013, 22, 51] and [0.009, 0.9563, 0.0105, 0.0242]
cat 2: [4, 12, 715, 21] and [0.0053, 0.016, 0.9508, 0.0279]
cat 3: [30, 71, 53, 3151] and [0.0091, 0.0215, 0.016, 0.9534]
[test epoch 53/100] | loss 0.425 | nw acc 0.338 | time 0 min 37 sec
cat 0: [88, 54, 1, 0] and [0.6154, 0.3776, 0.007, 0.0]
cat 1: [13, 357, 225, 81] and [0.0192, 0.5281, 0.3328, 0.1198]
cat 2: [134, 295, 108, 67] and [0.2219, 0.4884, 0.1788, 0.1109]
cat 3: [123, 366, 74, 205] and [0.1602, 0.4766, 0.0964, 0.2669]
[train epoch 54/100] | loss 0.79701 | nw acc 0.953 | time 1 min 57 sec
cat 0: [1059, 12, 12, 19] and [0.961, 0.0109, 0.0109, 0.0172]
cat 1: [20, 2008, 12, 42] and [0.0096, 0.9645, 0.0058, 0.0202]
cat 2: [3, 10, 730, 26] and [0.0039, 0.013, 0.9493, 0.0338]
cat 3: [29, 75, 44, 3154] and [0.0088, 0.0227, 0.0133, 0.9552]
[test epoch 54/100] | loss 0.413 | nw acc 0.385 | time 0 min 35 sec
cat 0: [118, 79, 1, 13] and [0.5592, 0.3744, 0.0047, 0.0616]
cat 1: [87, 647, 359, 172] and [0.0688, 0.5115, 0.2838, 0.136]
cat 2: [107, 322, 46, 117] and [0.1807, 0.5439, 0.0777, 0.1976]
cat 3: [46, 24, 2, 51] and [0.374, 0.1951, 0.0163, 0.4146]
[train epoch 55/100] | loss 0.79331 | nw acc 0.955 | time 1 min 58 sec
cat 0: [1052, 14, 4, 18] and [0.9669, 0.0129, 0.0037, 0.0165]
cat 1: [15, 2008, 10, 38] and [0.0072, 0.9696, 0.0048, 0.0183]
cat 2: [3, 16, 745, 22] and [0.0038, 0.0204, 0.9478, 0.028]
cat 3: [41, 67, 39, 3163] and [0.0124, 0.0202, 0.0118, 0.9556]
[test epoch 55/100] | loss 0.418 | nw acc 0.362 | time 0 min 36 sec
cat 0: [130, 139, 2, 11] and [0.461, 0.4929, 0.0071, 0.039]
cat 1: [52, 516, 327, 96] and [0.0525, 0.5207, 0.33, 0.0969]
cat 2: [105, 337, 69, 150] and [0.1589, 0.5098, 0.1044, 0.2269]
cat 3: [71, 80, 10, 96] and [0.2763, 0.3113, 0.0389, 0.3735]
[train epoch 56/100] | loss 0.79498 | nw acc 0.952 | time 1 min 58 sec
cat 0: [1062, 16, 7, 18] and [0.9628, 0.0145, 0.0063, 0.0163]
cat 1: [17, 2002, 19, 43] and [0.0082, 0.962, 0.0091, 0.0207]
cat 2: [4, 12, 726, 22] and [0.0052, 0.0157, 0.9503, 0.0288]
cat 3: [28, 75, 46, 3158] and [0.0085, 0.0227, 0.0139, 0.9549]
[test epoch 56/100] | loss 0.412 | nw acc 0.386 | time 0 min 36 sec
cat 0: [126, 70, 3, 5] and [0.6176, 0.3431, 0.0147, 0.0245]
cat 1: [63, 555, 316, 160] and [0.0576, 0.5073, 0.2888, 0.1463]
cat 2: [105, 354, 76, 80] and [0.1707, 0.5756, 0.1236, 0.1301]
cat 3: [64, 93, 13, 108] and [0.2302, 0.3345, 0.0468, 0.3885]
