MaunaNet4(
  (conv1): Conv2d(1, 3, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn1): BatchNorm2d(3, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool1): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv2): Conv2d(3, 64, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool2): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv3): Conv2d(64, 128, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn3): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool3): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv4): Conv2d(128, 256, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn4): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool4): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (avgpool): AvgPool2d(kernel_size=2, stride=2, padding=0)
  (fc1): Linear(in_features=256, out_features=4, bias=True)
  (softmax): Softmax()
)
train patients [42 40 24 53  2 55 22 17 29 18 51  8 14  5 19 43 15 46  7 45  1 34 13 44
 31  6 30 47 25 23 10 50 54  3  0]
train labels [1111 2105  798 3241]
test patients [41 48 35  4 11 32 36 12 49]
test labels [ 358 1072  408  353]

[train epoch 1/100] | loss 1.1013 | nw acc 0.654 | time 1 min 24 sec
cat 0: [693, 65, 122, 136] and [0.6821, 0.064, 0.1201, 0.1339]
cat 1: [130, 1231, 174, 321] and [0.07, 0.6633, 0.0938, 0.173]
cat 2: [46, 27, 91, 26] and [0.2421, 0.1421, 0.4789, 0.1368]
cat 3: [242, 782, 411, 2758] and [0.0577, 0.1865, 0.098, 0.6578]
[test epoch 1/100] | loss 0.435 | nw acc 0.252 | time 0 min 26 sec
cat 0: [71, 197, 18, 4] and [0.2448, 0.6793, 0.0621, 0.0138]
cat 1: [6, 103, 22, 10] and [0.0426, 0.7305, 0.156, 0.0709]
cat 2: [173, 158, 63, 11] and [0.4272, 0.3901, 0.1556, 0.0272]
cat 3: [108, 614, 305, 328] and [0.0797, 0.4531, 0.2251, 0.2421]
[train epoch 2/100] | loss 0.9567 | nw acc 0.811 | time 1 min 32 sec
cat 0: [953, 47, 66, 65] and [0.8426, 0.0416, 0.0584, 0.0575]
cat 1: [26, 1661, 89, 219] and [0.013, 0.8326, 0.0446, 0.1098]
cat 2: [48, 39, 404, 56] and [0.0878, 0.0713, 0.7386, 0.1024]
cat 3: [84, 358, 239, 2901] and [0.0235, 0.0999, 0.0667, 0.8099]
[test epoch 2/100] | loss 0.419 | nw acc 0.348 | time 0 min 31 sec
cat 0: [64, 8, 2, 2] and [0.8421, 0.1053, 0.0263, 0.0263]
cat 1: [77, 427, 82, 62] and [0.1188, 0.659, 0.1265, 0.0957]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [217, 637, 324, 289] and [0.1479, 0.4342, 0.2209, 0.197]
[train epoch 3/100] | loss 0.86355 | nw acc 0.902 | time 1 min 51 sec
cat 0: [1029, 39, 13, 29] and [0.927, 0.0351, 0.0117, 0.0261]
cat 1: [19, 1862, 28, 141] and [0.0093, 0.9083, 0.0137, 0.0688]
cat 2: [10, 29, 665, 43] and [0.0134, 0.0388, 0.8902, 0.0576]
cat 3: [53, 175, 92, 3028] and [0.0158, 0.0523, 0.0275, 0.9044]
[test epoch 3/100] | loss 0.475 | nw acc 0.166 | time 0 min 34 sec
cat 0: [12, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 6, 2, 0] and [0.0, 0.75, 0.25, 0.0]
cat 2: [30, 13, 1, 0] and [0.6818, 0.2955, 0.0227, 0.0]
cat 3: [316, 1053, 405, 353] and [0.1486, 0.4951, 0.1904, 0.166]
[train epoch 4/100] | loss 0.80673 | nw acc 0.954 | time 1 min 55 sec
cat 0: [1072, 19, 6, 11] and [0.9675, 0.0171, 0.0054, 0.0099]
cat 1: [21, 1992, 13, 61] and [0.0101, 0.9545, 0.0062, 0.0292]
cat 2: [0, 12, 746, 19] and [0.0, 0.0154, 0.9601, 0.0245]
cat 3: [18, 82, 33, 3150] and [0.0055, 0.025, 0.0101, 0.9595]
[test epoch 4/100] | loss 0.476 | nw acc 0.175 | time 0 min 38 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [8, 48, 39, 12] and [0.0748, 0.4486, 0.3645, 0.1121]
cat 2: [16, 4, 6, 3] and [0.5517, 0.1379, 0.2069, 0.1034]
cat 3: [334, 1020, 363, 338] and [0.1625, 0.4964, 0.1766, 0.1645]
[train epoch 5/100] | loss 0.78699 | nw acc 0.967 | time 1 min 58 sec
cat 0: [1082, 8, 1, 13] and [0.9801, 0.0072, 0.0009, 0.0118]
cat 1: [12, 2039, 3, 47] and [0.0057, 0.9705, 0.0014, 0.0224]
cat 2: [0, 5, 768, 12] and [0.0, 0.0064, 0.9783, 0.0153]
cat 3: [17, 53, 26, 3169] and [0.0052, 0.0162, 0.008, 0.9706]
[test epoch 5/100] | loss 0.438 | nw acc 0.281 | time 0 min 33 sec
cat 0: [81, 100, 4, 2] and [0.4332, 0.5348, 0.0214, 0.0107]
cat 1: [47, 150, 60, 50] and [0.1531, 0.4886, 0.1954, 0.1629]
cat 2: [105, 255, 212, 115] and [0.1528, 0.3712, 0.3086, 0.1674]
cat 3: [125, 567, 132, 186] and [0.1238, 0.5614, 0.1307, 0.1842]
[train epoch 6/100] | loss 0.77032 | nw acc 0.982 | time 1 min 55 sec
cat 0: [1093, 6, 0, 8] and [0.9874, 0.0054, 0.0, 0.0072]
cat 1: [12, 2072, 0, 14] and [0.0057, 0.9876, 0.0, 0.0067]
cat 2: [0, 3, 787, 8] and [0.0, 0.0038, 0.9862, 0.01]
cat 3: [6, 24, 11, 3211] and [0.0018, 0.0074, 0.0034, 0.9874]
[test epoch 6/100] | loss 0.423 | nw acc 0.343 | time 0 min 38 sec
cat 0: [213, 260, 56, 15] and [0.3915, 0.4779, 0.1029, 0.0276]
cat 1: [68, 362, 237, 142] and [0.0841, 0.4475, 0.293, 0.1755]
cat 2: [9, 27, 1, 3] and [0.225, 0.675, 0.025, 0.075]
cat 3: [68, 423, 114, 193] and [0.0852, 0.5301, 0.1429, 0.2419]
[train epoch 7/100] | loss 0.76481 | nw acc 0.985 | time 2 min 9 sec
cat 0: [1098, 3, 0, 5] and [0.9928, 0.0027, 0.0, 0.0045]
cat 1: [7, 2084, 1, 15] and [0.0033, 0.9891, 0.0005, 0.0071]
cat 2: [0, 1, 786, 3] and [0.0, 0.0013, 0.9949, 0.0038]
cat 3: [6, 17, 11, 3218] and [0.0018, 0.0052, 0.0034, 0.9895]
[test epoch 7/100] | loss 0.408 | nw acc 0.391 | time 0 min 35 sec
cat 0: [137, 23, 3, 2] and [0.8303, 0.1394, 0.0182, 0.0121]
cat 1: [28, 453, 246, 104] and [0.0337, 0.5451, 0.296, 0.1252]
cat 2: [90, 465, 98, 59] and [0.1264, 0.6531, 0.1376, 0.0829]
cat 3: [103, 131, 61, 188] and [0.2133, 0.2712, 0.1263, 0.3892]
[train epoch 8/100] | loss 0.75874 | nw acc 0.99 | time 2 min 9 sec
cat 0: [1106, 6, 0, 0] and [0.9946, 0.0054, 0.0, 0.0]
cat 1: [4, 2089, 1, 6] and [0.0019, 0.9948, 0.0005, 0.0029]
cat 2: [0, 0, 794, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [1, 10, 3, 3235] and [0.0003, 0.0031, 0.0009, 0.9957]
[test epoch 8/100] | loss 0.452 | nw acc 0.25 | time 0 min 34 sec
cat 0: [119, 49, 9, 1] and [0.6685, 0.2753, 0.0506, 0.0056]
cat 1: [1, 35, 18, 1] and [0.0182, 0.6364, 0.3273, 0.0182]
cat 2: [28, 29, 57, 2] and [0.2414, 0.25, 0.4914, 0.0172]
cat 3: [210, 959, 324, 349] and [0.114, 0.5206, 0.1759, 0.1895]
[train epoch 9/100] | loss 0.75769 | nw acc 0.991 | time 1 min 57 sec
cat 0: [1105, 2, 0, 1] and [0.9973, 0.0018, 0.0, 0.0009]
cat 1: [3, 2093, 1, 5] and [0.0014, 0.9957, 0.0005, 0.0024]
cat 2: [0, 1, 795, 0] and [0.0, 0.0013, 0.9987, 0.0]
cat 3: [3, 9, 2, 3235] and [0.0009, 0.0028, 0.0006, 0.9957]
[test epoch 9/100] | loss 0.441 | nw acc 0.264 | time 0 min 34 sec
cat 0: [44, 49, 1, 1] and [0.4632, 0.5158, 0.0105, 0.0105]
cat 1: [21, 181, 162, 36] and [0.0525, 0.4525, 0.405, 0.09]
cat 2: [87, 154, 89, 39] and [0.2358, 0.4173, 0.2412, 0.1057]
cat 3: [206, 688, 156, 277] and [0.1552, 0.5185, 0.1176, 0.2087]
[train epoch 10/100] | loss 0.75843 | nw acc 0.99 | time 1 min 56 sec
cat 0: [1108, 6, 0, 2] and [0.9928, 0.0054, 0.0, 0.0018]
cat 1: [2, 2089, 0, 10] and [0.001, 0.9943, 0.0, 0.0048]
cat 2: [0, 0, 795, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [1, 10, 3, 3229] and [0.0003, 0.0031, 0.0009, 0.9957]
[test epoch 10/100] | loss 0.413 | nw acc 0.383 | time 0 min 36 sec
cat 0: [74, 7, 0, 0] and [0.9136, 0.0864, 0.0, 0.0]
cat 1: [63, 622, 316, 210] and [0.052, 0.5136, 0.2609, 0.1734]
cat 2: [130, 386, 78, 58] and [0.1994, 0.592, 0.1196, 0.089]
cat 3: [91, 57, 14, 85] and [0.3684, 0.2308, 0.0567, 0.3441]
[train epoch 11/100] | loss 0.75624 | nw acc 0.991 | time 2 min 0 sec
cat 0: [1106, 3, 0, 1] and [0.9964, 0.0027, 0.0, 0.0009]
cat 1: [3, 2094, 1, 5] and [0.0014, 0.9957, 0.0005, 0.0024]
cat 2: [0, 0, 796, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [2, 8, 1, 3235] and [0.0006, 0.0025, 0.0003, 0.9966]
[test epoch 11/100] | loss 0.4 | nw acc 0.441 | time 0 min 35 sec
cat 0: [16, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [194, 942, 379, 283] and [0.1079, 0.5239, 0.2108, 0.1574]
cat 2: [148, 121, 29, 70] and [0.4022, 0.3288, 0.0788, 0.1902]
cat 3: [0, 9, 0, 0] and [0.0, 1.0, 0.0, 0.0]
[train epoch 12/100] | loss 0.75611 | nw acc 0.991 | time 1 min 58 sec
cat 0: [1109, 1, 1, 2] and [0.9964, 0.0009, 0.0009, 0.0018]
cat 1: [0, 2097, 2, 4] and [0.0, 0.9971, 0.001, 0.0019]
cat 2: [0, 1, 792, 2] and [0.0, 0.0013, 0.9962, 0.0025]
cat 3: [2, 6, 3, 3233] and [0.0006, 0.0018, 0.0009, 0.9966]
[test epoch 12/100] | loss 0.406 | nw acc 0.418 | time 0 min 35 sec
cat 0: [80, 2, 0, 0] and [0.9756, 0.0244, 0.0, 0.0]
cat 1: [155, 817, 388, 282] and [0.0944, 0.4976, 0.2363, 0.1717]
cat 2: [100, 203, 14, 45] and [0.2762, 0.5608, 0.0387, 0.1243]
cat 3: [23, 50, 6, 26] and [0.219, 0.4762, 0.0571, 0.2476]
[train epoch 13/100] | loss 0.7523 | nw acc 0.994 | time 1 min 59 sec
cat 0: [1110, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2104, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 796, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [1, 1, 2, 3241] and [0.0003, 0.0003, 0.0006, 0.9988]
[test epoch 13/100] | loss 0.401 | nw acc 0.427 | time 0 min 36 sec
cat 0: [52, 4, 0, 0] and [0.9286, 0.0714, 0.0, 0.0]
cat 1: [117, 777, 367, 216] and [0.0792, 0.5261, 0.2485, 0.1462]
cat 2: [73, 146, 9, 18] and [0.2967, 0.5935, 0.0366, 0.0732]
cat 3: [116, 145, 32, 119] and [0.2816, 0.3519, 0.0777, 0.2888]
[train epoch 14/100] | loss 0.7517 | nw acc 0.994 | time 1 min 58 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2104, 0, 1] and [0.0, 0.9995, 0.0, 0.0005]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 1, 0, 3240] and [0.0, 0.0003, 0.0, 0.9997]
[test epoch 14/100] | loss 0.443 | nw acc 0.27 | time 0 min 35 sec
cat 0: [127, 91, 10, 4] and [0.5474, 0.3922, 0.0431, 0.0172]
cat 1: [5, 150, 148, 20] and [0.0155, 0.4644, 0.4582, 0.0619]
cat 2: [27, 45, 12, 14] and [0.2755, 0.4592, 0.1224, 0.1429]
cat 3: [199, 786, 238, 315] and [0.1294, 0.5111, 0.1547, 0.2048]
[train epoch 15/100] | loss 0.75163 | nw acc 0.994 | time 1 min 56 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2104, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 798, 1] and [0.0, 0.0, 0.9987, 0.0013]
cat 3: [0, 1, 0, 3240] and [0.0, 0.0003, 0.0, 0.9997]
[test epoch 15/100] | loss 0.42 | nw acc 0.361 | time 0 min 34 sec
cat 0: [88, 47, 1, 0] and [0.6471, 0.3456, 0.0074, 0.0]
cat 1: [68, 586, 353, 213] and [0.0557, 0.4803, 0.2893, 0.1746]
cat 2: [73, 146, 15, 21] and [0.2863, 0.5725, 0.0588, 0.0824]
cat 3: [129, 293, 39, 119] and [0.2224, 0.5052, 0.0672, 0.2052]
[train epoch 16/100] | loss 0.75462 | nw acc 0.992 | time 1 min 56 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2098, 0, 5] and [0.0, 0.9976, 0.0, 0.0024]
cat 2: [0, 0, 797, 1] and [0.0, 0.0, 0.9987, 0.0013]
cat 3: [0, 7, 1, 3235] and [0.0, 0.0022, 0.0003, 0.9975]
[test epoch 16/100] | loss 0.388 | nw acc 0.486 | time 0 min 33 sec
cat 0: [53, 1, 0, 0] and [0.9815, 0.0185, 0.0, 0.0]
cat 1: [186, 948, 389, 259] and [0.1044, 0.532, 0.2183, 0.1453]
cat 2: [41, 43, 4, 11] and [0.4141, 0.4343, 0.0404, 0.1111]
cat 3: [78, 80, 15, 83] and [0.3047, 0.3125, 0.0586, 0.3242]
[train epoch 17/100] | loss 0.75121 | nw acc 0.994 | time 1 min 58 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2104, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 1, 0, 3241] and [0.0, 0.0003, 0.0, 0.9997]
[test epoch 17/100] | loss 0.417 | nw acc 0.374 | time 0 min 36 sec
cat 0: [103, 52, 1, 0] and [0.6603, 0.3333, 0.0064, 0.0]
cat 1: [69, 596, 354, 216] and [0.0559, 0.4826, 0.2866, 0.1749]
cat 2: [42, 127, 10, 9] and [0.2234, 0.6755, 0.0532, 0.0479]
cat 3: [144, 297, 43, 128] and [0.2353, 0.4853, 0.0703, 0.2092]
[train epoch 18/100] | loss 0.75061 | nw acc 0.994 | time 2 min 0 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2105, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 3241] and [0.0, 0.0, 0.0, 1.0]
[test epoch 18/100] | loss 0.42 | nw acc 0.36 | time 0 min 35 sec
cat 0: [121, 47, 1, 1] and [0.7118, 0.2765, 0.0059, 0.0059]
cat 1: [27, 459, 300, 124] and [0.0297, 0.5044, 0.3297, 0.1363]
cat 2: [29, 89, 6, 7] and [0.2214, 0.6794, 0.0458, 0.0534]
cat 3: [181, 477, 101, 221] and [0.1847, 0.4867, 0.1031, 0.2255]
[train epoch 19/100] | loss 0.75041 | nw acc 0.994 | time 2 min 1 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2105, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 3241] and [0.0, 0.0, 0.0, 1.0]
[test epoch 19/100] | loss 0.398 | nw acc 0.446 | time 0 min 34 sec
cat 0: [93, 11, 0, 0] and [0.8942, 0.1058, 0.0, 0.0]
cat 1: [70, 751, 358, 196] and [0.0509, 0.5462, 0.2604, 0.1425]
cat 2: [52, 131, 10, 13] and [0.2524, 0.6359, 0.0485, 0.0631]
cat 3: [143, 179, 40, 144] and [0.2826, 0.3538, 0.0791, 0.2846]
[train epoch 20/100] | loss 0.75205 | nw acc 0.993 | time 1 min 56 sec
cat 0: [1110, 1, 0, 0] and [0.9991, 0.0009, 0.0, 0.0]
cat 1: [1, 2102, 0, 2] and [0.0005, 0.9986, 0.0, 0.001]
cat 2: [0, 0, 796, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 2, 2, 3239] and [0.0, 0.0006, 0.0006, 0.9988]
[test epoch 20/100] | loss 0.451 | nw acc 0.251 | time 0 min 38 sec
cat 0: [114, 5, 1, 0] and [0.95, 0.0417, 0.0083, 0.0]
cat 1: [9, 148, 114, 51] and [0.028, 0.4596, 0.354, 0.1584]
cat 2: [26, 4, 0, 2] and [0.8125, 0.125, 0.0, 0.0625]
cat 3: [209, 915, 293, 300] and [0.1217, 0.5329, 0.1706, 0.1747]
[train epoch 21/100] | loss 0.75957 | nw acc 0.988 | time 2 min 7 sec
cat 0: [1102, 2, 0, 8] and [0.991, 0.0018, 0.0, 0.0072]
cat 1: [0, 2089, 3, 7] and [0.0, 0.9952, 0.0014, 0.0033]
cat 2: [1, 1, 791, 1] and [0.0013, 0.0013, 0.9962, 0.0013]
cat 3: [8, 13, 4, 3225] and [0.0025, 0.004, 0.0012, 0.9923]
[test epoch 21/100] | loss 0.398 | nw acc 0.447 | time 0 min 35 sec
cat 0: [87, 76, 1, 0] and [0.5305, 0.4634, 0.0061, 0.0]
cat 1: [225, 856, 389, 294] and [0.1276, 0.4853, 0.2205, 0.1667]
cat 2: [18, 24, 3, 4] and [0.3673, 0.4898, 0.0612, 0.0816]
cat 3: [28, 116, 15, 55] and [0.1308, 0.5421, 0.0701, 0.257]
[train epoch 22/100] | loss 0.7619 | nw acc 0.987 | time 1 min 58 sec
cat 0: [1096, 6, 1, 7] and [0.9874, 0.0054, 0.0009, 0.0063]
cat 1: [3, 2088, 4, 7] and [0.0014, 0.9933, 0.0019, 0.0033]
cat 2: [1, 3, 789, 2] and [0.0013, 0.0038, 0.9925, 0.0025]
cat 3: [11, 8, 4, 3225] and [0.0034, 0.0025, 0.0012, 0.9929]
[test epoch 22/100] | loss 0.439 | nw acc 0.299 | time 0 min 35 sec
cat 0: [61, 12, 0, 0] and [0.8356, 0.1644, 0.0, 0.0]
cat 1: [76, 424, 224, 85] and [0.0939, 0.5241, 0.2769, 0.1051]
cat 2: [210, 634, 184, 268] and [0.162, 0.4892, 0.142, 0.2068]
cat 3: [11, 2, 0, 0] and [0.8462, 0.1538, 0.0, 0.0]
[train epoch 23/100] | loss 0.7557 | nw acc 0.992 | time 1 min 59 sec
cat 0: [1109, 0, 0, 2] and [0.9982, 0.0, 0.0, 0.0018]
cat 1: [1, 2097, 0, 5] and [0.0005, 0.9971, 0.0, 0.0024]
cat 2: [0, 2, 797, 1] and [0.0, 0.0025, 0.9962, 0.0013]
cat 3: [1, 6, 1, 3233] and [0.0003, 0.0019, 0.0003, 0.9975]
[test epoch 23/100] | loss 0.465 | nw acc 0.208 | time 0 min 34 sec
cat 0: [186, 668, 231, 116] and [0.1549, 0.5562, 0.1923, 0.0966]
cat 1: [1, 17, 30, 7] and [0.0182, 0.3091, 0.5455, 0.1273]
cat 2: [28, 133, 108, 74] and [0.0816, 0.3878, 0.3149, 0.2157]
cat 3: [143, 254, 39, 156] and [0.2416, 0.4291, 0.0659, 0.2635]
[train epoch 24/100] | loss 0.75421 | nw acc 0.992 | time 1 min 56 sec
cat 0: [1110, 0, 0, 1] and [0.9991, 0.0, 0.0, 0.0009]
cat 1: [1, 2096, 1, 1] and [0.0005, 0.9986, 0.0005, 0.0005]
cat 2: [0, 0, 794, 1] and [0.0, 0.0, 0.9987, 0.0013]
cat 3: [0, 9, 3, 3238] and [0.0, 0.0028, 0.0009, 0.9963]
[test epoch 24/100] | loss 0.46 | nw acc 0.226 | time 0 min 38 sec
cat 0: [156, 297, 47, 39] and [0.2894, 0.551, 0.0872, 0.0724]
cat 1: [0, 52, 68, 23] and [0.0, 0.3636, 0.4755, 0.1608]
cat 2: [20, 20, 13, 5] and [0.3448, 0.3448, 0.2241, 0.0862]
cat 3: [182, 703, 280, 286] and [0.1254, 0.4845, 0.193, 0.1971]
[train epoch 25/100] | loss 0.75091 | nw acc 0.994 | time 2 min 9 sec
cat 0: [1110, 1, 0, 0] and [0.9991, 0.0009, 0.0, 0.0]
cat 1: [1, 2104, 0, 0] and [0.0005, 0.9995, 0.0, 0.0]
cat 2: [0, 0, 797, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 1, 3241] and [0.0, 0.0, 0.0003, 0.9997]
[test epoch 25/100] | loss 0.421 | nw acc 0.356 | time 0 min 38 sec
cat 0: [128, 85, 2, 0] and [0.5953, 0.3953, 0.0093, 0.0]
cat 1: [33, 459, 283, 166] and [0.0351, 0.4878, 0.3007, 0.1764]
cat 2: [27, 140, 31, 8] and [0.1311, 0.6796, 0.1505, 0.0388]
cat 3: [170, 388, 92, 179] and [0.2051, 0.468, 0.111, 0.2159]
[train epoch 26/100] | loss 0.75075 | nw acc 0.994 | time 2 min 10 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2105, 0, 1] and [0.0, 0.9995, 0.0, 0.0005]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 3240] and [0.0, 0.0, 0.0, 1.0]
[test epoch 26/100] | loss 0.439 | nw acc 0.302 | time 0 min 36 sec
cat 0: [130, 62, 2, 0] and [0.6701, 0.3196, 0.0103, 0.0]
cat 1: [25, 401, 302, 216] and [0.0265, 0.4248, 0.3199, 0.2288]
cat 2: [26, 80, 12, 4] and [0.2131, 0.6557, 0.0984, 0.0328]
cat 3: [177, 529, 92, 133] and [0.1901, 0.5682, 0.0988, 0.1429]
[train epoch 27/100] | loss 0.7506 | nw acc 0.994 | time 2 min 1 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2105, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 3241] and [0.0, 0.0, 0.0, 1.0]
[test epoch 27/100] | loss 0.434 | nw acc 0.312 | time 0 min 35 sec
cat 0: [127, 91, 2, 2] and [0.5721, 0.4099, 0.009, 0.009]
cat 1: [19, 377, 255, 159] and [0.0235, 0.4654, 0.3148, 0.1963]
cat 2: [27, 83, 8, 5] and [0.2195, 0.6748, 0.065, 0.0407]
cat 3: [185, 521, 143, 187] and [0.1786, 0.5029, 0.138, 0.1805]
[train epoch 28/100] | loss 0.75208 | nw acc 0.994 | time 1 min 58 sec
cat 0: [1108, 1, 0, 0] and [0.9991, 0.0009, 0.0, 0.0]
cat 1: [3, 2103, 0, 0] and [0.0014, 0.9986, 0.0, 0.0]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 1, 0, 3241] and [0.0, 0.0003, 0.0, 0.9997]
[test epoch 28/100] | loss 0.407 | nw acc 0.406 | time 0 min 35 sec
cat 0: [101, 46, 0, 1] and [0.6824, 0.3108, 0.0, 0.0068]
cat 1: [78, 656, 337, 201] and [0.0613, 0.5157, 0.2649, 0.158]
cat 2: [30, 81, 7, 6] and [0.2419, 0.6532, 0.0565, 0.0484]
cat 3: [149, 289, 64, 145] and [0.2303, 0.4467, 0.0989, 0.2241]
[train epoch 29/100] | loss 0.75058 | nw acc 0.994 | time 1 min 57 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2104, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 1, 0, 3241] and [0.0, 0.0003, 0.0, 0.9997]
[test epoch 29/100] | loss 0.399 | nw acc 0.435 | time 0 min 36 sec
cat 0: [114, 40, 1, 1] and [0.7308, 0.2564, 0.0064, 0.0064]
cat 1: [46, 626, 338, 127] and [0.0405, 0.5506, 0.2973, 0.1117]
cat 2: [39, 118, 19, 10] and [0.2097, 0.6344, 0.1022, 0.0538]
cat 3: [159, 288, 50, 215] and [0.2233, 0.4045, 0.0702, 0.302]
[train epoch 30/100] | loss 0.75038 | nw acc 0.994 | time 1 min 56 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2105, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 3241] and [0.0, 0.0, 0.0, 1.0]
[test epoch 30/100] | loss 0.407 | nw acc 0.415 | time 0 min 35 sec
cat 0: [115, 31, 0, 1] and [0.7823, 0.2109, 0.0, 0.0068]
cat 1: [46, 630, 353, 168] and [0.0384, 0.5263, 0.2949, 0.1404]
cat 2: [36, 109, 8, 8] and [0.2236, 0.677, 0.0497, 0.0497]
cat 3: [161, 302, 47, 176] and [0.2347, 0.4402, 0.0685, 0.2566]
[train epoch 31/100] | loss 0.75031 | nw acc 0.994 | time 1 min 57 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2105, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 3241] and [0.0, 0.0, 0.0, 1.0]
[test epoch 31/100] | loss 0.41 | nw acc 0.403 | time 0 min 36 sec
cat 0: [114, 35, 0, 1] and [0.76, 0.2333, 0.0, 0.0067]
cat 1: [38, 578, 339, 145] and [0.0345, 0.5255, 0.3082, 0.1318]
cat 2: [30, 108, 9, 6] and [0.1961, 0.7059, 0.0588, 0.0392]
cat 3: [176, 351, 60, 201] and [0.2234, 0.4454, 0.0761, 0.2551]
[train epoch 32/100] | loss 0.7503 | nw acc 0.994 | time 1 min 57 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2105, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 3241] and [0.0, 0.0, 0.0, 1.0]
[test epoch 32/100] | loss 0.412 | nw acc 0.4 | time 0 min 40 sec
cat 0: [120, 49, 0, 1] and [0.7059, 0.2882, 0.0, 0.0059]
cat 1: [35, 582, 348, 159] and [0.0311, 0.5178, 0.3096, 0.1415]
cat 2: [30, 92, 6, 5] and [0.2256, 0.6917, 0.0451, 0.0376]
cat 3: [173, 349, 54, 188] and [0.2264, 0.4568, 0.0707, 0.2461]
[train epoch 33/100] | loss 0.75028 | nw acc 0.994 | time 2 min 10 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2105, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 3241] and [0.0, 0.0, 0.0, 1.0]
[test epoch 33/100] | loss 0.412 | nw acc 0.397 | time 0 min 38 sec
cat 0: [121, 47, 0, 1] and [0.716, 0.2781, 0.0, 0.0059]
cat 1: [35, 569, 340, 155] and [0.0318, 0.5177, 0.3094, 0.141]
cat 2: [30, 123, 13, 10] and [0.1705, 0.6989, 0.0739, 0.0568]
cat 3: [172, 333, 55, 187] and [0.2303, 0.4458, 0.0736, 0.2503]
[train epoch 34/100] | loss 0.75029 | nw acc 0.994 | time 2 min 11 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2105, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 3241] and [0.0, 0.0, 0.0, 1.0]
[test epoch 34/100] | loss 0.413 | nw acc 0.389 | time 0 min 36 sec
cat 0: [116, 40, 0, 1] and [0.7389, 0.2548, 0.0, 0.0064]
cat 1: [35, 566, 340, 167] and [0.0316, 0.5108, 0.3069, 0.1507]
cat 2: [30, 129, 14, 10] and [0.1639, 0.7049, 0.0765, 0.0546]
cat 3: [177, 337, 54, 175] and [0.2382, 0.4536, 0.0727, 0.2355]
[train epoch 35/100] | loss 0.75035 | nw acc 0.994 | time 2 min 2 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2105, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 3241] and [0.0, 0.0, 0.0, 1.0]
[test epoch 35/100] | loss 0.405 | nw acc 0.42 | time 0 min 35 sec
cat 0: [121, 37, 0, 0] and [0.7658, 0.2342, 0.0, 0.0]
cat 1: [49, 681, 365, 214] and [0.0374, 0.5202, 0.2788, 0.1635]
cat 2: [33, 122, 14, 15] and [0.1793, 0.663, 0.0761, 0.0815]
cat 3: [155, 232, 29, 124] and [0.287, 0.4296, 0.0537, 0.2296]
[train epoch 36/100] | loss 0.75029 | nw acc 0.994 | time 1 min 59 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2105, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 3241] and [0.0, 0.0, 0.0, 1.0]
[test epoch 36/100] | loss 0.411 | nw acc 0.394 | time 0 min 35 sec
cat 0: [126, 57, 2, 1] and [0.6774, 0.3065, 0.0108, 0.0054]
cat 1: [31, 563, 340, 160] and [0.0283, 0.5146, 0.3108, 0.1463]
cat 2: [31, 130, 14, 13] and [0.1649, 0.6915, 0.0745, 0.0691]
cat 3: [170, 322, 52, 179] and [0.2351, 0.4454, 0.0719, 0.2476]
[train epoch 37/100] | loss 0.75053 | nw acc 0.994 | time 1 min 55 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2105, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 3241] and [0.0, 0.0, 0.0, 1.0]
[test epoch 37/100] | loss 0.421 | nw acc 0.365 | time 0 min 37 sec
cat 0: [96, 2, 0, 0] and [0.9796, 0.0204, 0.0, 0.0]
cat 1: [42, 532, 306, 162] and [0.0403, 0.5106, 0.2937, 0.1555]
cat 2: [27, 33, 1, 2] and [0.4286, 0.5238, 0.0159, 0.0317]
cat 3: [193, 505, 101, 189] and [0.1953, 0.5111, 0.1022, 0.1913]
[train epoch 38/100] | loss 0.77003 | nw acc 0.979 | time 2 min 10 sec
cat 0: [1094, 7, 2, 13] and [0.9803, 0.0063, 0.0018, 0.0116]
cat 1: [2, 2073, 6, 26] and [0.0009, 0.9839, 0.0028, 0.0123]
cat 2: [2, 3, 779, 4] and [0.0025, 0.0038, 0.9886, 0.0051]
cat 3: [13, 22, 11, 3198] and [0.004, 0.0068, 0.0034, 0.9858]
[test epoch 38/100] | loss 0.383 | nw acc 0.507 | time 0 min 36 sec
cat 0: [68, 15, 0, 0] and [0.8193, 0.1807, 0.0, 0.0]
cat 1: [244, 1010, 404, 287] and [0.1254, 0.5193, 0.2077, 0.1476]
cat 2: [27, 17, 0, 9] and [0.5094, 0.3208, 0.0, 0.1698]
cat 3: [19, 30, 4, 57] and [0.1727, 0.2727, 0.0364, 0.5182]
[train epoch 39/100] | loss 0.76084 | nw acc 0.985 | time 1 min 56 sec
cat 0: [1097, 4, 1, 8] and [0.9883, 0.0036, 0.0009, 0.0072]
cat 1: [6, 2085, 0, 16] and [0.0028, 0.9896, 0.0, 0.0076]
cat 2: [0, 2, 792, 4] and [0.0, 0.0025, 0.9925, 0.005]
cat 3: [8, 14, 5, 3213] and [0.0025, 0.0043, 0.0015, 0.9917]
[test epoch 39/100] | loss 0.433 | nw acc 0.317 | time 0 min 35 sec
cat 0: [137, 231, 20, 10] and [0.3442, 0.5804, 0.0503, 0.0251]
cat 1: [46, 360, 190, 140] and [0.0625, 0.4891, 0.2582, 0.1902]
cat 2: [108, 461, 196, 185] and [0.1137, 0.4853, 0.2063, 0.1947]
cat 3: [67, 20, 2, 18] and [0.6262, 0.1869, 0.0187, 0.1682]
[train epoch 40/100] | loss 0.75642 | nw acc 0.99 | time 1 min 57 sec
cat 0: [1104, 1, 1, 3] and [0.9955, 0.0009, 0.0009, 0.0027]
cat 1: [1, 2098, 1, 5] and [0.0005, 0.9967, 0.0005, 0.0024]
cat 2: [0, 0, 790, 1] and [0.0, 0.0, 0.9987, 0.0013]
cat 3: [6, 6, 6, 3232] and [0.0018, 0.0018, 0.0018, 0.9945]
[test epoch 40/100] | loss 0.459 | nw acc 0.233 | time 0 min 39 sec
cat 0: [84, 9, 0, 0] and [0.9032, 0.0968, 0.0, 0.0]
cat 1: [45, 233, 251, 134] and [0.0679, 0.3514, 0.3786, 0.2021]
cat 2: [32, 13, 0, 14] and [0.5424, 0.2203, 0.0, 0.2373]
cat 3: [197, 817, 157, 205] and [0.1432, 0.5938, 0.1141, 0.149]
[train epoch 41/100] | loss 0.75181 | nw acc 0.994 | time 2 min 7 sec
cat 0: [1111, 1, 0, 0] and [0.9991, 0.0009, 0.0, 0.0]
cat 1: [0, 2102, 0, 1] and [0.0, 0.9995, 0.0, 0.0005]
cat 2: [0, 1, 798, 1] and [0.0, 0.0013, 0.9975, 0.0013]
cat 3: [0, 1, 0, 3239] and [0.0, 0.0003, 0.0, 0.9997]
[test epoch 41/100] | loss 0.406 | nw acc 0.418 | time 0 min 35 sec
cat 0: [91, 12, 0, 1] and [0.875, 0.1154, 0.0, 0.0096]
cat 1: [74, 673, 349, 178] and [0.0581, 0.5283, 0.2739, 0.1397]
cat 2: [27, 56, 2, 3] and [0.3068, 0.6364, 0.0227, 0.0341]
cat 3: [166, 331, 57, 171] and [0.229, 0.4566, 0.0786, 0.2359]
[train epoch 42/100] | loss 0.75039 | nw acc 0.994 | time 1 min 59 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2105, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 3241] and [0.0, 0.0, 0.0, 1.0]
[test epoch 42/100] | loss 0.407 | nw acc 0.412 | time 0 min 35 sec
cat 0: [108, 42, 0, 2] and [0.7105, 0.2763, 0.0, 0.0132]
cat 1: [59, 653, 357, 190] and [0.0469, 0.5187, 0.2836, 0.1509]
cat 2: [43, 188, 12, 11] and [0.1693, 0.7402, 0.0472, 0.0433]
cat 3: [148, 189, 39, 150] and [0.2814, 0.3593, 0.0741, 0.2852]
[train epoch 43/100] | loss 0.75058 | nw acc 0.994 | time 1 min 56 sec
cat 0: [1111, 0, 0, 1] and [0.9991, 0.0, 0.0, 0.0009]
cat 1: [0, 2105, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 3240] and [0.0, 0.0, 0.0, 1.0]
[test epoch 43/100] | loss 0.41 | nw acc 0.401 | time 0 min 38 sec
cat 0: [110, 85, 0, 2] and [0.5584, 0.4315, 0.0, 0.0102]
cat 1: [54, 645, 365, 209] and [0.0424, 0.5067, 0.2867, 0.1642]
cat 2: [44, 182, 12, 10] and [0.1774, 0.7339, 0.0484, 0.0403]
cat 3: [150, 160, 31, 132] and [0.3171, 0.3383, 0.0655, 0.2791]
[train epoch 44/100] | loss 0.75036 | nw acc 0.994 | time 2 min 9 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2105, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 3241] and [0.0, 0.0, 0.0, 1.0]
[test epoch 44/100] | loss 0.414 | nw acc 0.387 | time 0 min 38 sec
cat 0: [106, 27, 0, 2] and [0.7852, 0.2, 0.0, 0.0148]
cat 1: [51, 585, 350, 179] and [0.0438, 0.5021, 0.3004, 0.1536]
cat 2: [36, 170, 12, 9] and [0.1586, 0.7489, 0.0529, 0.0396]
cat 3: [165, 290, 46, 163] and [0.2485, 0.4367, 0.0693, 0.2455]
[train epoch 45/100] | loss 0.75031 | nw acc 0.994 | time 2 min 10 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2105, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 3241] and [0.0, 0.0, 0.0, 1.0]
[test epoch 45/100] | loss 0.418 | nw acc 0.372 | time 0 min 36 sec
cat 0: [106, 30, 0, 2] and [0.7681, 0.2174, 0.0, 0.0145]
cat 1: [48, 550, 340, 174] and [0.0432, 0.4946, 0.3058, 0.1565]
cat 2: [31, 143, 7, 6] and [0.1658, 0.7647, 0.0374, 0.0321]
cat 3: [173, 349, 61, 171] and [0.2294, 0.4629, 0.0809, 0.2268]
[train epoch 46/100] | loss 0.75029 | nw acc 0.994 | time 1 min 59 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2105, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 3241] and [0.0, 0.0, 0.0, 1.0]
[test epoch 46/100] | loss 0.414 | nw acc 0.383 | time 0 min 35 sec
cat 0: [113, 54, 0, 2] and [0.6686, 0.3195, 0.0, 0.0118]
cat 1: [46, 576, 346, 183] and [0.04, 0.5004, 0.3006, 0.159]
cat 2: [35, 160, 10, 9] and [0.1636, 0.7477, 0.0467, 0.0421]
cat 3: [164, 282, 52, 159] and [0.2496, 0.4292, 0.0791, 0.242]
[train epoch 47/100] | loss 0.75029 | nw acc 0.994 | time 1 min 59 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2105, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 3241] and [0.0, 0.0, 0.0, 1.0]
[test epoch 47/100] | loss 0.415 | nw acc 0.38 | time 0 min 37 sec
cat 0: [108, 44, 0, 2] and [0.7013, 0.2857, 0.0, 0.013]
cat 1: [49, 556, 342, 164] and [0.0441, 0.5005, 0.3078, 0.1476]
cat 2: [31, 129, 6, 6] and [0.1802, 0.75, 0.0349, 0.0349]
cat 3: [170, 343, 60, 181] and [0.2255, 0.4549, 0.0796, 0.2401]
[train epoch 48/100] | loss 0.75028 | nw acc 0.994 | time 2 min 8 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2105, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 3241] and [0.0, 0.0, 0.0, 1.0]
[test epoch 48/100] | loss 0.418 | nw acc 0.371 | time 0 min 35 sec
cat 0: [112, 45, 0, 2] and [0.7044, 0.283, 0.0, 0.0126]
cat 1: [45, 527, 339, 164] and [0.0419, 0.4902, 0.3153, 0.1526]
cat 2: [34, 147, 10, 6] and [0.1726, 0.7462, 0.0508, 0.0305]
cat 3: [167, 353, 59, 181] and [0.2197, 0.4645, 0.0776, 0.2382]
[train epoch 49/100] | loss 0.75027 | nw acc 0.994 | time 1 min 56 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2105, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 3241] and [0.0, 0.0, 0.0, 1.0]
[test epoch 49/100] | loss 0.416 | nw acc 0.378 | time 0 min 36 sec
cat 0: [109, 36, 0, 2] and [0.7415, 0.2449, 0.0, 0.0136]
cat 1: [47, 554, 343, 170] and [0.0422, 0.4973, 0.3079, 0.1526]
cat 2: [31, 132, 8, 6] and [0.1751, 0.7458, 0.0452, 0.0339]
cat 3: [171, 350, 57, 175] and [0.2271, 0.4648, 0.0757, 0.2324]
[train epoch 50/100] | loss 0.75026 | nw acc 0.994 | time 1 min 59 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2105, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 3241] and [0.0, 0.0, 0.0, 1.0]
[test epoch 50/100] | loss 0.413 | nw acc 0.392 | time 0 min 37 sec
cat 0: [107, 31, 0, 1] and [0.7698, 0.223, 0.0, 0.0072]
cat 1: [48, 596, 349, 178] and [0.041, 0.509, 0.298, 0.152]
cat 2: [30, 115, 5, 5] and [0.1935, 0.7419, 0.0323, 0.0323]
cat 3: [173, 330, 54, 169] and [0.2383, 0.4545, 0.0744, 0.2328]
[train epoch 51/100] | loss 0.75027 | nw acc 0.994 | time 2 min 9 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2105, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 3241] and [0.0, 0.0, 0.0, 1.0]
[test epoch 51/100] | loss 0.413 | nw acc 0.394 | time 0 min 36 sec
cat 0: [106, 22, 0, 1] and [0.8217, 0.1705, 0.0, 0.0078]
cat 1: [49, 598, 348, 171] and [0.042, 0.5129, 0.2985, 0.1467]
cat 2: [31, 107, 4, 6] and [0.2095, 0.723, 0.027, 0.0405]
cat 3: [172, 345, 56, 175] and [0.2299, 0.4612, 0.0749, 0.234]
[train epoch 52/100] | loss 0.75027 | nw acc 0.994 | time 1 min 59 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2105, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 3241] and [0.0, 0.0, 0.0, 1.0]
[test epoch 52/100] | loss 0.414 | nw acc 0.388 | time 0 min 35 sec
cat 0: [115, 56, 0, 2] and [0.6647, 0.3237, 0.0, 0.0116]
cat 1: [43, 580, 346, 177] and [0.0375, 0.5061, 0.3019, 0.1545]
cat 2: [31, 116, 5, 6] and [0.1962, 0.7342, 0.0316, 0.038]
cat 3: [169, 320, 57, 168] and [0.2367, 0.4482, 0.0798, 0.2353]
[train epoch 53/100] | loss 0.75027 | nw acc 0.994 | time 1 min 57 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2105, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 3241] and [0.0, 0.0, 0.0, 1.0]
[test epoch 53/100] | loss 0.416 | nw acc 0.38 | time 0 min 36 sec
cat 0: [107, 25, 0, 1] and [0.8045, 0.188, 0.0, 0.0075]
cat 1: [50, 575, 342, 182] and [0.0435, 0.5004, 0.2977, 0.1584]
cat 2: [30, 108, 4, 5] and [0.2041, 0.7347, 0.0272, 0.034]
cat 3: [171, 364, 62, 165] and [0.2244, 0.4777, 0.0814, 0.2165]
[train epoch 54/100] | loss 0.75026 | nw acc 0.994 | time 2 min 1 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2105, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 3241] and [0.0, 0.0, 0.0, 1.0]
[test epoch 54/100] | loss 0.408 | nw acc 0.411 | time 0 min 34 sec
cat 0: [102, 20, 0, 0] and [0.8361, 0.1639, 0.0, 0.0]
cat 1: [58, 673, 362, 206] and [0.0446, 0.5181, 0.2787, 0.1586]
cat 2: [34, 110, 5, 6] and [0.2194, 0.7097, 0.0323, 0.0387]
cat 3: [164, 269, 41, 141] and [0.2667, 0.4374, 0.0667, 0.2293]
[train epoch 55/100] | loss 0.75027 | nw acc 0.994 | time 1 min 56 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2105, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 3241] and [0.0, 0.0, 0.0, 1.0]
[test epoch 55/100] | loss 0.411 | nw acc 0.402 | time 0 min 39 sec
cat 0: [115, 35, 0, 1] and [0.7616, 0.2318, 0.0, 0.0066]
cat 1: [44, 629, 352, 194] and [0.0361, 0.516, 0.2888, 0.1591]
cat 2: [30, 101, 4, 5] and [0.2143, 0.7214, 0.0286, 0.0357]
cat 3: [169, 307, 52, 153] and [0.2482, 0.4508, 0.0764, 0.2247]
[train epoch 56/100] | loss 0.75028 | nw acc 0.994 | time 2 min 9 sec
cat 0: [1111, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2105, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 798, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 3241] and [0.0, 0.0, 0.0, 1.0]
[test epoch 56/100] | loss 0.416 | nw acc 0.384 | time 0 min 39 sec
cat 0: [116, 35, 0, 1] and [0.7632, 0.2303, 0.0, 0.0066]
cat 1: [41, 567, 342, 177] and [0.0364, 0.5031, 0.3035, 0.1571]
cat 2: [30, 147, 11, 8] and [0.1531, 0.75, 0.0561, 0.0408]
cat 3: [171, 323, 55, 167] and [0.2388, 0.4511, 0.0768, 0.2332]
