MaunaNet4AugDrop(
  (conv1): Conv2d(1, 3, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn1): BatchNorm2d(3, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (drop1): Dropout2d(p=0.2)
  (pool1): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv2): Conv2d(3, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
  (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (drop2): Dropout2d(p=0.2)
  (pool2): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv3): Conv2d(64, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
  (bn3): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (drop3): Dropout2d(p=0.2)
  (pool3): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv4): Conv2d(128, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
  (bn4): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (drop4): Dropout2d(p=0.2)
  (pool4): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (avgpool): AvgPool2d(kernel_size=7, stride=7, padding=0)
  (fc1): Linear(in_features=256, out_features=4, bias=True)
  (softmax): Softmax()
)
train patients [42 40 24 53  2 55 22 17 29 18 51  8 14  5 19 43 15 46  7 45  1 34 13 44
 31  6 30 47 25 23 10 50 54  3  0]
train labels [1111 2105  798 3241]
test patients [41 48 35  4 11 32 36 12 49]
test labels [ 358 1072  408  353]

[train epoch 1/100] | loss 1.2558 | nw acc 0.48 | time 1 min 43 sec
cat 0: [88, 24, 13, 34] and [0.5535, 0.1509, 0.0818, 0.2138]
cat 1: [355, 949, 373, 716] and [0.1483, 0.3966, 0.1559, 0.2992]
cat 2: [14, 12, 2, 26] and [0.2593, 0.2222, 0.037, 0.4815]
cat 3: [654, 1120, 410, 2465] and [0.1407, 0.2409, 0.0882, 0.5302]
[test epoch 1/100] | loss 0.436 | nw acc 0.28 | time 0 min 31 sec
cat 0: [14, 83, 10, 1] and [0.1296, 0.7685, 0.0926, 0.0093]
cat 1: [275, 393, 188, 132] and [0.2783, 0.3978, 0.1903, 0.1336]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [69, 596, 210, 220] and [0.063, 0.5443, 0.1918, 0.2009]
[train epoch 2/100] | loss 1.2417 | nw acc 0.492 | time 1 min 46 sec
cat 0: [150, 50, 13, 88] and [0.4983, 0.1661, 0.0432, 0.2924]
cat 1: [339, 963, 346, 674] and [0.146, 0.4147, 0.149, 0.2903]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [622, 1092, 439, 2479] and [0.1343, 0.2358, 0.0948, 0.5352]
[test epoch 2/100] | loss 0.426 | nw acc 0.309 | time 0 min 31 sec
cat 0: [13, 92, 8, 7] and [0.1083, 0.7667, 0.0667, 0.0583]
cat 1: [309, 496, 203, 162] and [0.2641, 0.4239, 0.1735, 0.1385]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [36, 484, 197, 184] and [0.04, 0.5372, 0.2186, 0.2042]
[train epoch 3/100] | loss 1.2325 | nw acc 0.5 | time 1 min 44 sec
cat 0: [174, 43, 20, 96] and [0.5225, 0.1291, 0.0601, 0.2883]
cat 1: [346, 1011, 352, 679] and [0.1449, 0.4234, 0.1474, 0.2843]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [591, 1051, 426, 2466] and [0.1303, 0.2318, 0.094, 0.5439]
[test epoch 3/100] | loss 0.429 | nw acc 0.301 | time 0 min 31 sec
cat 0: [10, 74, 7, 0] and [0.1099, 0.8132, 0.0769, 0.0]
cat 1: [280, 444, 172, 133] and [0.2721, 0.4315, 0.1672, 0.1293]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [68, 554, 229, 220] and [0.0635, 0.5173, 0.2138, 0.2054]
[train epoch 4/100] | loss 1.2347 | nw acc 0.499 | time 1 min 45 sec
cat 0: [192, 47, 18, 92] and [0.5501, 0.1347, 0.0516, 0.2636]
cat 1: [321, 946, 309, 643] and [0.1447, 0.4263, 0.1393, 0.2898]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [598, 1112, 471, 2506] and [0.1276, 0.2373, 0.1005, 0.5347]
[test epoch 4/100] | loss 0.457 | nw acc 0.206 | time 0 min 30 sec
cat 0: [24, 82, 7, 0] and [0.2124, 0.7257, 0.0619, 0.0]
cat 1: [72, 88, 19, 3] and [0.3956, 0.4835, 0.1044, 0.0165]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [262, 902, 382, 350] and [0.1382, 0.4757, 0.2015, 0.1846]
[train epoch 5/100] | loss 1.2401 | nw acc 0.494 | time 1 min 44 sec
cat 0: [152, 51, 10, 91] and [0.5, 0.1678, 0.0329, 0.2993]
cat 1: [214, 724, 200, 425] and [0.1369, 0.4632, 0.128, 0.2719]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [745, 1330, 588, 2725] and [0.1383, 0.2468, 0.1091, 0.5058]
[test epoch 5/100] | loss 0.427 | nw acc 0.302 | time 0 min 32 sec
cat 0: [24, 157, 21, 11] and [0.1127, 0.7371, 0.0986, 0.0516]
cat 1: [224, 357, 166, 46] and [0.2825, 0.4502, 0.2093, 0.058]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [110, 558, 221, 296] and [0.0928, 0.4709, 0.1865, 0.2498]
[train epoch 6/100] | loss 1.2275 | nw acc 0.507 | time 1 min 45 sec
cat 0: [203, 59, 28, 104] and [0.5152, 0.1497, 0.0711, 0.264]
cat 1: [244, 809, 234, 451] and [0.1404, 0.4655, 0.1346, 0.2595]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [664, 1237, 536, 2686] and [0.1296, 0.2415, 0.1046, 0.5243]
[test epoch 6/100] | loss 0.443 | nw acc 0.256 | time 0 min 32 sec
cat 0: [97, 347, 67, 39] and [0.1764, 0.6309, 0.1218, 0.0709]
cat 1: [192, 200, 126, 38] and [0.3453, 0.3597, 0.2266, 0.0683]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [69, 525, 215, 276] and [0.0636, 0.4839, 0.1982, 0.2544]
[train epoch 7/100] | loss 1.2207 | nw acc 0.512 | time 1 min 44 sec
cat 0: [250, 58, 36, 149] and [0.5071, 0.1176, 0.073, 0.3022]
cat 1: [231, 845, 221, 453] and [0.132, 0.4829, 0.1263, 0.2589]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [630, 1202, 541, 2639] and [0.1257, 0.2398, 0.1079, 0.5265]
[test epoch 7/100] | loss 0.433 | nw acc 0.28 | time 0 min 32 sec
cat 0: [28, 179, 29, 11] and [0.1134, 0.7247, 0.1174, 0.0445]
cat 1: [192, 269, 125, 12] and [0.3211, 0.4498, 0.209, 0.0201]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [138, 624, 254, 330] and [0.1025, 0.4636, 0.1887, 0.2452]
[train epoch 8/100] | loss 1.2129 | nw acc 0.525 | time 1 min 47 sec
cat 0: [273, 49, 24, 128] and [0.5759, 0.1034, 0.0506, 0.27]
cat 1: [244, 911, 227, 467] and [0.132, 0.4927, 0.1228, 0.2526]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [594, 1145, 547, 2646] and [0.1204, 0.2322, 0.1109, 0.5365]
[test epoch 8/100] | loss 0.451 | nw acc 0.225 | time 0 min 31 sec
cat 0: [144, 519, 142, 79] and [0.1629, 0.5871, 0.1606, 0.0894]
cat 1: [85, 95, 64, 8] and [0.3373, 0.377, 0.254, 0.0317]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [129, 458, 202, 266] and [0.1223, 0.4341, 0.1915, 0.2521]
[train epoch 9/100] | loss 1.207 | nw acc 0.531 | time 1 min 47 sec
cat 0: [240, 61, 32, 111] and [0.5405, 0.1374, 0.0721, 0.25]
cat 1: [221, 924, 237, 422] and [0.1225, 0.5122, 0.1314, 0.2339]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [650, 1120, 529, 2708] and [0.1298, 0.2237, 0.1057, 0.5408]
[test epoch 9/100] | loss 0.421 | nw acc 0.344 | time 0 min 31 sec
cat 0: [48, 273, 68, 31] and [0.1143, 0.65, 0.1619, 0.0738]
cat 1: [227, 435, 189, 35] and [0.2562, 0.491, 0.2133, 0.0395]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [83, 364, 151, 287] and [0.0938, 0.4113, 0.1706, 0.3243]
[train epoch 10/100] | loss 1.1988 | nw acc 0.537 | time 1 min 44 sec
cat 0: [275, 47, 33, 135] and [0.5612, 0.0959, 0.0673, 0.2755]
cat 1: [219, 921, 220, 386] and [0.1254, 0.5275, 0.126, 0.2211]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [617, 1137, 545, 2720] and [0.1229, 0.2265, 0.1086, 0.5419]
[test epoch 10/100] | loss 0.417 | nw acc 0.346 | time 0 min 31 sec
cat 0: [92, 284, 63, 42] and [0.1913, 0.5904, 0.131, 0.0873]
cat 1: [169, 401, 147, 29] and [0.2265, 0.5375, 0.1971, 0.0389]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [97, 387, 198, 282] and [0.1006, 0.4015, 0.2054, 0.2925]
[train epoch 11/100] | loss 1.1982 | nw acc 0.537 | time 1 min 46 sec
cat 0: [276, 52, 29, 149] and [0.5455, 0.1028, 0.0573, 0.2945]
cat 1: [199, 947, 209, 394] and [0.1138, 0.5415, 0.1195, 0.2253]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [636, 1106, 560, 2698] and [0.1272, 0.2212, 0.112, 0.5396]
[test epoch 11/100] | loss 0.426 | nw acc 0.333 | time 0 min 31 sec
cat 0: [45, 308, 76, 37] and [0.0966, 0.6609, 0.1631, 0.0794]
cat 1: [237, 429, 197, 44] and [0.2613, 0.473, 0.2172, 0.0485]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [76, 335, 135, 272] and [0.0929, 0.4095, 0.165, 0.3325]
[train epoch 12/100] | loss 1.1847 | nw acc 0.553 | time 1 min 44 sec
cat 0: [309, 53, 45, 136] and [0.5691, 0.0976, 0.0829, 0.2505]
cat 1: [213, 1043, 246, 422] and [0.1107, 0.5421, 0.1279, 0.2193]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [589, 1009, 507, 2683] and [0.123, 0.2107, 0.1059, 0.5604]
[test epoch 12/100] | loss 0.404 | nw acc 0.407 | time 0 min 32 sec
cat 0: [54, 168, 19, 20] and [0.2069, 0.6437, 0.0728, 0.0766]
cat 1: [244, 570, 221, 46] and [0.2257, 0.5273, 0.2044, 0.0426]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [60, 334, 168, 287] and [0.0707, 0.3934, 0.1979, 0.338]
[train epoch 13/100] | loss 1.1976 | nw acc 0.541 | time 1 min 47 sec
cat 0: [302, 59, 46, 154] and [0.5383, 0.1052, 0.082, 0.2745]
cat 1: [199, 1026, 244, 465] and [0.1029, 0.5305, 0.1262, 0.2404]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [610, 1020, 508, 2622] and [0.1282, 0.2143, 0.1067, 0.5508]
[test epoch 13/100] | loss 0.444 | nw acc 0.257 | time 0 min 33 sec
cat 0: [208, 710, 252, 130] and [0.16, 0.5462, 0.1938, 0.1]
cat 1: [73, 148, 57, 4] and [0.2589, 0.5248, 0.2021, 0.0142]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [77, 214, 99, 219] and [0.1264, 0.3514, 0.1626, 0.3596]
[train epoch 14/100] | loss 1.191 | nw acc 0.547 | time 1 min 47 sec
cat 0: [290, 56, 60, 123] and [0.5482, 0.1059, 0.1134, 0.2325]
cat 1: [196, 1035, 242, 449] and [0.102, 0.5385, 0.1259, 0.2336]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [625, 1014, 496, 2669] and [0.1301, 0.2111, 0.1032, 0.5556]
[test epoch 14/100] | loss 0.404 | nw acc 0.424 | time 0 min 31 sec
cat 0: [56, 284, 69, 31] and [0.1273, 0.6455, 0.1568, 0.0705]
cat 1: [262, 640, 249, 69] and [0.2148, 0.5246, 0.2041, 0.0566]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [40, 148, 90, 253] and [0.0753, 0.2787, 0.1695, 0.4765]
[train epoch 15/100] | loss 1.1837 | nw acc 0.552 | time 1 min 47 sec
cat 0: [349, 81, 76, 174] and [0.5132, 0.1191, 0.1118, 0.2559]
cat 1: [195, 1022, 214, 411] and [0.1059, 0.5548, 0.1162, 0.2231]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [567, 1002, 508, 2656] and [0.1198, 0.2117, 0.1073, 0.5612]
[test epoch 15/100] | loss 0.468 | nw acc 0.175 | time 0 min 31 sec
cat 0: [46, 180, 17, 11] and [0.1811, 0.7087, 0.0669, 0.0433]
cat 1: [0, 4, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [312, 888, 391, 342] and [0.1614, 0.4594, 0.2023, 0.1769]
[train epoch 16/100] | loss 1.1752 | nw acc 0.566 | time 1 min 44 sec
cat 0: [389, 68, 70, 155] and [0.5704, 0.0997, 0.1026, 0.2273]
cat 1: [172, 1043, 228, 390] and [0.0938, 0.569, 0.1244, 0.2128]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [550, 994, 500, 2696] and [0.116, 0.2097, 0.1055, 0.5688]
[test epoch 16/100] | loss 0.406 | nw acc 0.398 | time 0 min 31 sec
cat 0: [100, 356, 97, 36] and [0.1698, 0.6044, 0.1647, 0.0611]
cat 1: [188, 533, 197, 58] and [0.1926, 0.5461, 0.2018, 0.0594]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [70, 183, 114, 259] and [0.1118, 0.2923, 0.1821, 0.4137]
[train epoch 17/100] | loss 1.1725 | nw acc 0.566 | time 1 min 45 sec
cat 0: [363, 67, 58, 134] and [0.5836, 0.1077, 0.0932, 0.2154]
cat 1: [201, 1082, 241, 424] and [0.1032, 0.5554, 0.1237, 0.2177]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [547, 956, 499, 2683] and [0.1168, 0.2041, 0.1065, 0.5727]
[test epoch 17/100] | loss 0.451 | nw acc 0.212 | time 0 min 31 sec
cat 0: [19, 47, 0, 3] and [0.2754, 0.6812, 0.0, 0.0435]
cat 1: [35, 108, 52, 2] and [0.1777, 0.5482, 0.264, 0.0102]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [304, 917, 356, 348] and [0.1579, 0.4764, 0.1849, 0.1808]
[train epoch 18/100] | loss 1.1674 | nw acc 0.574 | time 1 min 45 sec
cat 0: [389, 81, 73, 134] and [0.5746, 0.1196, 0.1078, 0.1979]
cat 1: [206, 1156, 253, 467] and [0.0989, 0.5552, 0.1215, 0.2243]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [516, 868, 472, 2640] and [0.1148, 0.1931, 0.105, 0.5872]
[test epoch 18/100] | loss 0.413 | nw acc 0.38 | time 0 min 31 sec
cat 0: [79, 397, 93, 59] and [0.1258, 0.6322, 0.1481, 0.0939]
cat 1: [254, 522, 212, 43] and [0.2464, 0.5063, 0.2056, 0.0417]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [25, 153, 103, 251] and [0.047, 0.2876, 0.1936, 0.4718]
[train epoch 19/100] | loss 1.1672 | nw acc 0.571 | time 1 min 42 sec
cat 0: [346, 73, 54, 134] and [0.57, 0.1203, 0.089, 0.2208]
cat 1: [206, 1140, 251, 424] and [0.1019, 0.5641, 0.1242, 0.2098]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [559, 892, 493, 2683] and [0.1208, 0.1928, 0.1065, 0.5799]
[test epoch 19/100] | loss 0.408 | nw acc 0.4 | time 0 min 31 sec
cat 0: [53, 276, 46, 28] and [0.1315, 0.6849, 0.1141, 0.0695]
cat 1: [262, 574, 224, 57] and [0.2346, 0.5139, 0.2005, 0.051]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [43, 222, 138, 268] and [0.0641, 0.3308, 0.2057, 0.3994]
[train epoch 20/100] | loss 1.1608 | nw acc 0.578 | time 1 min 44 sec
cat 0: [389, 50, 76, 129] and [0.604, 0.0776, 0.118, 0.2003]
cat 1: [186, 1147, 231, 429] and [0.0933, 0.5755, 0.1159, 0.2153]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [536, 908, 491, 2683] and [0.1161, 0.1966, 0.1063, 0.581]
[test epoch 20/100] | loss 0.414 | nw acc 0.385 | time 0 min 30 sec
cat 0: [145, 465, 131, 81] and [0.1764, 0.5657, 0.1594, 0.0985]
cat 1: [205, 496, 197, 50] and [0.2162, 0.5232, 0.2078, 0.0527]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [8, 111, 80, 222] and [0.019, 0.2637, 0.19, 0.5273]
[train epoch 21/100] | loss 1.1562 | nw acc 0.581 | time 1 min 44 sec
cat 0: [415, 80, 71, 136] and [0.5912, 0.114, 0.1011, 0.1937]
cat 1: [186, 1189, 237, 468] and [0.0894, 0.5716, 0.1139, 0.225]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [510, 836, 490, 2637] and [0.114, 0.1869, 0.1095, 0.5895]
[test epoch 21/100] | loss 0.414 | nw acc 0.367 | time 0 min 30 sec
cat 0: [131, 452, 108, 71] and [0.1719, 0.5932, 0.1417, 0.0932]
cat 1: [175, 440, 193, 31] and [0.2086, 0.5244, 0.23, 0.0369]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [52, 180, 107, 251] and [0.0881, 0.3051, 0.1814, 0.4254]
[train epoch 22/100] | loss 1.1552 | nw acc 0.583 | time 1 min 46 sec
cat 0: [432, 74, 77, 169] and [0.5745, 0.0984, 0.1024, 0.2247]
cat 1: [188, 1199, 241, 447] and [0.0906, 0.5778, 0.1161, 0.2154]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [491, 832, 480, 2625] and [0.1109, 0.1879, 0.1084, 0.5928]
[test epoch 22/100] | loss 0.415 | nw acc 0.36 | time 0 min 31 sec
cat 0: [71, 331, 51, 41] and [0.1437, 0.67, 0.1032, 0.083]
cat 1: [189, 464, 180, 40] and [0.2165, 0.5315, 0.2062, 0.0458]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [98, 277, 177, 272] and [0.1189, 0.3362, 0.2148, 0.3301]
[train epoch 23/100] | loss 1.1526 | nw acc 0.59 | time 1 min 44 sec
cat 0: [420, 75, 64, 159] and [0.585, 0.1045, 0.0891, 0.2214]
cat 1: [183, 1220, 232, 416] and [0.0892, 0.5948, 0.1131, 0.2028]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [508, 810, 502, 2666] and [0.1132, 0.1806, 0.1119, 0.5943]
[test epoch 23/100] | loss 0.409 | nw acc 0.392 | time 0 min 31 sec
cat 0: [177, 428, 103, 79] and [0.2249, 0.5438, 0.1309, 0.1004]
cat 1: [134, 460, 174, 34] and [0.1671, 0.5736, 0.217, 0.0424]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [47, 184, 131, 240] and [0.0781, 0.3056, 0.2176, 0.3987]
[train epoch 24/100] | loss 1.1586 | nw acc 0.581 | time 1 min 47 sec
cat 0: [415, 76, 82, 147] and [0.5764, 0.1056, 0.1139, 0.2042]
cat 1: [170, 1165, 223, 438] and [0.0852, 0.5837, 0.1117, 0.2194]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [526, 864, 493, 2656] and [0.1159, 0.1904, 0.1086, 0.5852]
[test epoch 24/100] | loss 0.4 | nw acc 0.435 | time 0 min 32 sec
cat 0: [45, 253, 83, 57] and [0.1027, 0.5776, 0.1895, 0.1301]
cat 1: [300, 761, 269, 128] and [0.2058, 0.5219, 0.1845, 0.0878]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [13, 58, 56, 168] and [0.0441, 0.1966, 0.1898, 0.5695]
[train epoch 25/100] | loss 1.1551 | nw acc 0.584 | time 1 min 45 sec
cat 0: [442, 82, 85, 154] and [0.5793, 0.1075, 0.1114, 0.2018]
cat 1: [169, 1204, 221, 469] and [0.0819, 0.5836, 0.1071, 0.2273]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [500, 819, 492, 2618] and [0.1129, 0.1849, 0.1111, 0.5911]
[test epoch 25/100] | loss 0.409 | nw acc 0.379 | time 0 min 31 sec
cat 0: [96, 290, 76, 29] and [0.1955, 0.5906, 0.1548, 0.0591]
cat 1: [184, 456, 194, 28] and [0.2135, 0.529, 0.2251, 0.0325]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [78, 326, 138, 296] and [0.0931, 0.389, 0.1647, 0.3532]
[train epoch 26/100] | loss 1.1555 | nw acc 0.583 | time 1 min 44 sec
cat 0: [412, 98, 80, 152] and [0.5553, 0.1321, 0.1078, 0.2049]
cat 1: [165, 1168, 203, 415] and [0.0846, 0.5987, 0.104, 0.2127]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [534, 839, 515, 2674] and [0.1171, 0.1839, 0.1129, 0.5861]
[test epoch 26/100] | loss 0.41 | nw acc 0.384 | time 0 min 31 sec
cat 0: [149, 432, 92, 66] and [0.2016, 0.5846, 0.1245, 0.0893]
cat 1: [133, 450, 187, 26] and [0.1671, 0.5653, 0.2349, 0.0327]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [76, 190, 129, 261] and [0.1159, 0.2896, 0.1966, 0.3979]
[train epoch 27/100] | loss 1.1433 | nw acc 0.602 | time 1 min 43 sec
cat 0: [476, 72, 72, 151] and [0.6174, 0.0934, 0.0934, 0.1958]
cat 1: [142, 1216, 224, 390] and [0.072, 0.6166, 0.1136, 0.1978]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [493, 817, 502, 2700] and [0.1093, 0.1811, 0.1113, 0.5984]
[test epoch 27/100] | loss 0.445 | nw acc 0.246 | time 0 min 31 sec
cat 0: [93, 237, 19, 12] and [0.2576, 0.6565, 0.0526, 0.0332]
cat 1: [30, 121, 44, 4] and [0.1508, 0.608, 0.2211, 0.0201]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [235, 714, 345, 337] and [0.1441, 0.4378, 0.2115, 0.2066]
[train epoch 28/100] | loss 1.144 | nw acc 0.595 | time 1 min 45 sec
cat 0: [439, 64, 82, 149] and [0.5981, 0.0872, 0.1117, 0.203]
cat 1: [174, 1230, 230, 421] and [0.0847, 0.5985, 0.1119, 0.2049]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [498, 811, 486, 2671] and [0.1115, 0.1816, 0.1088, 0.5981]
[test epoch 28/100] | loss 0.416 | nw acc 0.359 | time 0 min 32 sec
cat 0: [242, 533, 152, 81] and [0.2401, 0.5288, 0.1508, 0.0804]
cat 1: [73, 319, 121, 29] and [0.1347, 0.5886, 0.2232, 0.0535]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [43, 220, 135, 243] and [0.0671, 0.3432, 0.2106, 0.3791]
[train epoch 29/100] | loss 1.1432 | nw acc 0.597 | time 1 min 48 sec
cat 0: [449, 69, 71, 120] and [0.6333, 0.0973, 0.1001, 0.1693]
cat 1: [192, 1239, 239, 456] and [0.0903, 0.5828, 0.1124, 0.2145]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [470, 797, 488, 2665] and [0.1063, 0.1803, 0.1104, 0.6029]
[test epoch 29/100] | loss 0.408 | nw acc 0.393 | time 0 min 32 sec
cat 0: [101, 313, 52, 47] and [0.1969, 0.6101, 0.1014, 0.0916]
cat 1: [228, 518, 224, 45] and [0.2246, 0.5103, 0.2207, 0.0443]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [29, 241, 132, 261] and [0.0437, 0.3635, 0.1991, 0.3937]
[train epoch 30/100] | loss 1.1469 | nw acc 0.594 | time 1 min 47 sec
cat 0: [479, 91, 90, 174] and [0.5743, 0.1091, 0.1079, 0.2086]
cat 1: [167, 1217, 226, 426] and [0.082, 0.5977, 0.111, 0.2092]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [465, 797, 482, 2641] and [0.106, 0.1818, 0.1099, 0.6023]
[test epoch 30/100] | loss 0.451 | nw acc 0.24 | time 0 min 31 sec
cat 0: [175, 511, 121, 46] and [0.2052, 0.5991, 0.1419, 0.0539]
cat 1: [3, 55, 16, 0] and [0.0405, 0.7432, 0.2162, 0.0]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [180, 506, 271, 307] and [0.1424, 0.4003, 0.2144, 0.2429]
[train epoch 31/100] | loss 1.1311 | nw acc 0.612 | time 1 min 45 sec
cat 0: [491, 49, 59, 128] and [0.6754, 0.0674, 0.0812, 0.1761]
cat 1: [153, 1258, 222, 395] and [0.0754, 0.6203, 0.1095, 0.1948]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [467, 798, 517, 2718] and [0.1038, 0.1773, 0.1149, 0.604]
[test epoch 31/100] | loss 0.392 | nw acc 0.443 | time 0 min 31 sec
cat 0: [95, 236, 42, 20] and [0.2417, 0.6005, 0.1069, 0.0509]
cat 1: [198, 626, 234, 62] and [0.1768, 0.5589, 0.2089, 0.0554]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [65, 210, 132, 271] and [0.0959, 0.3097, 0.1947, 0.3997]
[train epoch 32/100] | loss 1.135 | nw acc 0.609 | time 1 min 45 sec
cat 0: [489, 68, 70, 151] and [0.6285, 0.0874, 0.09, 0.1941]
cat 1: [177, 1296, 244, 434] and [0.0823, 0.6025, 0.1134, 0.2018]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [445, 741, 484, 2656] and [0.1029, 0.1713, 0.1119, 0.614]
[test epoch 32/100] | loss 0.432 | nw acc 0.297 | time 0 min 32 sec
cat 0: [98, 288, 31, 32] and [0.2183, 0.6414, 0.069, 0.0713]
cat 1: [34, 261, 63, 15] and [0.0912, 0.6997, 0.1689, 0.0402]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [226, 523, 314, 306] and [0.1651, 0.382, 0.2294, 0.2235]
[train epoch 33/100] | loss 1.1313 | nw acc 0.608 | time 1 min 43 sec
cat 0: [470, 63, 69, 121] and [0.6501, 0.0871, 0.0954, 0.1674]
cat 1: [175, 1276, 254, 429] and [0.082, 0.5979, 0.119, 0.201]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [466, 766, 475, 2691] and [0.106, 0.1742, 0.108, 0.6119]
[test epoch 33/100] | loss 0.416 | nw acc 0.369 | time 0 min 32 sec
cat 0: [160, 512, 127, 106] and [0.1768, 0.5657, 0.1403, 0.1171]
cat 1: [184, 459, 207, 40] and [0.2067, 0.5157, 0.2326, 0.0449]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [14, 101, 74, 207] and [0.0354, 0.2551, 0.1869, 0.5227]
[train epoch 34/100] | loss 1.1352 | nw acc 0.603 | time 1 min 45 sec
cat 0: [458, 67, 70, 163] and [0.6042, 0.0884, 0.0923, 0.215]
cat 1: [206, 1313, 234, 448] and [0.0936, 0.5965, 0.1063, 0.2035]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [447, 725, 494, 2630] and [0.1041, 0.1688, 0.115, 0.6122]
[test epoch 34/100] | loss 0.463 | nw acc 0.186 | time 0 min 32 sec
cat 0: [27, 94, 3, 3] and [0.2126, 0.7402, 0.0236, 0.0236]
cat 1: [4, 41, 11, 1] and [0.0702, 0.7193, 0.193, 0.0175]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [327, 937, 394, 349] and [0.1629, 0.4669, 0.1963, 0.1739]
[train epoch 35/100] | loss 1.1321 | nw acc 0.611 | time 1 min 43 sec
cat 0: [520, 89, 102, 139] and [0.6118, 0.1047, 0.12, 0.1635]
cat 1: [176, 1293, 211, 457] and [0.0824, 0.6051, 0.0987, 0.2139]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [415, 723, 485, 2645] and [0.0972, 0.1694, 0.1136, 0.6197]
[test epoch 35/100] | loss 0.447 | nw acc 0.236 | time 0 min 32 sec
cat 0: [79, 247, 30, 13] and [0.2141, 0.6694, 0.0813, 0.0352]
cat 1: [22, 113, 39, 3] and [0.1243, 0.6384, 0.2203, 0.0169]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [257, 712, 339, 337] and [0.1562, 0.4328, 0.2061, 0.2049]
[train epoch 36/100] | loss 1.1325 | nw acc 0.605 | time 1 min 45 sec
cat 0: [486, 65, 69, 147] and [0.6336, 0.0847, 0.09, 0.1917]
cat 1: [182, 1297, 257, 462] and [0.0828, 0.5901, 0.1169, 0.2102]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [443, 743, 472, 2632] and [0.1033, 0.1732, 0.11, 0.6135]
[test epoch 36/100] | loss 0.41 | nw acc 0.382 | time 0 min 31 sec
cat 0: [174, 435, 93, 38] and [0.2351, 0.5878, 0.1257, 0.0514]
cat 1: [109, 388, 156, 21] and [0.1617, 0.5757, 0.2315, 0.0312]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [75, 249, 159, 294] and [0.0965, 0.3205, 0.2046, 0.3784]
[train epoch 37/100] | loss 1.1297 | nw acc 0.612 | time 1 min 42 sec
cat 0: [488, 78, 82, 173] and [0.5944, 0.095, 0.0999, 0.2107]
cat 1: [143, 1302, 249, 396] and [0.0684, 0.623, 0.1191, 0.1895]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [480, 725, 467, 2672] and [0.1105, 0.1669, 0.1075, 0.6151]
[test epoch 37/100] | loss 0.401 | nw acc 0.411 | time 0 min 31 sec
cat 0: [158, 377, 77, 43] and [0.2412, 0.5756, 0.1176, 0.0656]
cat 1: [140, 497, 185, 45] and [0.1615, 0.5732, 0.2134, 0.0519]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [60, 198, 146, 265] and [0.0897, 0.296, 0.2182, 0.3961]
[train epoch 38/100] | loss 1.1267 | nw acc 0.615 | time 1 min 44 sec
cat 0: [535, 92, 81, 167] and [0.6114, 0.1051, 0.0926, 0.1909]
cat 1: [159, 1302, 227, 422] and [0.0754, 0.6171, 0.1076, 0.2]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [417, 711, 490, 2652] and [0.0977, 0.1665, 0.1148, 0.6211]
[test epoch 38/100] | loss 0.428 | nw acc 0.313 | time 0 min 31 sec
cat 0: [190, 500, 121, 63] and [0.2174, 0.5721, 0.1384, 0.0721]
cat 1: [50, 232, 80, 10] and [0.1344, 0.6237, 0.2151, 0.0269]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [118, 340, 207, 280] and [0.1249, 0.3598, 0.219, 0.2963]
[train epoch 39/100] | loss 1.1251 | nw acc 0.617 | time 1 min 42 sec
cat 0: [527, 91, 92, 189] and [0.5862, 0.1012, 0.1023, 0.2102]
cat 1: [168, 1343, 212, 421] and [0.0784, 0.6264, 0.0989, 0.1964]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [416, 671, 494, 2631] and [0.0988, 0.1593, 0.1173, 0.6246]
[test epoch 39/100] | loss 0.43 | nw acc 0.307 | time 0 min 32 sec
cat 0: [157, 484, 127, 55] and [0.1908, 0.5881, 0.1543, 0.0668]
cat 1: [35, 250, 61, 18] and [0.0962, 0.6868, 0.1676, 0.0495]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [166, 338, 220, 280] and [0.1653, 0.3367, 0.2191, 0.2789]
[train epoch 40/100] | loss 1.1235 | nw acc 0.619 | time 1 min 45 sec
cat 0: [490, 60, 77, 128] and [0.649, 0.0795, 0.102, 0.1695]
cat 1: [182, 1358, 248, 442] and [0.0816, 0.609, 0.1112, 0.1982]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [439, 687, 473, 2671] and [0.1028, 0.1609, 0.1108, 0.6255]
[test epoch 40/100] | loss 0.414 | nw acc 0.366 | time 0 min 31 sec
cat 0: [138, 346, 40, 39] and [0.2451, 0.6146, 0.071, 0.0693]
cat 1: [118, 387, 155, 20] and [0.1735, 0.5691, 0.2279, 0.0294]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [102, 339, 213, 294] and [0.1076, 0.3576, 0.2247, 0.3101]
[train epoch 41/100] | loss 1.1217 | nw acc 0.617 | time 1 min 43 sec
cat 0: [510, 74, 75, 149] and [0.6312, 0.0916, 0.0928, 0.1844]
cat 1: [156, 1281, 229, 382] and [0.0762, 0.6255, 0.1118, 0.1865]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [445, 750, 494, 2710] and [0.1012, 0.1705, 0.1123, 0.616]
[test epoch 41/100] | loss 0.41 | nw acc 0.381 | time 0 min 32 sec
cat 0: [159, 383, 73, 46] and [0.2405, 0.5794, 0.1104, 0.0696]
cat 1: [115, 415, 154, 28] and [0.1615, 0.5829, 0.2163, 0.0393]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [84, 274, 181, 279] and [0.1027, 0.335, 0.2213, 0.3411]
[train epoch 42/100] | loss 1.1236 | nw acc 0.615 | time 1 min 46 sec
cat 0: [510, 95, 89, 167] and [0.5923, 0.1103, 0.1034, 0.194]
cat 1: [172, 1318, 224, 418] and [0.0807, 0.6182, 0.1051, 0.1961]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [429, 692, 485, 2656] and [0.1007, 0.1624, 0.1138, 0.6232]
[test epoch 42/100] | loss 0.391 | nw acc 0.448 | time 0 min 32 sec
cat 0: [83, 167, 1, 14] and [0.3132, 0.6302, 0.0038, 0.0528]
cat 1: [212, 636, 253, 54] and [0.1835, 0.5506, 0.219, 0.0468]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [63, 269, 154, 285] and [0.0817, 0.3489, 0.1997, 0.3696]
[train epoch 43/100] | loss 1.1184 | nw acc 0.623 | time 1 min 45 sec
cat 0: [514, 69, 85, 160] and [0.6208, 0.0833, 0.1027, 0.1932]
cat 1: [162, 1348, 218, 397] and [0.0762, 0.6344, 0.1026, 0.1868]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [435, 688, 495, 2684] and [0.1011, 0.1599, 0.1151, 0.6239]
[test epoch 43/100] | loss 0.406 | nw acc 0.397 | time 0 min 31 sec
cat 0: [170, 330, 61, 34] and [0.2857, 0.5546, 0.1025, 0.0571]
cat 1: [137, 426, 164, 26] and [0.1819, 0.5657, 0.2178, 0.0345]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [51, 316, 183, 293] and [0.0605, 0.3749, 0.2171, 0.3476]
[train epoch 44/100] | loss 1.1117 | nw acc 0.627 | time 1 min 42 sec
cat 0: [587, 111, 120, 189] and [0.5829, 0.1102, 0.1192, 0.1877]
cat 1: [160, 1326, 211, 387] and [0.0768, 0.6363, 0.1012, 0.1857]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [364, 668, 467, 2665] and [0.0874, 0.1604, 0.1122, 0.64]
[test epoch 44/100] | loss 0.403 | nw acc 0.404 | time 0 min 31 sec
cat 0: [206, 425, 113, 55] and [0.2578, 0.5319, 0.1414, 0.0688]
cat 1: [102, 442, 178, 40] and [0.1339, 0.5801, 0.2336, 0.0525]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [50, 205, 117, 258] and [0.0794, 0.3254, 0.1857, 0.4095]
[train epoch 45/100] | loss 1.1159 | nw acc 0.627 | time 1 min 45 sec
cat 0: [529, 83, 94, 168] and [0.6053, 0.095, 0.1076, 0.1922]
cat 1: [199, 1385, 227, 415] and [0.0894, 0.6222, 0.102, 0.1864]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [383, 637, 477, 2658] and [0.0922, 0.1533, 0.1148, 0.6397]
[test epoch 45/100] | loss 0.39 | nw acc 0.449 | time 0 min 31 sec
cat 0: [154, 281, 53, 47] and [0.2879, 0.5252, 0.0991, 0.0879]
cat 1: [164, 613, 225, 67] and [0.1534, 0.5734, 0.2105, 0.0627]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [40, 178, 130, 239] and [0.0681, 0.3032, 0.2215, 0.4072]
[train epoch 46/100] | loss 1.1159 | nw acc 0.628 | time 1 min 46 sec
cat 0: [506, 68, 90, 136] and [0.6325, 0.085, 0.1125, 0.17]
cat 1: [164, 1404, 220, 436] and [0.0737, 0.6313, 0.0989, 0.196]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [441, 633, 488, 2669] and [0.1042, 0.1496, 0.1153, 0.6308]
[test epoch 46/100] | loss 0.399 | nw acc 0.431 | time 0 min 30 sec
cat 0: [119, 326, 62, 56] and [0.2114, 0.579, 0.1101, 0.0995]
cat 1: [192, 612, 214, 62] and [0.1778, 0.5667, 0.1981, 0.0574]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [47, 134, 132, 235] and [0.0858, 0.2445, 0.2409, 0.4288]
[train epoch 47/100] | loss 1.1161 | nw acc 0.626 | time 1 min 45 sec
cat 0: [538, 93, 94, 169] and [0.6018, 0.104, 0.1051, 0.189]
cat 1: [164, 1353, 245, 394] and [0.0761, 0.6276, 0.1136, 0.1827]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [409, 659, 459, 2678] and [0.0973, 0.1567, 0.1092, 0.6369]
[test epoch 47/100] | loss 0.411 | nw acc 0.382 | time 0 min 30 sec
cat 0: [270, 592, 188, 134] and [0.228, 0.5, 0.1588, 0.1132]
cat 1: [67, 414, 143, 47] and [0.0999, 0.617, 0.2131, 0.07]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [21, 66, 77, 172] and [0.0625, 0.1964, 0.2292, 0.5119]
[train epoch 48/100] | loss 1.1092 | nw acc 0.632 | time 1 min 45 sec
cat 0: [579, 91, 108, 180] and [0.6044, 0.095, 0.1127, 0.1879]
cat 1: [135, 1362, 204, 388] and [0.0646, 0.652, 0.0977, 0.1857]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [397, 652, 486, 2673] and [0.0943, 0.1549, 0.1155, 0.6352]
[test epoch 48/100] | loss 0.396 | nw acc 0.429 | time 0 min 31 sec
cat 0: [201, 374, 111, 58] and [0.2702, 0.5027, 0.1492, 0.078]
cat 1: [121, 513, 182, 47] and [0.1402, 0.5944, 0.2109, 0.0545]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [36, 185, 115, 248] and [0.0616, 0.3168, 0.1969, 0.4247]
[train epoch 49/100] | loss 1.1051 | nw acc 0.64 | time 1 min 44 sec
cat 0: [595, 104, 128, 158] and [0.6041, 0.1056, 0.1299, 0.1604]
cat 1: [152, 1393, 215, 402] and [0.0703, 0.6443, 0.0994, 0.1859]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [364, 608, 455, 2681] and [0.0886, 0.148, 0.1108, 0.6526]
[test epoch 49/100] | loss 0.42 | nw acc 0.341 | time 0 min 31 sec
cat 0: [74, 235, 25, 7] and [0.217, 0.6891, 0.0733, 0.0205]
cat 1: [81, 364, 118, 21] and [0.1387, 0.6233, 0.2021, 0.036]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [203, 473, 265, 325] and [0.1603, 0.3736, 0.2093, 0.2567]
[train epoch 50/100] | loss 1.107 | nw acc 0.635 | time 1 min 46 sec
cat 0: [567, 81, 81, 179] and [0.6244, 0.0892, 0.0892, 0.1971]
cat 1: [165, 1384, 231, 383] and [0.0763, 0.6399, 0.1068, 0.1771]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [379, 640, 486, 2679] and [0.0906, 0.153, 0.1162, 0.6403]
[test epoch 50/100] | loss 0.405 | nw acc 0.401 | time 0 min 30 sec
cat 0: [235, 474, 112, 95] and [0.2566, 0.5175, 0.1223, 0.1037]
cat 1: [98, 469, 176, 63] and [0.1216, 0.5819, 0.2184, 0.0782]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [25, 129, 120, 195] and [0.0533, 0.2751, 0.2559, 0.4158]
[train epoch 51/100] | loss 1.1033 | nw acc 0.641 | time 1 min 45 sec
cat 0: [560, 83, 90, 160] and [0.6271, 0.0929, 0.1008, 0.1792]
cat 1: [172, 1421, 237, 386] and [0.0776, 0.6412, 0.1069, 0.1742]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [379, 601, 471, 2695] and [0.0914, 0.145, 0.1136, 0.65]
[test epoch 51/100] | loss 0.406 | nw acc 0.399 | time 0 min 31 sec
cat 0: [229, 499, 138, 104] and [0.2361, 0.5144, 0.1423, 0.1072]
cat 1: [100, 461, 164, 46] and [0.1297, 0.5979, 0.2127, 0.0597]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [29, 112, 106, 203] and [0.0644, 0.2489, 0.2356, 0.4511]
[train epoch 52/100] | loss 1.1071 | nw acc 0.636 | time 1 min 47 sec
cat 0: [558, 93, 114, 171] and [0.5962, 0.0994, 0.1218, 0.1827]
cat 1: [152, 1412, 233, 399] and [0.0692, 0.643, 0.1061, 0.1817]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [401, 600, 451, 2671] and [0.0973, 0.1455, 0.1094, 0.6478]
[test epoch 52/100] | loss 0.399 | nw acc 0.425 | time 0 min 32 sec
cat 0: [183, 412, 77, 77] and [0.2443, 0.5501, 0.1028, 0.1028]
cat 1: [144, 563, 217, 71] and [0.1447, 0.5658, 0.2181, 0.0714]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [31, 97, 114, 205] and [0.0694, 0.217, 0.255, 0.4586]
[train epoch 53/100] | loss 1.1037 | nw acc 0.637 | time 1 min 44 sec
cat 0: [561, 102, 106, 156] and [0.6065, 0.1103, 0.1146, 0.1686]
cat 1: [150, 1414, 219, 413] and [0.0683, 0.6439, 0.0997, 0.1881]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [400, 589, 473, 2672] and [0.0968, 0.1425, 0.1144, 0.6463]
[test epoch 53/100] | loss 0.418 | nw acc 0.34 | time 0 min 31 sec
cat 0: [109, 332, 54, 17] and [0.2129, 0.6484, 0.1055, 0.0332]
cat 1: [91, 333, 117, 17] and [0.1631, 0.5968, 0.2097, 0.0305]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [158, 407, 237, 319] and [0.1409, 0.3631, 0.2114, 0.2846]
[train epoch 54/100] | loss 1.1057 | nw acc 0.638 | time 1 min 42 sec
cat 0: [569, 82, 96, 164] and [0.6246, 0.09, 0.1054, 0.18]
cat 1: [157, 1409, 235, 399] and [0.0714, 0.6405, 0.1068, 0.1814]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [385, 614, 467, 2678] and [0.0929, 0.1482, 0.1127, 0.6462]
[test epoch 54/100] | loss 0.408 | nw acc 0.39 | time 0 min 31 sec
cat 0: [131, 301, 78, 29] and [0.243, 0.5584, 0.1447, 0.0538]
cat 1: [123, 439, 167, 21] and [0.164, 0.5853, 0.2227, 0.028]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [104, 332, 163, 303] and [0.1153, 0.3681, 0.1807, 0.3359]
[train epoch 55/100] | loss 1.1012 | nw acc 0.639 | time 1 min 45 sec
cat 0: [585, 90, 102, 168] and [0.619, 0.0952, 0.1079, 0.1778]
cat 1: [126, 1415, 224, 410] and [0.0579, 0.6506, 0.103, 0.1885]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [400, 600, 472, 2663] and [0.0967, 0.1451, 0.1141, 0.644]
[test epoch 55/100] | loss 0.384 | nw acc 0.484 | time 0 min 32 sec
cat 0: [91, 158, 21, 22] and [0.3116, 0.5411, 0.0719, 0.0753]
cat 1: [228, 749, 264, 87] and [0.1717, 0.564, 0.1988, 0.0655]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [39, 165, 123, 244] and [0.0683, 0.289, 0.2154, 0.4273]
[train epoch 56/100] | loss 1.1017 | nw acc 0.64 | time 1 min 42 sec
cat 0: [565, 77, 111, 171] and [0.6115, 0.0833, 0.1201, 0.1851]
cat 1: [162, 1460, 215, 428] and [0.0715, 0.6446, 0.0949, 0.189]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [384, 568, 472, 2642] and [0.0944, 0.1397, 0.1161, 0.6498]
[test epoch 56/100] | loss 0.411 | nw acc 0.38 | time 0 min 32 sec
cat 0: [240, 510, 146, 49] and [0.254, 0.5397, 0.1545, 0.0519]
cat 1: [45, 325, 109, 17] and [0.0907, 0.6552, 0.2198, 0.0343]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [73, 237, 153, 287] and [0.0973, 0.316, 0.204, 0.3827]
[train epoch 57/100] | loss 1.1019 | nw acc 0.637 | time 1 min 47 sec
cat 0: [587, 115, 129, 194] and [0.5727, 0.1122, 0.1259, 0.1893]
cat 1: [134, 1381, 210, 371] and [0.0639, 0.6589, 0.1002, 0.177]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [390, 609, 459, 2676] and [0.0943, 0.1473, 0.111, 0.6473]
[test epoch 57/100] | loss 0.431 | nw acc 0.296 | time 0 min 31 sec
cat 0: [46, 84, 2, 7] and [0.3309, 0.6043, 0.0144, 0.0504]
cat 1: [51, 273, 80, 2] and [0.1256, 0.6724, 0.197, 0.0049]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [261, 715, 326, 344] and [0.1586, 0.4344, 0.1981, 0.209]
[train epoch 58/100] | loss 1.1033 | nw acc 0.637 | time 1 min 44 sec
cat 0: [563, 74, 77, 149] and [0.6524, 0.0857, 0.0892, 0.1727]
cat 1: [155, 1386, 228, 391] and [0.0718, 0.6417, 0.1056, 0.181]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [393, 645, 493, 2701] and [0.0929, 0.1524, 0.1165, 0.6382]
[test epoch 58/100] | loss 0.419 | nw acc 0.338 | time 0 min 29 sec
cat 0: [162, 474, 103, 68] and [0.2007, 0.5874, 0.1276, 0.0843]
cat 1: [74, 350, 117, 40] and [0.1274, 0.6024, 0.2014, 0.0688]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [122, 248, 188, 245] and [0.1519, 0.3088, 0.2341, 0.3051]
[train epoch 59/100] | loss 1.0963 | nw acc 0.645 | time 1 min 47 sec
cat 0: [595, 100, 132, 183] and [0.5891, 0.099, 0.1307, 0.1812]
cat 1: [147, 1442, 217, 390] and [0.0669, 0.6566, 0.0988, 0.1776]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [369, 563, 449, 2668] and [0.0911, 0.139, 0.1109, 0.6589]
[test epoch 59/100] | loss 0.39 | nw acc 0.464 | time 0 min 31 sec
cat 0: [124, 286, 38, 35] and [0.2567, 0.5921, 0.0787, 0.0725]
cat 1: [183, 643, 243, 46] and [0.1641, 0.5767, 0.2179, 0.0413]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [51, 143, 127, 272] and [0.086, 0.2411, 0.2142, 0.4587]
[train epoch 60/100] | loss 1.0932 | nw acc 0.65 | time 1 min 45 sec
cat 0: [591, 90, 75, 166] and [0.641, 0.0976, 0.0813, 0.18]
cat 1: [163, 1446, 242, 368] and [0.0735, 0.6516, 0.1091, 0.1658]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [357, 569, 481, 2707] and [0.0868, 0.1383, 0.1169, 0.658]
[test epoch 60/100] | loss 0.389 | nw acc 0.458 | time 0 min 32 sec
cat 0: [130, 264, 40, 49] and [0.2692, 0.5466, 0.0828, 0.1014]
cat 1: [205, 695, 269, 104] and [0.161, 0.546, 0.2113, 0.0817]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [23, 113, 99, 200] and [0.0529, 0.2598, 0.2276, 0.4598]
[train epoch 61/100] | loss 1.0997 | nw acc 0.644 | time 1 min 44 sec
cat 0: [610, 85, 124, 182] and [0.6094, 0.0849, 0.1239, 0.1818]
cat 1: [140, 1434, 225, 405] and [0.0635, 0.6506, 0.1021, 0.1838]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [361, 586, 449, 2654] and [0.0891, 0.1447, 0.1109, 0.6553]
[test epoch 61/100] | loss 0.41 | nw acc 0.376 | time 0 min 31 sec
cat 0: [238, 487, 127, 41] and [0.2665, 0.5454, 0.1422, 0.0459]
cat 1: [53, 308, 132, 15] and [0.1043, 0.6063, 0.2598, 0.0295]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [67, 277, 149, 297] and [0.0848, 0.3506, 0.1886, 0.3759]
[train epoch 62/100] | loss 1.0909 | nw acc 0.652 | time 1 min 44 sec
cat 0: [638, 93, 114, 199] and [0.6111, 0.0891, 0.1092, 0.1906]
cat 1: [135, 1469, 198, 394] and [0.0615, 0.6689, 0.0902, 0.1794]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [338, 543, 486, 2648] and [0.0842, 0.1352, 0.121, 0.6595]
[test epoch 62/100] | loss 0.407 | nw acc 0.386 | time 0 min 32 sec
cat 0: [183, 415, 68, 36] and [0.2607, 0.5912, 0.0969, 0.0513]
cat 1: [70, 395, 123, 30] and [0.1133, 0.6392, 0.199, 0.0485]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [105, 262, 217, 287] and [0.1206, 0.3008, 0.2491, 0.3295]
