BenchMark(
  (conv1): Conv2d(1, 3, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (pool1): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (drop1): Dropout2d(p=0.2)
  (conv2): Conv2d(3, 16, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (pool2): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (drop2): Dropout2d(p=0.2)
  (conv3): Conv2d(16, 32, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (pool3): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (drop3): Dropout2d(p=0.2)
  (fc1): Linear(in_features=1568, out_features=4, bias=True)
  (softmax): Softmax()
)
train patients [42 40 24 53  2 55 22 17 29 18 51  8 14  5 19 43 15 46  7 45  1 34 13 44
 31  6 30 47 25 23 10 50 54  3  0]
train labels [1111 2105  798 3241]
test patients [41 48 35  4 11 32 36 12 49]
test labels [ 358 1072  408  353]

[train epoch 1/100] | loss 1.3012 | nw acc 0.44 | time 4 min 41 sec
cat 0: [6, 14, 7, 21] and [0.125, 0.2917, 0.1458, 0.4375]
cat 1: [11, 26, 11, 45] and [0.1183, 0.2796, 0.1183, 0.4839]
cat 2: [1, 2, 0, 0] and [0.3333, 0.6667, 0.0, 0.0]
cat 3: [1093, 2063, 780, 3175] and [0.1537, 0.2901, 0.1097, 0.4465]
[test epoch 1/100] | loss 0.447 | nw acc 0.158 | time 1 min 33 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [358, 1072, 408, 353] and [0.1634, 0.4893, 0.1862, 0.1611]
[train epoch 2/100] | loss 1.2861 | nw acc 0.447 | time 1 min 16 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [9, 60, 12, 43] and [0.0726, 0.4839, 0.0968, 0.3468]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1102, 2045, 786, 3198] and [0.1545, 0.2868, 0.1102, 0.4485]
[test epoch 2/100] | loss 0.456 | nw acc 0.161 | time 0 min 24 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [1, 7, 0, 0] and [0.125, 0.875, 0.0, 0.0]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [357, 1065, 408, 353] and [0.1635, 0.4879, 0.1869, 0.1617]
[train epoch 3/100] | loss 1.2605 | nw acc 0.484 | time 1 min 36 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [172, 592, 166, 300] and [0.1398, 0.4813, 0.135, 0.2439]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [939, 1513, 632, 2941] and [0.1559, 0.2511, 0.1049, 0.4881]
[test epoch 3/100] | loss 0.446 | nw acc 0.26 | time 0 min 28 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [218, 266, 96, 36] and [0.3539, 0.4318, 0.1558, 0.0584]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [140, 806, 312, 317] and [0.0889, 0.5117, 0.1981, 0.2013]
[train epoch 4/100] | loss 1.2426 | nw acc 0.505 | time 1 min 43 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [261, 828, 203, 387] and [0.1554, 0.4932, 0.1209, 0.2305]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [850, 1277, 595, 2854] and [0.1524, 0.229, 0.1067, 0.5118]
[test epoch 4/100] | loss 0.447 | nw acc 0.265 | time 0 min 37 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [231, 290, 110, 50] and [0.3392, 0.4258, 0.1615, 0.0734]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [127, 782, 298, 303] and [0.0841, 0.5179, 0.1974, 0.2007]
[train epoch 5/100] | loss 1.2368 | nw acc 0.512 | time 1 min 57 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [267, 896, 223, 404] and [0.1492, 0.5006, 0.1246, 0.2257]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [844, 1209, 575, 2837] and [0.1544, 0.2212, 0.1052, 0.5191]
[test epoch 5/100] | loss 0.455 | nw acc 0.243 | time 0 min 36 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [195, 214, 76, 23] and [0.3839, 0.4213, 0.1496, 0.0453]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [163, 858, 332, 330] and [0.0969, 0.5098, 0.1973, 0.1961]
[train epoch 6/100] | loss 1.228 | nw acc 0.519 | time 1 min 59 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [250, 944, 250, 402] and [0.1354, 0.5114, 0.1354, 0.2178]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [861, 1161, 548, 2839] and [0.1592, 0.2146, 0.1013, 0.5249]
[test epoch 6/100] | loss 0.447 | nw acc 0.268 | time 0 min 36 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [226, 284, 107, 36] and [0.3461, 0.4349, 0.1639, 0.0551]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [132, 788, 301, 317] and [0.0858, 0.5124, 0.1957, 0.2061]
[train epoch 7/100] | loss 1.2341 | nw acc 0.513 | time 1 min 57 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [284, 901, 221, 400] and [0.1573, 0.4989, 0.1224, 0.2215]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [827, 1204, 577, 2841] and [0.1518, 0.221, 0.1059, 0.5214]
[test epoch 7/100] | loss 0.449 | nw acc 0.261 | time 0 min 35 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [212, 254, 93, 23] and [0.3643, 0.4364, 0.1598, 0.0395]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [146, 818, 315, 330] and [0.0907, 0.5084, 0.1958, 0.2051]
[train epoch 8/100] | loss 1.2324 | nw acc 0.516 | time 1 min 57 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [261, 888, 212, 361] and [0.1516, 0.5157, 0.1231, 0.2096]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [850, 1217, 586, 2880] and [0.1536, 0.22, 0.1059, 0.5205]
[test epoch 8/100] | loss 0.443 | nw acc 0.276 | time 0 min 36 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [235, 311, 118, 45] and [0.3315, 0.4386, 0.1664, 0.0635]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [123, 761, 290, 308] and [0.083, 0.5135, 0.1957, 0.2078]
[train epoch 9/100] | loss 1.2279 | nw acc 0.518 | time 1 min 57 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [283, 909, 225, 374] and [0.158, 0.5075, 0.1256, 0.2088]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [828, 1196, 573, 2867] and [0.1515, 0.2189, 0.1049, 0.5247]
[test epoch 9/100] | loss 0.447 | nw acc 0.269 | time 0 min 35 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [225, 281, 103, 32] and [0.351, 0.4384, 0.1607, 0.0499]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [133, 791, 305, 321] and [0.0858, 0.5103, 0.1968, 0.2071]
[train epoch 10/100] | loss 1.2276 | nw acc 0.521 | time 1 min 58 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [268, 867, 215, 310] and [0.1614, 0.5223, 0.1295, 0.1867]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [843, 1238, 583, 2931] and [0.1507, 0.2213, 0.1042, 0.5239]
[test epoch 10/100] | loss 0.447 | nw acc 0.267 | time 0 min 36 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [217, 280, 102, 34] and [0.3428, 0.4423, 0.1611, 0.0537]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [141, 792, 306, 319] and [0.0905, 0.5083, 0.1964, 0.2047]
[train epoch 11/100] | loss 1.2287 | nw acc 0.517 | time 1 min 57 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [301, 895, 213, 364] and [0.1698, 0.5048, 0.1201, 0.2053]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [810, 1210, 585, 2877] and [0.1478, 0.2207, 0.1067, 0.5248]
[test epoch 11/100] | loss 0.449 | nw acc 0.259 | time 0 min 36 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [219, 263, 99, 35] and [0.3555, 0.4269, 0.1607, 0.0568]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [139, 809, 309, 318] and [0.0883, 0.5137, 0.1962, 0.2019]
[train epoch 12/100] | loss 1.2212 | nw acc 0.526 | time 1 min 59 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [281, 920, 222, 321] and [0.1611, 0.5275, 0.1273, 0.1841]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [830, 1185, 576, 2920] and [0.1506, 0.215, 0.1045, 0.5298]
[test epoch 12/100] | loss 0.438 | nw acc 0.292 | time 0 min 36 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [246, 366, 131, 64] and [0.3048, 0.4535, 0.1623, 0.0793]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [112, 706, 277, 289] and [0.0809, 0.5101, 0.2001, 0.2088]
[train epoch 13/100] | loss 1.2251 | nw acc 0.522 | time 1 min 59 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [271, 912, 227, 342] and [0.1547, 0.5205, 0.1296, 0.1952]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [840, 1193, 571, 2899] and [0.1526, 0.2168, 0.1038, 0.5268]
[test epoch 13/100] | loss 0.444 | nw acc 0.274 | time 0 min 37 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [227, 302, 109, 41] and [0.3343, 0.4448, 0.1605, 0.0604]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [131, 770, 299, 312] and [0.0866, 0.5093, 0.1978, 0.2063]
[train epoch 14/100] | loss 1.2194 | nw acc 0.529 | time 2 min 0 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [258, 930, 220, 312] and [0.15, 0.5407, 0.1279, 0.1814]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [853, 1175, 578, 2929] and [0.1541, 0.2123, 0.1044, 0.5292]
[test epoch 14/100] | loss 0.434 | nw acc 0.304 | time 0 min 39 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [258, 396, 147, 69] and [0.2966, 0.4552, 0.169, 0.0793]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [100, 676, 261, 284] and [0.0757, 0.5117, 0.1976, 0.215]
[train epoch 15/100] | loss 1.2076 | nw acc 0.539 | time 2 min 11 sec
cat 0: [173, 33, 46, 38] and [0.5966, 0.1138, 0.1586, 0.131]
cat 1: [217, 880, 199, 321] and [0.1342, 0.5442, 0.1231, 0.1985]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [721, 1192, 553, 2882] and [0.1348, 0.2229, 0.1034, 0.5389]
[test epoch 15/100] | loss 0.43 | nw acc 0.315 | time 0 min 36 sec
cat 0: [92, 48, 27, 20] and [0.492, 0.2567, 0.1444, 0.107]
cat 1: [198, 323, 109, 42] and [0.2946, 0.4807, 0.1622, 0.0625]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [68, 701, 272, 291] and [0.0511, 0.5263, 0.2042, 0.2185]
[train epoch 16/100] | loss 1.1956 | nw acc 0.552 | time 2 min 2 sec
cat 0: [297, 51, 89, 88] and [0.5657, 0.0971, 0.1695, 0.1676]
cat 1: [207, 876, 205, 297] and [0.1306, 0.5527, 0.1293, 0.1874]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [607, 1178, 504, 2856] and [0.118, 0.229, 0.098, 0.5551]
[test epoch 16/100] | loss 0.427 | nw acc 0.332 | time 0 min 36 sec
cat 0: [85, 82, 34, 34] and [0.3617, 0.3489, 0.1447, 0.1447]
cat 1: [218, 406, 150, 66] and [0.2595, 0.4833, 0.1786, 0.0786]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [55, 584, 224, 253] and [0.0493, 0.5233, 0.2007, 0.2267]
[train epoch 17/100] | loss 1.1884 | nw acc 0.558 | time 1 min 59 sec
cat 0: [357, 61, 98, 117] and [0.564, 0.0964, 0.1548, 0.1848]
cat 1: [181, 911, 198, 318] and [0.1126, 0.5665, 0.1231, 0.1978]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [573, 1133, 502, 2806] and [0.1143, 0.226, 0.1001, 0.5596]
[test epoch 17/100] | loss 0.43 | nw acc 0.32 | time 0 min 35 sec
cat 0: [133, 108, 61, 45] and [0.3833, 0.3112, 0.1758, 0.1297]
cat 1: [167, 337, 121, 62] and [0.2431, 0.4905, 0.1761, 0.0902]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [58, 627, 226, 246] and [0.0501, 0.5419, 0.1953, 0.2126]
[train epoch 18/100] | loss 1.1836 | nw acc 0.563 | time 2 min 0 sec
cat 0: [399, 67, 90, 121] and [0.5894, 0.099, 0.1329, 0.1787]
cat 1: [173, 886, 183, 294] and [0.1126, 0.5768, 0.1191, 0.1914]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [539, 1152, 525, 2826] and [0.1069, 0.2285, 0.1041, 0.5605]
[test epoch 18/100] | loss 0.433 | nw acc 0.311 | time 0 min 35 sec
cat 0: [116, 95, 45, 36] and [0.3973, 0.3253, 0.1541, 0.1233]
cat 1: [178, 321, 124, 57] and [0.2618, 0.4721, 0.1824, 0.0838]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [64, 656, 239, 260] and [0.0525, 0.5381, 0.1961, 0.2133]
[train epoch 19/100] | loss 1.1827 | nw acc 0.566 | time 2 min 0 sec
cat 0: [379, 60, 75, 110] and [0.6074, 0.0962, 0.1202, 0.1763]
cat 1: [182, 923, 209, 304] and [0.1125, 0.5705, 0.1292, 0.1879]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [550, 1122, 514, 2827] and [0.1097, 0.2238, 0.1025, 0.5639]
[test epoch 19/100] | loss 0.433 | nw acc 0.31 | time 0 min 38 sec
cat 0: [68, 61, 23, 21] and [0.3931, 0.3526, 0.1329, 0.1214]
cat 1: [200, 332, 135, 38] and [0.2837, 0.4709, 0.1915, 0.0539]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [90, 679, 250, 294] and [0.0685, 0.5171, 0.1904, 0.2239]
[train epoch 20/100] | loss 1.1761 | nw acc 0.574 | time 2 min 0 sec
cat 0: [416, 60, 83, 117] and [0.6154, 0.0888, 0.1228, 0.1731]
cat 1: [170, 965, 212, 318] and [0.1021, 0.5796, 0.1273, 0.191]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [525, 1080, 503, 2806] and [0.1068, 0.2198, 0.1024, 0.571]
[test epoch 20/100] | loss 0.429 | nw acc 0.327 | time 0 min 35 sec
cat 0: [95, 91, 39, 36] and [0.364, 0.3487, 0.1494, 0.1379]
cat 1: [198, 384, 166, 63] and [0.2441, 0.4735, 0.2047, 0.0777]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [65, 597, 203, 254] and [0.0581, 0.5335, 0.1814, 0.227]
[train epoch 21/100] | loss 1.1754 | nw acc 0.573 | time 1 min 58 sec
cat 0: [444, 78, 72, 124] and [0.6184, 0.1086, 0.1003, 0.1727]
cat 1: [172, 970, 226, 352] and [0.1, 0.564, 0.1314, 0.2047]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [495, 1057, 500, 2765] and [0.1028, 0.2194, 0.1038, 0.574]
[test epoch 21/100] | loss 0.434 | nw acc 0.315 | time 0 min 38 sec
cat 0: [169, 145, 79, 47] and [0.3841, 0.3295, 0.1795, 0.1068]
cat 1: [124, 266, 101, 36] and [0.2353, 0.5047, 0.1917, 0.0683]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [65, 661, 228, 270] and [0.0531, 0.54, 0.1863, 0.2206]
[train epoch 22/100] | loss 1.1711 | nw acc 0.578 | time 2 min 8 sec
cat 0: [477, 70, 87, 118] and [0.6343, 0.0931, 0.1157, 0.1569]
cat 1: [165, 908, 209, 289] and [0.105, 0.578, 0.133, 0.184]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [469, 1127, 502, 2834] and [0.0951, 0.2285, 0.1018, 0.5746]
[test epoch 22/100] | loss 0.43 | nw acc 0.324 | time 0 min 34 sec
cat 0: [108, 118, 48, 39] and [0.345, 0.377, 0.1534, 0.1246]
cat 1: [189, 362, 154, 59] and [0.2474, 0.4738, 0.2016, 0.0772]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [61, 592, 206, 255] and [0.0548, 0.5314, 0.1849, 0.2289]
[train epoch 23/100] | loss 1.1682 | nw acc 0.579 | time 2 min 3 sec
cat 0: [446, 56, 66, 116] and [0.652, 0.0819, 0.0965, 0.1696]
cat 1: [177, 965, 208, 313] and [0.1064, 0.5803, 0.1251, 0.1882]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [488, 1084, 524, 2812] and [0.0994, 0.2209, 0.1068, 0.5729]
[test epoch 23/100] | loss 0.432 | nw acc 0.312 | time 0 min 36 sec
cat 0: [175, 202, 80, 52] and [0.3438, 0.3969, 0.1572, 0.1022]
cat 1: [123, 282, 126, 59] and [0.2085, 0.478, 0.2136, 0.1]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [60, 588, 202, 242] and [0.0549, 0.5385, 0.185, 0.2216]
[train epoch 24/100] | loss 1.1709 | nw acc 0.578 | time 1 min 57 sec
cat 0: [481, 64, 68, 120] and [0.6562, 0.0873, 0.0928, 0.1637]
cat 1: [176, 934, 207, 320] and [0.1075, 0.5706, 0.1265, 0.1955]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [454, 1107, 523, 2801] and [0.0929, 0.2266, 0.1071, 0.5734]
[test epoch 24/100] | loss 0.43 | nw acc 0.318 | time 0 min 37 sec
cat 0: [113, 150, 55, 39] and [0.3165, 0.4202, 0.1541, 0.1092]
cat 1: [184, 348, 164, 63] and [0.2424, 0.4585, 0.2161, 0.083]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [61, 574, 189, 251] and [0.0567, 0.534, 0.1758, 0.2335]
[train epoch 25/100] | loss 1.1643 | nw acc 0.585 | time 2 min 4 sec
cat 0: [476, 62, 80, 115] and [0.6494, 0.0846, 0.1091, 0.1569]
cat 1: [175, 987, 229, 319] and [0.1023, 0.5772, 0.1339, 0.1865]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [460, 1056, 489, 2807] and [0.0956, 0.2195, 0.1016, 0.5833]
[test epoch 25/100] | loss 0.432 | nw acc 0.308 | time 0 min 38 sec
cat 0: [98, 78, 31, 17] and [0.4375, 0.3482, 0.1384, 0.0759]
cat 1: [182, 300, 143, 45] and [0.2716, 0.4478, 0.2134, 0.0672]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [78, 694, 234, 291] and [0.0601, 0.5351, 0.1804, 0.2244]
[train epoch 26/100] | loss 1.1647 | nw acc 0.583 | time 2 min 6 sec
cat 0: [470, 70, 59, 113] and [0.6601, 0.0983, 0.0829, 0.1587]
cat 1: [154, 960, 239, 302] and [0.0931, 0.5801, 0.1444, 0.1825]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [487, 1075, 500, 2826] and [0.0996, 0.2199, 0.1023, 0.5782]
[test epoch 26/100] | loss 0.427 | nw acc 0.325 | time 0 min 38 sec
cat 0: [85, 143, 47, 29] and [0.2796, 0.4704, 0.1546, 0.0954]
cat 1: [223, 393, 192, 73] and [0.2531, 0.4461, 0.2179, 0.0829]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [50, 536, 169, 251] and [0.0497, 0.5328, 0.168, 0.2495]
[train epoch 27/100] | loss 1.1628 | nw acc 0.585 | time 2 min 3 sec
cat 0: [480, 74, 54, 106] and [0.6723, 0.1036, 0.0756, 0.1485]
cat 1: [181, 940, 243, 286] and [0.1097, 0.5697, 0.1473, 0.1733]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [450, 1091, 501, 2849] and [0.092, 0.2231, 0.1024, 0.5825]
[test epoch 27/100] | loss 0.429 | nw acc 0.323 | time 0 min 34 sec
cat 0: [163, 158, 66, 28] and [0.3928, 0.3807, 0.159, 0.0675]
cat 1: [145, 279, 140, 43] and [0.2389, 0.4596, 0.2306, 0.0708]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [50, 635, 202, 282] and [0.0428, 0.5432, 0.1728, 0.2412]
[train epoch 28/100] | loss 1.1534 | nw acc 0.599 | time 2 min 1 sec
cat 0: [534, 71, 61, 103] and [0.6944, 0.0923, 0.0793, 0.1339]
cat 1: [162, 986, 246, 289] and [0.0963, 0.5859, 0.1462, 0.1717]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [415, 1048, 491, 2849] and [0.0864, 0.2182, 0.1022, 0.5932]
[test epoch 28/100] | loss 0.429 | nw acc 0.325 | time 0 min 39 sec
cat 0: [137, 149, 60, 27] and [0.3673, 0.3995, 0.1609, 0.0724]
cat 1: [175, 329, 164, 63] and [0.2394, 0.4501, 0.2244, 0.0862]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [46, 594, 184, 263] and [0.0423, 0.5465, 0.1693, 0.242]
[train epoch 29/100] | loss 1.156 | nw acc 0.593 | time 2 min 9 sec
cat 0: [509, 79, 78, 93] and [0.6706, 0.1041, 0.1028, 0.1225]
cat 1: [178, 968, 228, 299] and [0.1064, 0.5786, 0.1363, 0.1787]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [424, 1058, 492, 2849] and [0.0879, 0.2194, 0.102, 0.5907]
[test epoch 29/100] | loss 0.428 | nw acc 0.322 | time 0 min 37 sec
cat 0: [131, 139, 51, 21] and [0.383, 0.4064, 0.1491, 0.0614]
cat 1: [170, 308, 168, 49] and [0.2446, 0.4432, 0.2417, 0.0705]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [57, 625, 189, 283] and [0.0494, 0.5416, 0.1638, 0.2452]
[train epoch 30/100] | loss 1.1513 | nw acc 0.597 | time 2 min 3 sec
cat 0: [535, 66, 68, 118] and [0.6798, 0.0839, 0.0864, 0.1499]
cat 1: [169, 989, 228, 290] and [0.1008, 0.5901, 0.136, 0.173]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [407, 1050, 502, 2833] and [0.0849, 0.2191, 0.1048, 0.5912]
[test epoch 30/100] | loss 0.427 | nw acc 0.333 | time 0 min 36 sec
cat 0: [188, 213, 93, 37] and [0.354, 0.4011, 0.1751, 0.0697]
cat 1: [125, 294, 141, 53] and [0.2039, 0.4796, 0.23, 0.0865]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [45, 565, 174, 263] and [0.043, 0.5396, 0.1662, 0.2512]
[train epoch 31/100] | loss 1.1524 | nw acc 0.596 | time 1 min 58 sec
cat 0: [526, 56, 58, 97] and [0.7137, 0.076, 0.0787, 0.1316]
cat 1: [159, 969, 250, 288] and [0.0954, 0.5816, 0.1501, 0.1729]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [426, 1080, 490, 2856] and [0.0878, 0.2226, 0.101, 0.5886]
[test epoch 31/100] | loss 0.425 | nw acc 0.339 | time 0 min 37 sec
cat 0: [189, 211, 89, 42] and [0.3559, 0.3974, 0.1676, 0.0791]
cat 1: [132, 317, 157, 57] and [0.1991, 0.4781, 0.2368, 0.086]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [37, 544, 162, 254] and [0.0371, 0.5456, 0.1625, 0.2548]
[train epoch 32/100] | loss 1.1531 | nw acc 0.597 | time 2 min 6 sec
cat 0: [537, 62, 69, 93] and [0.7057, 0.0815, 0.0907, 0.1222]
cat 1: [158, 979, 251, 310] and [0.0931, 0.5766, 0.1478, 0.1826]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [416, 1064, 478, 2838] and [0.0867, 0.2219, 0.0997, 0.5917]
[test epoch 32/100] | loss 0.423 | nw acc 0.343 | time 0 min 39 sec
cat 0: [164, 205, 62, 33] and [0.3534, 0.4418, 0.1336, 0.0711]
cat 1: [160, 338, 181, 54] and [0.2183, 0.4611, 0.2469, 0.0737]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [34, 529, 165, 266] and [0.0342, 0.5322, 0.166, 0.2676]
[train epoch 33/100] | loss 1.1435 | nw acc 0.605 | time 2 min 8 sec
cat 0: [554, 61, 74, 95] and [0.7066, 0.0778, 0.0944, 0.1212]
cat 1: [162, 1006, 239, 289] and [0.0955, 0.5932, 0.1409, 0.1704]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [395, 1038, 485, 2857] and [0.0827, 0.2174, 0.1016, 0.5983]
[test epoch 33/100] | loss 0.421 | nw acc 0.347 | time 0 min 38 sec
cat 0: [157, 212, 66, 32] and [0.3362, 0.454, 0.1413, 0.0685]
cat 1: [174, 370, 191, 70] and [0.2161, 0.4596, 0.2373, 0.087]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [27, 490, 151, 251] and [0.0294, 0.5332, 0.1643, 0.2731]
[train epoch 34/100] | loss 1.1425 | nw acc 0.606 | time 2 min 9 sec
cat 0: [580, 76, 70, 89] and [0.7117, 0.0933, 0.0859, 0.1092]
cat 1: [147, 955, 248, 264] and [0.0911, 0.5917, 0.1537, 0.1636]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [384, 1074, 480, 2888] and [0.0796, 0.2225, 0.0995, 0.5984]
[test epoch 34/100] | loss 0.42 | nw acc 0.362 | time 0 min 35 sec
cat 0: [200, 229, 92, 42] and [0.3552, 0.4067, 0.1634, 0.0746]
cat 1: [136, 364, 177, 64] and [0.1835, 0.4912, 0.2389, 0.0864]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [22, 479, 139, 247] and [0.0248, 0.54, 0.1567, 0.2785]
[train epoch 35/100] | loss 1.1406 | nw acc 0.611 | time 1 min 59 sec
cat 0: [579, 63, 60, 78] and [0.7423, 0.0808, 0.0769, 0.1]
cat 1: [166, 1008, 278, 291] and [0.0952, 0.5783, 0.1595, 0.167]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [366, 1034, 460, 2872] and [0.0773, 0.2185, 0.0972, 0.6069]
[test epoch 35/100] | loss 0.424 | nw acc 0.348 | time 0 min 36 sec
cat 0: [207, 208, 84, 29] and [0.392, 0.3939, 0.1591, 0.0549]
cat 1: [118, 285, 145, 36] and [0.2021, 0.488, 0.2483, 0.0616]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [33, 579, 179, 288] and [0.0306, 0.5366, 0.1659, 0.2669]
[train epoch 36/100] | loss 1.1422 | nw acc 0.607 | time 2 min 1 sec
cat 0: [575, 68, 60, 101] and [0.7152, 0.0846, 0.0746, 0.1256]
cat 1: [152, 1016, 245, 300] and [0.0887, 0.5931, 0.143, 0.1751]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [384, 1021, 493, 2840] and [0.081, 0.2155, 0.1041, 0.5994]
[test epoch 36/100] | loss 0.421 | nw acc 0.35 | time 0 min 35 sec
cat 0: [175, 175, 55, 20] and [0.4118, 0.4118, 0.1294, 0.0471]
cat 1: [145, 324, 175, 47] and [0.2098, 0.4689, 0.2533, 0.068]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [38, 573, 178, 286] and [0.0353, 0.533, 0.1656, 0.266]
[train epoch 37/100] | loss 1.1403 | nw acc 0.612 | time 1 min 58 sec
cat 0: [594, 62, 67, 78] and [0.7416, 0.0774, 0.0836, 0.0974]
cat 1: [172, 1000, 237, 292] and [0.1011, 0.5879, 0.1393, 0.1717]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [345, 1043, 494, 2871] and [0.0726, 0.2194, 0.1039, 0.604]
[test epoch 37/100] | loss 0.422 | nw acc 0.349 | time 0 min 34 sec
cat 0: [190, 187, 58, 24] and [0.4139, 0.4074, 0.1264, 0.0523]
cat 1: [136, 306, 174, 44] and [0.2061, 0.4636, 0.2636, 0.0667]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [32, 579, 176, 285] and [0.0299, 0.5401, 0.1642, 0.2659]
[train epoch 38/100] | loss 1.1438 | nw acc 0.606 | time 1 min 56 sec
cat 0: [578, 62, 59, 75] and [0.7468, 0.0801, 0.0762, 0.0969]
cat 1: [163, 979, 266, 303] and [0.0953, 0.5722, 0.1555, 0.1771]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [370, 1064, 473, 2863] and [0.0776, 0.2231, 0.0992, 0.6002]
[test epoch 38/100] | loss 0.419 | nw acc 0.365 | time 0 min 39 sec
cat 0: [232, 233, 98, 43] and [0.3828, 0.3845, 0.1617, 0.071]
cat 1: [108, 335, 168, 59] and [0.1612, 0.5, 0.2507, 0.0881]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [18, 504, 142, 251] and [0.0197, 0.5508, 0.1552, 0.2743]
[train epoch 39/100] | loss 1.1368 | nw acc 0.611 | time 2 min 1 sec
cat 0: [609, 60, 82, 95] and [0.7199, 0.0709, 0.0969, 0.1123]
cat 1: [161, 1026, 244, 320] and [0.0919, 0.586, 0.1393, 0.1828]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [341, 1019, 472, 2826] and [0.0732, 0.2188, 0.1013, 0.6067]
[test epoch 39/100] | loss 0.413 | nw acc 0.374 | time 0 min 38 sec
cat 0: [179, 191, 53, 25] and [0.3996, 0.4263, 0.1183, 0.0558]
cat 1: [156, 405, 210, 74] and [0.1846, 0.4793, 0.2485, 0.0876]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [23, 476, 145, 254] and [0.0256, 0.5301, 0.1615, 0.2829]
[train epoch 40/100] | loss 1.1348 | nw acc 0.614 | time 2 min 10 sec
cat 0: [578, 65, 62, 92] and [0.7252, 0.0816, 0.0778, 0.1154]
cat 1: [172, 1057, 281, 305] and [0.0948, 0.5824, 0.1548, 0.168]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [361, 983, 455, 2844] and [0.0778, 0.2117, 0.098, 0.6125]
[test epoch 40/100] | loss 0.418 | nw acc 0.356 | time 0 min 36 sec
cat 0: [155, 150, 40, 16] and [0.4294, 0.4155, 0.1108, 0.0443]
cat 1: [168, 357, 200, 51] and [0.2165, 0.4601, 0.2577, 0.0657]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [35, 565, 168, 286] and [0.0332, 0.5361, 0.1594, 0.2713]
[train epoch 41/100] | loss 1.1348 | nw acc 0.617 | time 1 min 58 sec
cat 0: [588, 59, 64, 83] and [0.7406, 0.0743, 0.0806, 0.1045]
cat 1: [163, 1046, 243, 294] and [0.0934, 0.5991, 0.1392, 0.1684]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [360, 1000, 491, 2864] and [0.0764, 0.2121, 0.1041, 0.6074]
[test epoch 41/100] | loss 0.42 | nw acc 0.359 | time 0 min 39 sec
cat 0: [216, 193, 76, 28] and [0.4211, 0.3762, 0.1481, 0.0546]
cat 1: [110, 314, 168, 50] and [0.1713, 0.4891, 0.2617, 0.0779]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [32, 565, 164, 275] and [0.0309, 0.5454, 0.1583, 0.2654]
[train epoch 42/100] | loss 1.1294 | nw acc 0.619 | time 2 min 9 sec
cat 0: [606, 73, 60, 79] and [0.7408, 0.0892, 0.0733, 0.0966]
cat 1: [170, 1056, 245, 305] and [0.0957, 0.5946, 0.138, 0.1717]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [335, 976, 493, 2857] and [0.0719, 0.2094, 0.1058, 0.613]
[test epoch 42/100] | loss 0.413 | nw acc 0.378 | time 0 min 34 sec
cat 0: [165, 156, 40, 14] and [0.44, 0.416, 0.1067, 0.0373]
cat 1: [161, 410, 216, 68] and [0.1883, 0.4795, 0.2526, 0.0795]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [32, 506, 152, 271] and [0.0333, 0.5265, 0.1582, 0.282]
[train epoch 43/100] | loss 1.1243 | nw acc 0.622 | time 1 min 58 sec
cat 0: [629, 72, 64, 71] and [0.7524, 0.0861, 0.0766, 0.0849]
cat 1: [163, 1053, 264, 312] and [0.091, 0.5876, 0.1473, 0.1741]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [319, 980, 470, 2858] and [0.0689, 0.2118, 0.1016, 0.6177]
[test epoch 43/100] | loss 0.411 | nw acc 0.389 | time 0 min 34 sec
cat 0: [200, 211, 58, 30] and [0.4008, 0.4228, 0.1162, 0.0601]
cat 1: [135, 424, 220, 76] and [0.1579, 0.4959, 0.2573, 0.0889]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [23, 437, 130, 247] and [0.0275, 0.5221, 0.1553, 0.2951]
[train epoch 44/100] | loss 1.126 | nw acc 0.622 | time 1 min 58 sec
cat 0: [605, 45, 59, 75] and [0.7717, 0.0574, 0.0753, 0.0957]
cat 1: [150, 1076, 270, 310] and [0.0831, 0.5958, 0.1495, 0.1717]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [356, 984, 469, 2856] and [0.0763, 0.2109, 0.1005, 0.6122]
[test epoch 44/100] | loss 0.414 | nw acc 0.381 | time 0 min 35 sec
cat 0: [228, 187, 64, 26] and [0.4515, 0.3703, 0.1267, 0.0515]
cat 1: [103, 351, 194, 53] and [0.1469, 0.5007, 0.2767, 0.0756]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [27, 534, 150, 274] and [0.0274, 0.5421, 0.1523, 0.2782]
[train epoch 45/100] | loss 1.1307 | nw acc 0.619 | time 1 min 57 sec
cat 0: [619, 52, 50, 70] and [0.7826, 0.0657, 0.0632, 0.0885]
cat 1: [153, 1044, 262, 316] and [0.0862, 0.5882, 0.1476, 0.178]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [339, 1009, 486, 2855] and [0.0723, 0.2152, 0.1036, 0.6089]
[test epoch 45/100] | loss 0.413 | nw acc 0.37 | time 0 min 36 sec
cat 0: [193, 162, 44, 11] and [0.4707, 0.3951, 0.1073, 0.0268]
cat 1: [115, 330, 197, 37] and [0.1694, 0.486, 0.2901, 0.0545]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [50, 580, 167, 305] and [0.0454, 0.5263, 0.1515, 0.2768]
[train epoch 46/100] | loss 1.1257 | nw acc 0.623 | time 1 min 58 sec
cat 0: [647, 70, 77, 85] and [0.7361, 0.0796, 0.0876, 0.0967]
cat 1: [141, 1062, 253, 322] and [0.0793, 0.5973, 0.1423, 0.1811]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [323, 973, 468, 2834] and [0.0702, 0.2116, 0.1018, 0.6164]
[test epoch 46/100] | loss 0.413 | nw acc 0.377 | time 0 min 35 sec
cat 0: [226, 186, 58, 20] and [0.4612, 0.3796, 0.1184, 0.0408]
cat 1: [104, 343, 199, 58] and [0.1477, 0.4872, 0.2827, 0.0824]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [28, 543, 151, 275] and [0.0281, 0.5446, 0.1515, 0.2758]
[train epoch 47/100] | loss 1.1237 | nw acc 0.624 | time 1 min 57 sec
cat 0: [629, 57, 70, 94] and [0.74, 0.0671, 0.0824, 0.1106]
cat 1: [162, 1094, 272, 315] and [0.0879, 0.5936, 0.1476, 0.1709]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [320, 954, 456, 2832] and [0.0701, 0.2091, 0.1, 0.6208]
[test epoch 47/100] | loss 0.411 | nw acc 0.383 | time 0 min 35 sec
cat 0: [219, 185, 58, 21] and [0.4534, 0.383, 0.1201, 0.0435]
cat 1: [108, 361, 202, 54] and [0.149, 0.4979, 0.2786, 0.0745]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [31, 526, 148, 278] and [0.0315, 0.5351, 0.1506, 0.2828]
[train epoch 48/100] | loss 1.1249 | nw acc 0.623 | time 1 min 59 sec
cat 0: [622, 54, 62, 79] and [0.7613, 0.0661, 0.0759, 0.0967]
cat 1: [149, 1091, 278, 326] and [0.0808, 0.5916, 0.1508, 0.1768]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [340, 960, 458, 2836] and [0.074, 0.209, 0.0997, 0.6173]
[test epoch 48/100] | loss 0.412 | nw acc 0.381 | time 0 min 34 sec
cat 0: [236, 200, 69, 22] and [0.4478, 0.3795, 0.1309, 0.0417]
cat 1: [93, 332, 179, 46] and [0.1431, 0.5108, 0.2754, 0.0708]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [29, 540, 160, 285] and [0.0286, 0.5325, 0.1578, 0.2811]
[train epoch 49/100] | loss 1.1249 | nw acc 0.624 | time 1 min 57 sec
cat 0: [652, 68, 76, 77] and [0.7468, 0.0779, 0.0871, 0.0882]
cat 1: [146, 1050, 266, 315] and [0.0822, 0.5909, 0.1497, 0.1773]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [313, 987, 456, 2849] and [0.068, 0.2143, 0.099, 0.6187]
[test epoch 49/100] | loss 0.412 | nw acc 0.381 | time 0 min 35 sec
cat 0: [232, 199, 80, 27] and [0.4312, 0.3699, 0.1487, 0.0502]
cat 1: [97, 350, 174, 54] and [0.1437, 0.5185, 0.2578, 0.08]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [29, 523, 154, 272] and [0.0297, 0.5348, 0.1575, 0.2781]
[train epoch 50/100] | loss 1.1201 | nw acc 0.629 | time 1 min 58 sec
cat 0: [629, 62, 60, 84] and [0.7533, 0.0743, 0.0719, 0.1006]
cat 1: [130, 1115, 256, 312] and [0.0717, 0.615, 0.1412, 0.1721]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [352, 928, 482, 2845] and [0.0764, 0.2014, 0.1046, 0.6175]
[test epoch 50/100] | loss 0.417 | nw acc 0.364 | time 0 min 38 sec
cat 0: [226, 182, 68, 27] and [0.4493, 0.3618, 0.1352, 0.0537]
cat 1: [99, 302, 166, 39] and [0.1634, 0.4983, 0.2739, 0.0644]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [33, 588, 174, 287] and [0.0305, 0.5434, 0.1608, 0.2652]
[train epoch 51/100] | loss 1.1174 | nw acc 0.633 | time 2 min 9 sec
cat 0: [649, 54, 71, 71] and [0.768, 0.0639, 0.084, 0.084]
cat 1: [138, 1088, 267, 291] and [0.0774, 0.6099, 0.1497, 0.1631]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [324, 963, 460, 2879] and [0.07, 0.2082, 0.0994, 0.6224]
[test epoch 51/100] | loss 0.408 | nw acc 0.396 | time 0 min 34 sec
cat 0: [220, 186, 67, 21] and [0.4453, 0.3765, 0.1356, 0.0425]
cat 1: [109, 392, 205, 58] and [0.1427, 0.5131, 0.2683, 0.0759]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [29, 494, 136, 274] and [0.0311, 0.5295, 0.1458, 0.2937]
[train epoch 52/100] | loss 1.1156 | nw acc 0.634 | time 1 min 58 sec
cat 0: [646, 59, 71, 68] and [0.7654, 0.0699, 0.0841, 0.0806]
cat 1: [128, 1112, 257, 304] and [0.0711, 0.6174, 0.1427, 0.1688]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [337, 934, 470, 2869] and [0.0731, 0.2026, 0.102, 0.6223]
[test epoch 52/100] | loss 0.411 | nw acc 0.384 | time 0 min 34 sec
cat 0: [239, 193, 70, 21] and [0.457, 0.369, 0.1338, 0.0402]
cat 1: [88, 339, 188, 50] and [0.1323, 0.5098, 0.2827, 0.0752]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [31, 540, 150, 282] and [0.0309, 0.5384, 0.1496, 0.2812]
[train epoch 53/100] | loss 1.1184 | nw acc 0.631 | time 2 min 0 sec
cat 0: [671, 55, 79, 87] and [0.7522, 0.0617, 0.0886, 0.0975]
cat 1: [131, 1095, 268, 313] and [0.0725, 0.606, 0.1483, 0.1732]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [309, 955, 451, 2841] and [0.0678, 0.2096, 0.099, 0.6236]
[test epoch 53/100] | loss 0.408 | nw acc 0.395 | time 0 min 37 sec
cat 0: [220, 172, 59, 19] and [0.4681, 0.366, 0.1255, 0.0404]
cat 1: [109, 390, 209, 59] and [0.1421, 0.5085, 0.2725, 0.0769]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [29, 510, 140, 275] and [0.0304, 0.5346, 0.1468, 0.2883]
[train epoch 54/100] | loss 1.1142 | nw acc 0.634 | time 2 min 12 sec
cat 0: [659, 69, 75, 79] and [0.7472, 0.0782, 0.085, 0.0896]
cat 1: [133, 1115, 265, 309] and [0.073, 0.612, 0.1454, 0.1696]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [319, 921, 458, 2853] and [0.0701, 0.2024, 0.1006, 0.6269]
[test epoch 54/100] | loss 0.411 | nw acc 0.385 | time 0 min 34 sec
cat 0: [210, 145, 46, 13] and [0.5072, 0.3502, 0.1111, 0.0314]
cat 1: [113, 366, 208, 53] and [0.1527, 0.4946, 0.2811, 0.0716]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [35, 561, 154, 287] and [0.0338, 0.541, 0.1485, 0.2768]
[train epoch 55/100] | loss 1.1137 | nw acc 0.635 | time 1 min 59 sec
cat 0: [668, 60, 76, 62] and [0.7714, 0.0693, 0.0878, 0.0716]
cat 1: [125, 1122, 264, 336] and [0.0677, 0.6075, 0.1429, 0.1819]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [318, 923, 458, 2843] and [0.07, 0.2032, 0.1008, 0.6259]
[test epoch 55/100] | loss 0.415 | nw acc 0.372 | time 0 min 36 sec
cat 0: [236, 196, 75, 25] and [0.4436, 0.3684, 0.141, 0.047]
cat 1: [92, 311, 169, 42] and [0.1498, 0.5065, 0.2752, 0.0684]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [30, 565, 164, 286] and [0.0287, 0.5407, 0.1569, 0.2737]
[train epoch 56/100] | loss 1.1124 | nw acc 0.636 | time 2 min 0 sec
cat 0: [680, 45, 100, 69] and [0.7606, 0.0503, 0.1119, 0.0772]
cat 1: [136, 1107, 268, 317] and [0.0744, 0.6056, 0.1466, 0.1734]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [295, 953, 430, 2855] and [0.0651, 0.2102, 0.0949, 0.6298]
[test epoch 56/100] | loss 0.409 | nw acc 0.391 | time 0 min 36 sec
cat 0: [228, 191, 70, 22] and [0.4462, 0.3738, 0.137, 0.0431]
cat 1: [103, 373, 198, 56] and [0.1411, 0.511, 0.2712, 0.0767]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [27, 508, 140, 275] and [0.0284, 0.5347, 0.1474, 0.2895]
[train epoch 57/100] | loss 1.1102 | nw acc 0.642 | time 1 min 59 sec
cat 0: [674, 63, 73, 67] and [0.7685, 0.0718, 0.0832, 0.0764]
cat 1: [131, 1118, 273, 283] and [0.0726, 0.6194, 0.1512, 0.1568]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [306, 924, 452, 2891] and [0.0669, 0.2021, 0.0988, 0.6322]
[test epoch 57/100] | loss 0.412 | nw acc 0.38 | time 0 min 36 sec
cat 0: [230, 179, 68, 15] and [0.4675, 0.3638, 0.1382, 0.0305]
cat 1: [92, 324, 179, 41] and [0.1447, 0.5094, 0.2814, 0.0645]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [36, 569, 161, 297] and [0.0339, 0.5353, 0.1515, 0.2794]
