AlexNet(
  (conv1): Sequential(
    (0): Conv2d(3, 64, kernel_size=(11, 11), stride=(4, 4), padding=(2, 2))
    (1): ReLU(inplace)
    (2): MaxPool2d(kernel_size=3, stride=2, padding=0, dilation=1, ceil_mode=False)
  )
  (conv2): Sequential(
    (0): Conv2d(64, 192, kernel_size=(5, 5), stride=(1, 1), padding=(2, 2))
    (1): ReLU(inplace)
    (2): MaxPool2d(kernel_size=3, stride=2, padding=0, dilation=1, ceil_mode=False)
  )
  (conv3): Sequential(
    (0): Conv2d(192, 384, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    (1): ReLU(inplace)
  )
  (conv4): Sequential(
    (0): Conv2d(384, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    (1): ReLU(inplace)
  )
  (conv5): Sequential(
    (0): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    (1): ReLU(inplace)
    (2): MaxPool2d(kernel_size=3, stride=2, padding=0, dilation=1, ceil_mode=False)
  )
  (fc1): Sequential(
    (0): Dropout(p=0.5)
    (1): Linear(in_features=9216, out_features=4096, bias=True)
    (2): ReLU(inplace)
  )
  (fc2): Sequential(
    (0): Dropout(p=0.5)
    (1): Linear(in_features=4096, out_features=4096, bias=True)
    (2): ReLU(inplace)
  )
  (fc3): Sequential(
    (0): Linear(in_features=4096, out_features=4, bias=True)
    (1): Softmax()
  )
)
Child conv1 layer 0 param is frozen
Child conv1 layer 0 param is frozen
Child conv2 layer 0 param is frozen
Child conv2 layer 0 param is frozen
Child conv3 layer 0 param is not frozen
Child conv3 layer 0 param is not frozen
Child conv4 layer 0 param is not frozen
Child conv4 layer 0 param is not frozen
Child conv5 layer 0 param is not frozen
Child conv5 layer 0 param is not frozen
Child fc1 layer 1 param is not frozen
Child fc1 layer 1 param is not frozen
Child fc2 layer 1 param is not frozen
Child fc2 layer 1 param is not frozen
Child fc3 layer 0 param is not frozen
Child fc3 layer 0 param is not frozen
train patients [14 11  3 24 45 50 22 19 47  4 30  7  1 55 17 53 18 41 44  0  5 25 12  2
 54  6 32 34 35 13 42 10 51 49 23]
train labels [1065 2180 1206 2744]
test patients [48 46 31 36 15 40 29  8 43]
test labels [404 997   0 850]

[train epoch 1/100] | loss 1.1701 | nw acc 0.565 | time 4 min 1 sec
cat 0: [496, 99, 61, 128] and [0.6327, 0.1263, 0.0778, 0.1633]
cat 1: [183, 1433, 353, 460] and [0.0753, 0.59, 0.1453, 0.1894]
cat 2: [1, 1, 4, 3] and [0.1111, 0.1111, 0.4444, 0.3333]
cat 3: [385, 647, 788, 2153] and [0.0969, 0.1628, 0.1983, 0.5419]
[test epoch 1/100] | loss 47.9 | nw acc 0.405 | time 1 min 11 sec
cat 0: [1, 34, 0, 0] and [0.0286, 0.9714, 0.0, 0.0]
cat 1: [0, 81, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [403, 882, 0, 850] and [0.1888, 0.4131, 0.0, 0.3981]
[train epoch 2/100] | loss 1.0661 | nw acc 0.677 | time 4 min 9 sec
cat 0: [826, 93, 113, 120] and [0.717, 0.0807, 0.0981, 0.1042]
cat 1: [71, 1717, 327, 270] and [0.0298, 0.7199, 0.1371, 0.1132]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [168, 370, 766, 2354] and [0.0459, 0.1011, 0.2094, 0.6435]
[test epoch 2/100] | loss 41.2 | nw acc 0.573 | time 1 min 9 sec
cat 0: [55, 147, 0, 20] and [0.2477, 0.6622, 0.0, 0.0901]
cat 1: [1, 460, 0, 24] and [0.0021, 0.9485, 0.0, 0.0495]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [348, 390, 0, 806] and [0.2254, 0.2526, 0.0, 0.522]
[train epoch 3/100] | loss 1.0174 | nw acc 0.724 | time 4 min 3 sec
cat 0: [925, 43, 107, 104] and [0.7846, 0.0365, 0.0908, 0.0882]
cat 1: [35, 1860, 362, 190] and [0.0143, 0.7601, 0.1479, 0.0776]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [105, 277, 737, 2450] and [0.0294, 0.0776, 0.2065, 0.6865]
[test epoch 3/100] | loss 38.3 | nw acc 0.647 | time 1 min 12 sec
cat 0: [43, 103, 0, 17] and [0.2638, 0.6319, 0.0, 0.1043]
cat 1: [5, 676, 0, 61] and [0.0067, 0.9111, 0.0, 0.0822]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [356, 218, 0, 772] and [0.2645, 0.162, 0.0, 0.5736]
[train epoch 4/100] | loss 0.98522 | nw acc 0.756 | time 4 min 9 sec
cat 0: [954, 31, 117, 88] and [0.8017, 0.0261, 0.0983, 0.0739]
cat 1: [26, 1913, 323, 149] and [0.0108, 0.7934, 0.134, 0.0618]
cat 2: [17, 27, 160, 64] and [0.0634, 0.1007, 0.597, 0.2388]
cat 3: [68, 209, 606, 2443] and [0.0204, 0.0628, 0.1822, 0.7345]
[test epoch 4/100] | loss 45.2 | nw acc 0.461 | time 1 min 19 sec
cat 0: [0, 20, 0, 1] and [0.0, 0.9524, 0.0, 0.0476]
cat 1: [0, 294, 0, 13] and [0.0, 0.9577, 0.0, 0.0423]
cat 2: [67, 427, 0, 69] and [0.119, 0.7584, 0.0, 0.1226]
cat 3: [337, 256, 0, 767] and [0.2478, 0.1882, 0.0, 0.564]
[train epoch 5/100] | loss 0.93882 | nw acc 0.806 | time 3 min 59 sec
cat 0: [948, 33, 73, 73] and [0.8412, 0.0293, 0.0648, 0.0648]
cat 1: [19, 1867, 223, 121] and [0.0085, 0.8372, 0.1, 0.0543]
cat 2: [30, 58, 643, 177] and [0.033, 0.0639, 0.7081, 0.1949]
cat 3: [68, 222, 267, 2373] and [0.0232, 0.0758, 0.0911, 0.8099]
[test epoch 5/100] | loss 46.5 | nw acc 0.431 | time 1 min 14 sec
cat 0: [21, 52, 0, 10] and [0.253, 0.6265, 0.0, 0.1205]
cat 1: [0, 251, 0, 8] and [0.0, 0.9691, 0.0, 0.0309]
cat 2: [117, 526, 0, 112] and [0.155, 0.6967, 0.0, 0.1483]
cat 3: [266, 168, 0, 720] and [0.2305, 0.1456, 0.0, 0.6239]
[train epoch 6/100] | loss 0.91465 | nw acc 0.829 | time 3 min 58 sec
cat 0: [946, 36, 55, 69] and [0.8553, 0.0325, 0.0497, 0.0624]
cat 1: [26, 1887, 201, 106] and [0.0117, 0.85, 0.0905, 0.0477]
cat 2: [30, 79, 749, 153] and [0.0297, 0.0781, 0.7409, 0.1513]
cat 3: [63, 178, 201, 2416] and [0.022, 0.0623, 0.0703, 0.8453]
[test epoch 6/100] | loss 41 | nw acc 0.57 | time 1 min 5 sec
cat 0: [27, 43, 0, 18] and [0.3068, 0.4886, 0.0, 0.2045]
cat 1: [1, 519, 0, 45] and [0.0018, 0.9186, 0.0, 0.0796]
cat 2: [2, 276, 0, 20] and [0.0067, 0.9262, 0.0, 0.0671]
cat 3: [374, 159, 0, 767] and [0.2877, 0.1223, 0.0, 0.59]
[train epoch 7/100] | loss 0.89437 | nw acc 0.847 | time 3 min 50 sec
cat 0: [965, 21, 48, 45] and [0.8943, 0.0195, 0.0445, 0.0417]
cat 1: [17, 1914, 177, 106] and [0.0077, 0.8645, 0.0799, 0.0479]
cat 2: [23, 61, 795, 144] and [0.0225, 0.0596, 0.7771, 0.1408]
cat 3: [60, 184, 186, 2449] and [0.0208, 0.0639, 0.0646, 0.8506]
[test epoch 7/100] | loss 41.4 | nw acc 0.556 | time 1 min 11 sec
cat 0: [170, 183, 0, 65] and [0.4067, 0.4378, 0.0, 0.1555]
cat 1: [6, 469, 0, 69] and [0.011, 0.8621, 0.0, 0.1268]
cat 2: [58, 314, 0, 74] and [0.13, 0.704, 0.0, 0.1659]
cat 3: [170, 31, 0, 642] and [0.2017, 0.0368, 0.0, 0.7616]
[train epoch 8/100] | loss 0.88317 | nw acc 0.861 | time 3 min 51 sec
cat 0: [987, 16, 37, 53] and [0.903, 0.0146, 0.0339, 0.0485]
cat 1: [17, 1911, 142, 104] and [0.0078, 0.879, 0.0653, 0.0478]
cat 2: [24, 70, 864, 123] and [0.0222, 0.0648, 0.7993, 0.1138]
cat 3: [37, 183, 163, 2464] and [0.013, 0.0643, 0.0573, 0.8655]
[test epoch 8/100] | loss 42.2 | nw acc 0.534 | time 1 min 9 sec
cat 0: [79, 79, 0, 24] and [0.4341, 0.4341, 0.0, 0.1319]
cat 1: [4, 455, 0, 34] and [0.0081, 0.9229, 0.0, 0.069]
cat 2: [56, 370, 0, 96] and [0.1073, 0.7088, 0.0, 0.1839]
cat 3: [265, 93, 0, 696] and [0.2514, 0.0882, 0.0, 0.6603]
[train epoch 9/100] | loss 0.86852 | nw acc 0.875 | time 3 min 56 sec
cat 0: [1000, 18, 39, 40] and [0.9116, 0.0164, 0.0356, 0.0365]
cat 1: [12, 1953, 153, 98] and [0.0054, 0.8813, 0.069, 0.0442]
cat 2: [17, 51, 877, 108] and [0.0161, 0.0484, 0.8329, 0.1026]
cat 3: [36, 158, 137, 2498] and [0.0127, 0.0559, 0.0484, 0.883]
[test epoch 9/100] | loss 42.3 | nw acc 0.526 | time 1 min 10 sec
cat 0: [126, 178, 0, 43] and [0.3631, 0.513, 0.0, 0.1239]
cat 1: [1, 389, 0, 30] and [0.0024, 0.9262, 0.0, 0.0714]
cat 2: [32, 358, 0, 81] and [0.0679, 0.7601, 0.0, 0.172]
cat 3: [245, 72, 0, 696] and [0.2419, 0.0711, 0.0, 0.6871]
[train epoch 10/100] | loss 0.86172 | nw acc 0.879 | time 4 min 2 sec
cat 0: [1000, 18, 41, 50] and [0.9017, 0.0162, 0.037, 0.0451]
cat 1: [11, 1956, 137, 86] and [0.005, 0.8932, 0.0626, 0.0393]
cat 2: [29, 60, 889, 95] and [0.027, 0.0559, 0.8285, 0.0885]
cat 3: [25, 146, 139, 2513] and [0.0089, 0.0517, 0.0492, 0.8902]
[test epoch 10/100] | loss 44.5 | nw acc 0.483 | time 1 min 9 sec
cat 0: [171, 140, 0, 62] and [0.4584, 0.3753, 0.0, 0.1662]
cat 1: [2, 381, 0, 24] and [0.0049, 0.9361, 0.0, 0.059]
cat 2: [147, 429, 0, 204] and [0.1885, 0.55, 0.0, 0.2615]
cat 3: [84, 47, 0, 560] and [0.1216, 0.068, 0.0, 0.8104]
[train epoch 11/100] | loss 0.85106 | nw acc 0.892 | time 3 min 48 sec
cat 0: [1006, 22, 30, 39] and [0.917, 0.0201, 0.0273, 0.0356]
cat 1: [11, 1975, 115, 76] and [0.0051, 0.9072, 0.0528, 0.0349]
cat 2: [26, 48, 933, 91] and [0.0237, 0.0437, 0.8497, 0.0829]
cat 3: [22, 135, 128, 2538] and [0.0078, 0.0478, 0.0453, 0.899]
[test epoch 11/100] | loss 41.9 | nw acc 0.543 | time 1 min 6 sec
cat 0: [241, 223, 0, 75] and [0.4471, 0.4137, 0.0, 0.1391]
cat 1: [2, 368, 0, 41] and [0.0049, 0.8954, 0.0, 0.0998]
cat 2: [43, 357, 0, 91] and [0.0876, 0.7271, 0.0, 0.1853]
cat 3: [118, 49, 0, 643] and [0.1457, 0.0605, 0.0, 0.7938]
[train epoch 12/100] | loss 0.842 | nw acc 0.901 | time 4 min 3 sec
cat 0: [1010, 13, 29, 30] and [0.9335, 0.012, 0.0268, 0.0277]
cat 1: [8, 1993, 122, 66] and [0.0037, 0.9105, 0.0557, 0.0302]
cat 2: [22, 51, 944, 82] and [0.02, 0.0464, 0.859, 0.0746]
cat 3: [25, 123, 111, 2566] and [0.0088, 0.0435, 0.0393, 0.9083]
[test epoch 12/100] | loss 42.2 | nw acc 0.533 | time 1 min 12 sec
cat 0: [93, 115, 0, 30] and [0.3908, 0.4832, 0.0, 0.1261]
cat 1: [1, 422, 0, 30] and [0.0022, 0.9316, 0.0, 0.0662]
cat 2: [16, 366, 0, 78] and [0.0348, 0.7957, 0.0, 0.1696]
cat 3: [294, 94, 0, 712] and [0.2673, 0.0855, 0.0, 0.6473]
[train epoch 13/100] | loss 0.84725 | nw acc 0.896 | time 3 min 47 sec
cat 0: [1015, 16, 28, 39] and [0.9244, 0.0146, 0.0255, 0.0355]
cat 1: [9, 1989, 127, 75] and [0.0041, 0.9041, 0.0577, 0.0341]
cat 2: [23, 49, 934, 88] and [0.021, 0.0448, 0.8537, 0.0804]
cat 3: [18, 126, 117, 2542] and [0.0064, 0.045, 0.0417, 0.9069]
[test epoch 13/100] | loss 43 | nw acc 0.512 | time 1 min 9 sec
cat 0: [119, 191, 0, 40] and [0.34, 0.5457, 0.0, 0.1143]
cat 1: [0, 333, 0, 20] and [0.0, 0.9433, 0.0, 0.0567]
cat 2: [2, 362, 0, 63] and [0.0047, 0.8478, 0.0, 0.1475]
cat 3: [283, 111, 0, 727] and [0.2525, 0.099, 0.0, 0.6485]
[train epoch 14/100] | loss 0.8353 | nw acc 0.906 | time 4 min 4 sec
cat 0: [1018, 14, 30, 29] and [0.9331, 0.0128, 0.0275, 0.0266]
cat 1: [12, 1995, 114, 84] and [0.0054, 0.9048, 0.0517, 0.0381]
cat 2: [24, 43, 967, 61] and [0.0219, 0.0393, 0.8831, 0.0557]
cat 3: [11, 128, 95, 2570] and [0.0039, 0.0456, 0.0339, 0.9165]
[test epoch 14/100] | loss 41.3 | nw acc 0.562 | time 1 min 9 sec
cat 0: [278, 260, 0, 73] and [0.455, 0.4255, 0.0, 0.1195]
cat 1: [0, 314, 0, 28] and [0.0, 0.9181, 0.0, 0.0819]
cat 2: [1, 334, 0, 47] and [0.0026, 0.8743, 0.0, 0.123]
cat 3: [125, 89, 0, 702] and [0.1365, 0.0972, 0.0, 0.7664]
[train epoch 15/100] | loss 0.83389 | nw acc 0.907 | time 3 min 59 sec
cat 0: [1006, 8, 30, 39] and [0.9289, 0.0074, 0.0277, 0.036]
cat 1: [9, 1994, 110, 58] and [0.0041, 0.9185, 0.0507, 0.0267]
cat 2: [22, 36, 974, 58] and [0.0202, 0.033, 0.8936, 0.0532]
cat 3: [28, 142, 92, 2589] and [0.0098, 0.0498, 0.0323, 0.9081]
[test epoch 15/100] | loss 43.8 | nw acc 0.504 | time 1 min 10 sec
cat 0: [224, 270, 0, 66] and [0.4, 0.4821, 0.0, 0.1179]
cat 1: [0, 257, 0, 20] and [0.0, 0.9278, 0.0, 0.0722]
cat 2: [36, 399, 0, 84] and [0.0694, 0.7688, 0.0, 0.1618]
cat 3: [144, 71, 0, 680] and [0.1609, 0.0793, 0.0, 0.7598]
[train epoch 16/100] | loss 0.82864 | nw acc 0.915 | time 3 min 52 sec
cat 0: [1019, 16, 31, 29] and [0.9306, 0.0146, 0.0283, 0.0265]
cat 1: [9, 2017, 101, 74] and [0.0041, 0.9164, 0.0459, 0.0336]
cat 2: [18, 41, 988, 51] and [0.0164, 0.0373, 0.8998, 0.0464]
cat 3: [19, 106, 86, 2590] and [0.0068, 0.0378, 0.0307, 0.9247]
[test epoch 16/100] | loss 43.6 | nw acc 0.511 | time 1 min 9 sec
cat 0: [59, 53, 0, 17] and [0.4574, 0.4109, 0.0, 0.1318]
cat 1: [0, 364, 0, 15] and [0.0, 0.9604, 0.0, 0.0396]
cat 2: [2, 379, 0, 64] and [0.0045, 0.8517, 0.0, 0.1438]
cat 3: [343, 201, 0, 754] and [0.2643, 0.1549, 0.0, 0.5809]
[train epoch 17/100] | loss 0.82424 | nw acc 0.919 | time 4 min 0 sec
cat 0: [1033, 11, 21, 25] and [0.9477, 0.0101, 0.0193, 0.0229]
cat 1: [8, 2024, 111, 64] and [0.0036, 0.9171, 0.0503, 0.029]
cat 2: [16, 38, 986, 53] and [0.0146, 0.0348, 0.9021, 0.0485]
cat 3: [8, 107, 88, 2602] and [0.0029, 0.0381, 0.0314, 0.9276]
[test epoch 17/100] | loss 42 | nw acc 0.541 | time 1 min 9 sec
cat 0: [91, 122, 0, 23] and [0.3856, 0.5169, 0.0, 0.0975]
cat 1: [0, 413, 0, 24] and [0.0, 0.9451, 0.0, 0.0549]
cat 2: [5, 356, 0, 60] and [0.0119, 0.8456, 0.0, 0.1425]
cat 3: [308, 106, 0, 743] and [0.2662, 0.0916, 0.0, 0.6422]
[train epoch 18/100] | loss 0.82344 | nw acc 0.918 | time 4 min 4 sec
cat 0: [1034, 11, 32, 24] and [0.9391, 0.01, 0.0291, 0.0218]
cat 1: [8, 2041, 114, 68] and [0.0036, 0.9148, 0.0511, 0.0305]
cat 2: [11, 30, 969, 58] and [0.0103, 0.0281, 0.9073, 0.0543]
cat 3: [12, 98, 91, 2594] and [0.0043, 0.0351, 0.0326, 0.9281]
[test epoch 18/100] | loss 42 | nw acc 0.547 | time 1 min 12 sec
cat 0: [77, 41, 0, 21] and [0.554, 0.295, 0.0, 0.1511]
cat 1: [10, 522, 0, 60] and [0.0169, 0.8818, 0.0, 0.1014]
cat 2: [57, 388, 0, 107] and [0.1033, 0.7029, 0.0, 0.1938]
cat 3: [260, 46, 0, 662] and [0.2686, 0.0475, 0.0, 0.6839]
[train epoch 19/100] | loss 0.81744 | nw acc 0.924 | time 3 min 48 sec
cat 0: [1031, 11, 31, 20] and [0.9433, 0.0101, 0.0284, 0.0183]
cat 1: [10, 2032, 106, 58] and [0.0045, 0.9211, 0.0481, 0.0263]
cat 2: [14, 32, 996, 42] and [0.0129, 0.0295, 0.9188, 0.0387]
cat 3: [10, 105, 73, 2624] and [0.0036, 0.0373, 0.026, 0.9331]
[test epoch 19/100] | loss 40.9 | nw acc 0.576 | time 1 min 5 sec
cat 0: [81, 49, 0, 23] and [0.5294, 0.3203, 0.0, 0.1503]
cat 1: [12, 557, 0, 68] and [0.0188, 0.8744, 0.0, 0.1068]
cat 2: [3, 338, 0, 69] and [0.0073, 0.8244, 0.0, 0.1683]
cat 3: [308, 53, 0, 690] and [0.2931, 0.0504, 0.0, 0.6565]
[train epoch 20/100] | loss 0.81854 | nw acc 0.921 | time 4 min 0 sec
cat 0: [1032, 10, 21, 22] and [0.9512, 0.0092, 0.0194, 0.0203]
cat 1: [12, 2039, 100, 71] and [0.0054, 0.9176, 0.045, 0.032]
cat 2: [14, 38, 995, 54] and [0.0127, 0.0345, 0.9037, 0.049]
cat 3: [7, 93, 90, 2597] and [0.0025, 0.0334, 0.0323, 0.9318]
[test epoch 20/100] | loss 39.7 | nw acc 0.609 | time 1 min 11 sec
cat 0: [152, 60, 0, 31] and [0.6255, 0.2469, 0.0, 0.1276]
cat 1: [33, 584, 0, 79] and [0.0474, 0.8391, 0.0, 0.1135]
cat 2: [20, 311, 0, 73] and [0.0495, 0.7698, 0.0, 0.1807]
cat 3: [199, 42, 0, 667] and [0.2192, 0.0463, 0.0, 0.7346]
[train epoch 21/100] | loss 0.8125 | nw acc 0.93 | time 4 min 6 sec
cat 0: [1040, 10, 20, 17] and [0.9568, 0.0092, 0.0184, 0.0156]
cat 1: [5, 2051, 102, 63] and [0.0023, 0.9235, 0.0459, 0.0284]
cat 2: [13, 36, 1011, 42] and [0.0118, 0.0327, 0.9174, 0.0381]
cat 3: [7, 83, 73, 2622] and [0.0025, 0.0298, 0.0262, 0.9415]
[test epoch 21/100] | loss 40.2 | nw acc 0.594 | time 1 min 5 sec
cat 0: [67, 38, 0, 17] and [0.5492, 0.3115, 0.0, 0.1393]
cat 1: [2, 537, 0, 33] and [0.0035, 0.9388, 0.0, 0.0577]
cat 2: [0, 315, 0, 35] and [0.0, 0.9, 0.0, 0.1]
cat 3: [335, 107, 0, 765] and [0.2775, 0.0886, 0.0, 0.6338]
[train epoch 22/100] | loss 0.81197 | nw acc 0.928 | time 4 min 4 sec
cat 0: [1036, 13, 28, 18] and [0.9461, 0.0119, 0.0256, 0.0164]
cat 1: [7, 2046, 95, 64] and [0.0032, 0.925, 0.0429, 0.0289]
cat 2: [14, 33, 1014, 44] and [0.0127, 0.0299, 0.9176, 0.0398]
cat 3: [8, 88, 69, 2618] and [0.0029, 0.0316, 0.0248, 0.9407]
[test epoch 22/100] | loss 41.4 | nw acc 0.562 | time 1 min 9 sec
cat 0: [94, 78, 0, 22] and [0.4845, 0.4021, 0.0, 0.1134]
cat 1: [2, 480, 0, 27] and [0.0039, 0.943, 0.0, 0.053]
cat 2: [13, 362, 0, 79] and [0.0286, 0.7974, 0.0, 0.174]
cat 3: [295, 77, 0, 722] and [0.2697, 0.0704, 0.0, 0.66]
[train epoch 23/100] | loss 0.81238 | nw acc 0.929 | time 4 min 3 sec
cat 0: [1034, 9, 23, 25] and [0.9478, 0.0082, 0.0211, 0.0229]
cat 1: [6, 2068, 89, 60] and [0.0027, 0.9303, 0.04, 0.027]
cat 2: [12, 27, 1022, 63] and [0.0107, 0.024, 0.9093, 0.056]
cat 3: [13, 76, 72, 2596] and [0.0047, 0.0276, 0.0261, 0.9416]
[test epoch 23/100] | loss 43.7 | nw acc 0.5 | time 1 min 8 sec
cat 0: [195, 28, 0, 47] and [0.7222, 0.1037, 0.0, 0.1741]
cat 1: [117, 576, 0, 225] and [0.1275, 0.6275, 0.0, 0.2451]
cat 2: [82, 386, 0, 196] and [0.1235, 0.5813, 0.0, 0.2952]
cat 3: [10, 7, 0, 382] and [0.0251, 0.0175, 0.0, 0.9574]
[train epoch 24/100] | loss 0.80917 | nw acc 0.933 | time 4 min 1 sec
cat 0: [1031, 12, 22, 26] and [0.945, 0.011, 0.0202, 0.0238]
cat 1: [9, 2070, 96, 64] and [0.004, 0.9245, 0.0429, 0.0286]
cat 2: [16, 21, 1029, 37] and [0.0145, 0.019, 0.9329, 0.0335]
cat 3: [9, 77, 59, 2617] and [0.0033, 0.0279, 0.0214, 0.9475]
[test epoch 24/100] | loss 40.7 | nw acc 0.582 | time 1 min 12 sec
cat 0: [83, 47, 0, 20] and [0.5533, 0.3133, 0.0, 0.1333]
cat 1: [3, 545, 0, 41] and [0.0051, 0.9253, 0.0, 0.0696]
cat 2: [7, 344, 0, 76] and [0.0164, 0.8056, 0.0, 0.178]
cat 3: [311, 61, 0, 713] and [0.2866, 0.0562, 0.0, 0.6571]
[train epoch 25/100] | loss 0.80496 | nw acc 0.936 | time 4 min 3 sec
cat 0: [1039, 3, 23, 16] and [0.9611, 0.0028, 0.0213, 0.0148]
cat 1: [5, 2075, 88, 48] and [0.0023, 0.9364, 0.0397, 0.0217]
cat 2: [13, 27, 1015, 38] and [0.0119, 0.0247, 0.9286, 0.0348]
cat 3: [8, 75, 80, 2642] and [0.0029, 0.0267, 0.0285, 0.9419]
[test epoch 25/100] | loss 43.3 | nw acc 0.514 | time 1 min 7 sec
cat 0: [80, 83, 0, 19] and [0.4396, 0.456, 0.0, 0.1044]
cat 1: [0, 386, 0, 15] and [0.0, 0.9626, 0.0, 0.0374]
cat 2: [36, 426, 0, 98] and [0.0643, 0.7607, 0.0, 0.175]
cat 3: [288, 102, 0, 718] and [0.2599, 0.0921, 0.0, 0.648]
[train epoch 26/100] | loss 0.80494 | nw acc 0.938 | time 4 min 0 sec
cat 0: [1037, 6, 21, 20] and [0.9566, 0.0055, 0.0194, 0.0185]
cat 1: [7, 2077, 88, 48] and [0.0032, 0.9356, 0.0396, 0.0216]
cat 2: [12, 27, 1038, 43] and [0.0107, 0.0241, 0.9268, 0.0384]
cat 3: [9, 70, 59, 2633] and [0.0032, 0.0253, 0.0213, 0.9502]
[test epoch 26/100] | loss 41.5 | nw acc 0.555 | time 1 min 9 sec
cat 0: [105, 119, 0, 32] and [0.4102, 0.4648, 0.0, 0.125]
cat 1: [2, 432, 0, 27] and [0.0043, 0.9371, 0.0, 0.0586]
cat 2: [0, 341, 0, 50] and [0.0, 0.8721, 0.0, 0.1279]
cat 3: [297, 105, 0, 741] and [0.2598, 0.0919, 0.0, 0.6483]
[train epoch 27/100] | loss 0.799 | nw acc 0.942 | time 3 min 56 sec
cat 0: [1038, 8, 16, 14] and [0.9647, 0.0074, 0.0149, 0.013]
cat 1: [5, 2084, 85, 43] and [0.0023, 0.94, 0.0383, 0.0194]
cat 2: [12, 24, 1041, 38] and [0.0108, 0.0215, 0.9336, 0.0341]
cat 3: [10, 64, 64, 2649] and [0.0036, 0.023, 0.023, 0.9505]
[test epoch 27/100] | loss 41.3 | nw acc 0.568 | time 1 min 8 sec
cat 0: [78, 40, 0, 17] and [0.5778, 0.2963, 0.0, 0.1259]
cat 1: [4, 520, 0, 34] and [0.0072, 0.9319, 0.0, 0.0609]
cat 2: [28, 363, 0, 88] and [0.0585, 0.7578, 0.0, 0.1837]
cat 3: [294, 74, 0, 711] and [0.2725, 0.0686, 0.0, 0.6589]
[train epoch 28/100] | loss 0.79761 | nw acc 0.943 | time 4 min 2 sec
cat 0: [1041, 5, 18, 15] and [0.9648, 0.0046, 0.0167, 0.0139]
cat 1: [6, 2080, 89, 32] and [0.0027, 0.9425, 0.0403, 0.0145]
cat 2: [8, 28, 1036, 33] and [0.0072, 0.0253, 0.9376, 0.0299]
cat 3: [10, 67, 63, 2664] and [0.0036, 0.0239, 0.0225, 0.9501]
[test epoch 28/100] | loss 42.3 | nw acc 0.535 | time 1 min 5 sec
cat 0: [114, 127, 0, 24] and [0.4302, 0.4792, 0.0, 0.0906]
cat 1: [1, 400, 0, 22] and [0.0024, 0.9456, 0.0, 0.052]
cat 2: [3, 373, 0, 86] and [0.0065, 0.8074, 0.0, 0.1861]
cat 3: [286, 97, 0, 718] and [0.2598, 0.0881, 0.0, 0.6521]
[train epoch 29/100] | loss 0.79345 | nw acc 0.948 | time 3 min 50 sec
cat 0: [1048, 5, 20, 8] and [0.9695, 0.0046, 0.0185, 0.0074]
cat 1: [4, 2100, 84, 34] and [0.0018, 0.9451, 0.0378, 0.0153]
cat 2: [5, 21, 1040, 35] and [0.0045, 0.0191, 0.9446, 0.0318]
cat 3: [8, 54, 62, 2667] and [0.0029, 0.0193, 0.0222, 0.9556]
[test epoch 29/100] | loss 41.9 | nw acc 0.548 | time 1 min 9 sec
cat 0: [74, 40, 0, 20] and [0.5522, 0.2985, 0.0, 0.1493]
cat 1: [0, 427, 0, 19] and [0.0, 0.9574, 0.0, 0.0426]
cat 2: [0, 335, 0, 49] and [0.0, 0.8724, 0.0, 0.1276]
cat 3: [330, 195, 0, 762] and [0.2564, 0.1515, 0.0, 0.5921]
[train epoch 30/100] | loss 0.79506 | nw acc 0.947 | time 3 min 53 sec
cat 0: [1035, 4, 21, 18] and [0.9601, 0.0037, 0.0195, 0.0167]
cat 1: [8, 2097, 81, 32] and [0.0036, 0.9454, 0.0365, 0.0144]
cat 2: [14, 21, 1053, 31] and [0.0125, 0.0188, 0.941, 0.0277]
cat 3: [8, 58, 51, 2663] and [0.0029, 0.0209, 0.0183, 0.9579]
[test epoch 30/100] | loss 42.3 | nw acc 0.537 | time 1 min 10 sec
cat 0: [112, 124, 0, 28] and [0.4242, 0.4697, 0.0, 0.1061]
cat 1: [0, 407, 0, 18] and [0.0, 0.9576, 0.0, 0.0424]
cat 2: [21, 377, 0, 86] and [0.0434, 0.7789, 0.0, 0.1777]
cat 3: [271, 89, 0, 718] and [0.2514, 0.0826, 0.0, 0.666]
[train epoch 31/100] | loss 0.79396 | nw acc 0.947 | time 3 min 52 sec
cat 0: [1050, 7, 17, 14] and [0.9651, 0.0064, 0.0156, 0.0129]
cat 1: [6, 2099, 78, 39] and [0.0027, 0.9446, 0.0351, 0.0176]
cat 2: [8, 20, 1053, 42] and [0.0071, 0.0178, 0.9377, 0.0374]
cat 3: [1, 54, 58, 2649] and [0.0004, 0.0196, 0.021, 0.9591]
[test epoch 31/100] | loss 39.9 | nw acc 0.603 | time 1 min 7 sec
cat 0: [130, 59, 0, 31] and [0.5909, 0.2682, 0.0, 0.1409]
cat 1: [6, 571, 0, 48] and [0.0096, 0.9136, 0.0, 0.0768]
cat 2: [4, 330, 0, 82] and [0.0096, 0.7933, 0.0, 0.1971]
cat 3: [264, 37, 0, 689] and [0.2667, 0.0374, 0.0, 0.696]
[train epoch 32/100] | loss 0.78947 | nw acc 0.952 | time 3 min 50 sec
cat 0: [1047, 4, 19, 9] and [0.9703, 0.0037, 0.0176, 0.0083]
cat 1: [6, 2113, 76, 33] and [0.0027, 0.9484, 0.0341, 0.0148]
cat 2: [7, 15, 1058, 32] and [0.0063, 0.0135, 0.9514, 0.0288]
cat 3: [5, 48, 53, 2670] and [0.0018, 0.0173, 0.0191, 0.9618]
[test epoch 32/100] | loss 42 | nw acc 0.546 | time 1 min 9 sec
cat 0: [115, 93, 0, 21] and [0.5022, 0.4061, 0.0, 0.0917]
cat 1: [2, 433, 0, 16] and [0.0044, 0.9601, 0.0, 0.0355]
cat 2: [28, 394, 0, 103] and [0.0533, 0.7505, 0.0, 0.1962]
cat 3: [259, 77, 0, 710] and [0.2476, 0.0736, 0.0, 0.6788]
[train epoch 33/100] | loss 0.78834 | nw acc 0.954 | time 3 min 55 sec
cat 0: [1048, 5, 15, 14] and [0.9686, 0.0046, 0.0139, 0.0129]
cat 1: [4, 2119, 77, 29] and [0.0018, 0.9507, 0.0345, 0.013]
cat 2: [11, 13, 1065, 35] and [0.0098, 0.0116, 0.9475, 0.0311]
cat 3: [2, 43, 49, 2666] and [0.0007, 0.0156, 0.0178, 0.9659]
[test epoch 33/100] | loss 43.7 | nw acc 0.499 | time 1 min 6 sec
cat 0: [136, 111, 0, 31] and [0.4892, 0.3993, 0.0, 0.1115]
cat 1: [0, 397, 0, 20] and [0.0, 0.952, 0.0, 0.048]
cat 2: [43, 430, 0, 183] and [0.0655, 0.6555, 0.0, 0.279]
cat 3: [225, 59, 0, 616] and [0.25, 0.0656, 0.0, 0.6844]
[train epoch 34/100] | loss 0.78543 | nw acc 0.957 | time 3 min 57 sec
cat 0: [1048, 6, 9, 9] and [0.9776, 0.0056, 0.0084, 0.0084]
cat 1: [4, 2116, 66, 30] and [0.0018, 0.9549, 0.0298, 0.0135]
cat 2: [8, 13, 1082, 28] and [0.0071, 0.0115, 0.9567, 0.0248]
cat 3: [5, 45, 49, 2677] and [0.0018, 0.0162, 0.0177, 0.9643]
[test epoch 34/100] | loss 42.5 | nw acc 0.534 | time 1 min 4 sec
cat 0: [104, 92, 0, 28] and [0.4643, 0.4107, 0.0, 0.125]
cat 1: [2, 426, 0, 25] and [0.0044, 0.9404, 0.0, 0.0552]
cat 2: [19, 393, 0, 96] and [0.0374, 0.7736, 0.0, 0.189]
cat 3: [279, 86, 0, 701] and [0.2617, 0.0807, 0.0, 0.6576]
[train epoch 35/100] | loss 0.78624 | nw acc 0.957 | time 3 min 58 sec
cat 0: [1044, 6, 21, 13] and [0.9631, 0.0055, 0.0194, 0.012]
cat 1: [4, 2114, 63, 21] and [0.0018, 0.96, 0.0286, 0.0095]
cat 2: [10, 20, 1082, 29] and [0.0088, 0.0175, 0.9483, 0.0254]
cat 3: [7, 40, 40, 2681] and [0.0025, 0.0145, 0.0145, 0.9686]
[test epoch 35/100] | loss 47 | nw acc 0.425 | time 1 min 9 sec
cat 0: [39, 39, 0, 6] and [0.4643, 0.4643, 0.0, 0.0714]
cat 1: [0, 142, 0, 5] and [0.0, 0.966, 0.0, 0.034]
cat 2: [0, 377, 0, 40] and [0.0, 0.9041, 0.0, 0.0959]
cat 3: [365, 439, 0, 799] and [0.2277, 0.2739, 0.0, 0.4984]
[train epoch 36/100] | loss 0.78304 | nw acc 0.96 | time 3 min 58 sec
cat 0: [1044, 2, 14, 9] and [0.9766, 0.0019, 0.0131, 0.0084]
cat 1: [7, 2113, 57, 24] and [0.0032, 0.96, 0.0259, 0.0109]
cat 2: [11, 19, 1098, 26] and [0.0095, 0.0165, 0.9515, 0.0225]
cat 3: [3, 46, 37, 2685] and [0.0011, 0.0166, 0.0134, 0.969]
[test epoch 36/100] | loss 41.3 | nw acc 0.562 | time 1 min 2 sec
cat 0: [80, 57, 0, 19] and [0.5128, 0.3654, 0.0, 0.1218]
cat 1: [1, 483, 0, 23] and [0.002, 0.9527, 0.0, 0.0454]
cat 2: [4, 339, 0, 77] and [0.0095, 0.8071, 0.0, 0.1833]
cat 3: [319, 118, 0, 731] and [0.2731, 0.101, 0.0, 0.6259]
[train epoch 37/100] | loss 0.78256 | nw acc 0.959 | time 3 min 57 sec
cat 0: [1043, 6, 11, 9] and [0.9757, 0.0056, 0.0103, 0.0084]
cat 1: [6, 2123, 64, 32] and [0.0027, 0.9542, 0.0288, 0.0144]
cat 2: [7, 14, 1094, 24] and [0.0061, 0.0123, 0.9605, 0.0211]
cat 3: [9, 37, 37, 2679] and [0.0033, 0.0134, 0.0134, 0.9699]
[test epoch 37/100] | loss 41.9 | nw acc 0.551 | time 1 min 8 sec
cat 0: [94, 45, 0, 5] and [0.6528, 0.3125, 0.0, 0.0347]
cat 1: [1, 487, 0, 22] and [0.002, 0.9549, 0.0, 0.0431]
cat 2: [5, 381, 0, 134] and [0.0096, 0.7327, 0.0, 0.2577]
cat 3: [304, 84, 0, 689] and [0.2823, 0.078, 0.0, 0.6397]
[train epoch 38/100] | loss 0.78107 | nw acc 0.961 | time 3 min 59 sec
cat 0: [1055, 5, 12, 7] and [0.9778, 0.0046, 0.0111, 0.0065]
cat 1: [3, 2115, 52, 28] and [0.0014, 0.9622, 0.0237, 0.0127]
cat 2: [5, 19, 1096, 26] and [0.0044, 0.0166, 0.9564, 0.0227]
cat 3: [2, 41, 46, 2683] and [0.0007, 0.0148, 0.0166, 0.9679]
[test epoch 38/100] | loss 42.8 | nw acc 0.521 | time 1 min 2 sec
cat 0: [102, 78, 0, 26] and [0.4951, 0.3786, 0.0, 0.1262]
cat 1: [2, 409, 0, 17] and [0.0047, 0.9556, 0.0, 0.0397]
cat 2: [22, 398, 0, 117] and [0.041, 0.7412, 0.0, 0.2179]
cat 3: [278, 112, 0, 690] and [0.2574, 0.1037, 0.0, 0.6389]
[train epoch 39/100] | loss 0.78131 | nw acc 0.961 | time 3 min 53 sec
cat 0: [1050, 5, 13, 10] and [0.974, 0.0046, 0.0121, 0.0093]
cat 1: [3, 2124, 57, 26] and [0.0014, 0.9611, 0.0258, 0.0118]
cat 2: [10, 16, 1093, 25] and [0.0087, 0.014, 0.9554, 0.0219]
cat 3: [2, 35, 43, 2683] and [0.0007, 0.0127, 0.0156, 0.971]
[test epoch 39/100] | loss 43.7 | nw acc 0.495 | time 1 min 11 sec
cat 0: [187, 158, 0, 41] and [0.4845, 0.4093, 0.0, 0.1062]
cat 1: [2, 349, 0, 16] and [0.0054, 0.951, 0.0, 0.0436]
cat 2: [17, 421, 0, 189] and [0.0271, 0.6715, 0.0, 0.3014]
cat 3: [198, 69, 0, 604] and [0.2273, 0.0792, 0.0, 0.6935]
[train epoch 40/100] | loss 0.77797 | nw acc 0.963 | time 3 min 54 sec
cat 0: [1049, 8, 11, 14] and [0.9695, 0.0074, 0.0102, 0.0129]
cat 1: [7, 2121, 51, 23] and [0.0032, 0.9632, 0.0232, 0.0104]
cat 2: [6, 10, 1112, 23] and [0.0052, 0.0087, 0.9661, 0.02]
cat 3: [3, 41, 32, 2684] and [0.0011, 0.0149, 0.0116, 0.9725]
[test epoch 40/100] | loss 39.7 | nw acc 0.612 | time 1 min 3 sec
cat 0: [31, 28, 0, 0] and [0.5254, 0.4746, 0.0, 0.0]
cat 1: [0, 539, 0, 10] and [0.0, 0.9818, 0.0, 0.0182]
cat 2: [0, 57, 0, 1] and [0.0, 0.9828, 0.0, 0.0172]
cat 3: [373, 373, 0, 839] and [0.2353, 0.2353, 0.0, 0.5293]
[train epoch 41/100] | loss 0.77508 | nw acc 0.966 | time 3 min 53 sec
cat 0: [1055, 6, 11, 6] and [0.9787, 0.0056, 0.0102, 0.0056]
cat 1: [3, 2127, 47, 21] and [0.0014, 0.9677, 0.0214, 0.0096]
cat 2: [4, 13, 1112, 24] and [0.0035, 0.0113, 0.9644, 0.0208]
cat 3: [3, 34, 36, 2693] and [0.0011, 0.0123, 0.013, 0.9736]
[test epoch 41/100] | loss 42 | nw acc 0.539 | time 1 min 8 sec
cat 0: [124, 121, 0, 32] and [0.4477, 0.4368, 0.0, 0.1155]
cat 1: [2, 438, 0, 23] and [0.0043, 0.946, 0.0, 0.0497]
cat 2: [6, 365, 0, 115] and [0.0123, 0.751, 0.0, 0.2366]
cat 3: [272, 73, 0, 680] and [0.2654, 0.0712, 0.0, 0.6634]
[train epoch 42/100] | loss 0.78041 | nw acc 0.96 | time 3 min 59 sec
cat 0: [1056, 1, 15, 11] and [0.9751, 0.0009, 0.0139, 0.0102]
cat 1: [2, 2121, 50, 31] and [0.0009, 0.9623, 0.0227, 0.0141]
cat 2: [6, 17, 1105, 39] and [0.0051, 0.0146, 0.9469, 0.0334]
cat 3: [1, 41, 36, 2663] and [0.0004, 0.015, 0.0131, 0.9715]
[test epoch 42/100] | loss 44.4 | nw acc 0.488 | time 1 min 2 sec
cat 0: [67, 70, 0, 2] and [0.482, 0.5036, 0.0, 0.0144]
cat 1: [0, 317, 0, 8] and [0.0, 0.9754, 0.0, 0.0246]
cat 2: [3, 414, 0, 99] and [0.0058, 0.8023, 0.0, 0.1919]
cat 3: [334, 196, 0, 741] and [0.2628, 0.1542, 0.0, 0.583]
[train epoch 43/100] | loss 0.77559 | nw acc 0.966 | time 3 min 56 sec
cat 0: [1056, 8, 10, 10] and [0.9742, 0.0074, 0.0092, 0.0092]
cat 1: [3, 2126, 48, 23] and [0.0014, 0.9664, 0.0218, 0.0105]
cat 2: [4, 13, 1113, 23] and [0.0035, 0.0113, 0.9653, 0.0199]
cat 3: [2, 33, 35, 2688] and [0.0007, 0.012, 0.0127, 0.9746]
[test epoch 43/100] | loss 45.6 | nw acc 0.447 | time 1 min 10 sec
cat 0: [218, 141, 0, 59] and [0.5215, 0.3373, 0.0, 0.1411]
cat 1: [4, 371, 0, 19] and [0.0102, 0.9416, 0.0, 0.0482]
cat 2: [111, 464, 0, 332] and [0.1224, 0.5116, 0.0, 0.366]
cat 3: [71, 21, 0, 440] and [0.1335, 0.0395, 0.0, 0.8271]
[train epoch 44/100] | loss 0.77465 | nw acc 0.967 | time 4 min 2 sec
cat 0: [1058, 6, 8, 7] and [0.9805, 0.0056, 0.0074, 0.0065]
cat 1: [1, 2127, 47, 17] and [0.0005, 0.9703, 0.0214, 0.0078]
cat 2: [3, 14, 1118, 30] and [0.0026, 0.012, 0.9597, 0.0258]
cat 3: [3, 33, 33, 2690] and [0.0011, 0.012, 0.012, 0.975]
[test epoch 44/100] | loss 45.2 | nw acc 0.464 | time 1 min 5 sec
cat 0: [369, 272, 0, 122] and [0.4836, 0.3565, 0.0, 0.1599]
cat 1: [5, 273, 0, 17] and [0.0169, 0.9254, 0.0, 0.0576]
cat 2: [12, 448, 0, 284] and [0.0161, 0.6022, 0.0, 0.3817]
cat 3: [18, 4, 0, 427] and [0.0401, 0.0089, 0.0, 0.951]
[train epoch 45/100] | loss 0.77267 | nw acc 0.97 | time 4 min 1 sec
cat 0: [1058, 5, 12, 7] and [0.9778, 0.0046, 0.0111, 0.0065]
cat 1: [3, 2140, 37, 26] and [0.0014, 0.9701, 0.0168, 0.0118]
cat 2: [2, 9, 1130, 23] and [0.0017, 0.0077, 0.9708, 0.0198]
cat 3: [2, 26, 27, 2688] and [0.0007, 0.0095, 0.0098, 0.9799]
[test epoch 45/100] | loss 41.6 | nw acc 0.546 | time 1 min 2 sec
cat 0: [167, 144, 0, 44] and [0.4704, 0.4056, 0.0, 0.1239]
cat 1: [2, 419, 0, 18] and [0.0046, 0.9544, 0.0, 0.041]
cat 2: [2, 350, 0, 115] and [0.0043, 0.7495, 0.0, 0.2463]
cat 3: [233, 84, 0, 673] and [0.2354, 0.0848, 0.0, 0.6798]
[train epoch 46/100] | loss 0.77003 | nw acc 0.973 | time 3 min 55 sec
cat 0: [1055, 2, 9, 10] and [0.9805, 0.0019, 0.0084, 0.0093]
cat 1: [2, 2144, 34, 17] and [0.0009, 0.9759, 0.0155, 0.0077]
cat 2: [6, 11, 1132, 13] and [0.0052, 0.0095, 0.9742, 0.0112]
cat 3: [2, 23, 31, 2704] and [0.0007, 0.0083, 0.0112, 0.9797]
[test epoch 46/100] | loss 42.4 | nw acc 0.533 | time 1 min 7 sec
cat 0: [69, 57, 0, 13] and [0.4964, 0.4101, 0.0, 0.0935]
cat 1: [2, 434, 0, 20] and [0.0044, 0.9518, 0.0, 0.0439]
cat 2: [6, 381, 0, 91] and [0.0126, 0.7971, 0.0, 0.1904]
cat 3: [327, 125, 0, 726] and [0.2776, 0.1061, 0.0, 0.6163]
[train epoch 47/100] | loss 0.76972 | nw acc 0.971 | time 3 min 53 sec
cat 0: [1056, 4, 7, 7] and [0.9832, 0.0037, 0.0065, 0.0065]
cat 1: [1, 2133, 33, 17] and [0.0005, 0.9766, 0.0151, 0.0078]
cat 2: [6, 18, 1132, 20] and [0.0051, 0.0153, 0.9626, 0.017]
cat 3: [2, 25, 34, 2700] and [0.0007, 0.0091, 0.0123, 0.9779]
[test epoch 47/100] | loss 44.9 | nw acc 0.469 | time 1 min 2 sec
cat 0: [32, 18, 0, 0] and [0.64, 0.36, 0.0, 0.0]
cat 1: [0, 265, 0, 8] and [0.0, 0.9707, 0.0, 0.0293]
cat 2: [1, 390, 0, 58] and [0.0022, 0.8686, 0.0, 0.1292]
cat 3: [371, 324, 0, 784] and [0.2508, 0.2191, 0.0, 0.5301]
[train epoch 48/100] | loss 0.77089 | nw acc 0.97 | time 3 min 51 sec
cat 0: [1053, 3, 7, 7] and [0.9841, 0.0028, 0.0065, 0.0065]
cat 1: [3, 2134, 40, 14] and [0.0014, 0.974, 0.0183, 0.0064]
cat 2: [4, 14, 1127, 24] and [0.0034, 0.012, 0.9641, 0.0205]
cat 3: [5, 29, 32, 2699] and [0.0018, 0.0105, 0.0116, 0.9761]
[test epoch 48/100] | loss 44.7 | nw acc 0.477 | time 1 min 9 sec
cat 0: [114, 164, 0, 34] and [0.3654, 0.5256, 0.0, 0.109]
cat 1: [1, 309, 0, 11] and [0.0031, 0.9626, 0.0, 0.0343]
cat 2: [12, 412, 0, 129] and [0.0217, 0.745, 0.0, 0.2333]
cat 3: [277, 112, 0, 676] and [0.2601, 0.1052, 0.0, 0.6347]
[train epoch 49/100] | loss 0.77037 | nw acc 0.972 | time 3 min 54 sec
cat 0: [1058, 2, 10, 7] and [0.9824, 0.0019, 0.0093, 0.0065]
cat 1: [2, 2144, 28, 18] and [0.0009, 0.9781, 0.0128, 0.0082]
cat 2: [1, 7, 1129, 22] and [0.0009, 0.006, 0.9741, 0.019]
cat 3: [4, 27, 39, 2697] and [0.0014, 0.0098, 0.0141, 0.9747]
[test epoch 49/100] | loss 41.6 | nw acc 0.556 | time 1 min 6 sec
cat 0: [67, 40, 0, 17] and [0.5403, 0.3226, 0.0, 0.1371]
cat 1: [2, 498, 0, 24] and [0.0038, 0.9504, 0.0, 0.0458]
cat 2: [6, 354, 0, 92] and [0.0133, 0.7832, 0.0, 0.2035]
cat 3: [329, 105, 0, 717] and [0.2858, 0.0912, 0.0, 0.6229]
[train epoch 50/100] | loss 0.76631 | nw acc 0.974 | time 3 min 50 sec
cat 0: [1054, 5, 12, 6] and [0.9786, 0.0046, 0.0111, 0.0056]
cat 1: [2, 2139, 29, 12] and [0.0009, 0.9803, 0.0133, 0.0055]
cat 2: [5, 13, 1143, 17] and [0.0042, 0.011, 0.9703, 0.0144]
cat 3: [4, 23, 22, 2709] and [0.0015, 0.0083, 0.008, 0.9822]
[test epoch 50/100] | loss 42.1 | nw acc 0.543 | time 1 min 0 sec
cat 0: [91, 69, 0, 21] and [0.5028, 0.3812, 0.0, 0.116]
cat 1: [6, 514, 0, 31] and [0.0109, 0.9328, 0.0, 0.0563]
cat 2: [21, 360, 0, 153] and [0.0393, 0.6742, 0.0, 0.2865]
cat 3: [286, 54, 0, 645] and [0.2904, 0.0548, 0.0, 0.6548]
[train epoch 51/100] | loss 0.76649 | nw acc 0.975 | time 3 min 44 sec
cat 0: [1060, 5, 7, 4] and [0.9851, 0.0046, 0.0065, 0.0037]
cat 1: [0, 2145, 26, 14] and [0.0, 0.9817, 0.0119, 0.0064]
cat 2: [4, 5, 1140, 21] and [0.0034, 0.0043, 0.9744, 0.0179]
cat 3: [1, 25, 33, 2705] and [0.0004, 0.009, 0.0119, 0.9787]
[test epoch 51/100] | loss 43.9 | nw acc 0.491 | time 1 min 16 sec
cat 0: [52, 69, 0, 12] and [0.391, 0.5188, 0.0, 0.0902]
cat 1: [1, 304, 0, 7] and [0.0032, 0.9744, 0.0, 0.0224]
cat 2: [2, 381, 0, 56] and [0.0046, 0.8679, 0.0, 0.1276]
cat 3: [349, 243, 0, 775] and [0.2553, 0.1778, 0.0, 0.5669]
[train epoch 52/100] | loss 0.76699 | nw acc 0.975 | time 3 min 48 sec
cat 0: [1055, 4, 6, 4] and [0.9869, 0.0037, 0.0056, 0.0037]
cat 1: [4, 2137, 27, 12] and [0.0018, 0.9803, 0.0124, 0.0055]
cat 2: [5, 11, 1143, 15] and [0.0043, 0.0094, 0.9736, 0.0128]
cat 3: [1, 28, 30, 2713] and [0.0004, 0.0101, 0.0108, 0.9787]
[test epoch 52/100] | loss 41.8 | nw acc 0.55 | time 1 min 7 sec
cat 0: [80, 71, 0, 14] and [0.4848, 0.4303, 0.0, 0.0848]
cat 1: [3, 481, 0, 21] and [0.0059, 0.9525, 0.0, 0.0416]
cat 2: [6, 366, 0, 109] and [0.0125, 0.7609, 0.0, 0.2266]
cat 3: [315, 79, 0, 706] and [0.2864, 0.0718, 0.0, 0.6418]
[train epoch 53/100] | loss 0.76725 | nw acc 0.974 | time 3 min 45 sec
cat 0: [1053, 3, 11, 7] and [0.9804, 0.0028, 0.0102, 0.0065]
cat 1: [3, 2144, 24, 20] and [0.0014, 0.9785, 0.011, 0.0091]
cat 2: [5, 7, 1149, 17] and [0.0042, 0.0059, 0.9754, 0.0144]
cat 3: [4, 26, 22, 2700] and [0.0015, 0.0094, 0.008, 0.9811]
[test epoch 53/100] | loss 47.3 | nw acc 0.414 | time 1 min 6 sec
cat 0: [127, 91, 0, 23] and [0.527, 0.3776, 0.0, 0.0954]
cat 1: [2, 309, 0, 11] and [0.0062, 0.9596, 0.0, 0.0342]
cat 2: [54, 551, 0, 297] and [0.0599, 0.6109, 0.0, 0.3293]
cat 3: [221, 46, 0, 519] and [0.2812, 0.0585, 0.0, 0.6603]
[train epoch 54/100] | loss 0.76302 | nw acc 0.977 | time 3 min 47 sec
cat 0: [1056, 5, 7, 3] and [0.986, 0.0047, 0.0065, 0.0028]
cat 1: [1, 2149, 27, 11] and [0.0005, 0.9822, 0.0123, 0.005]
cat 2: [6, 5, 1148, 16] and [0.0051, 0.0043, 0.977, 0.0136]
cat 3: [2, 21, 24, 2714] and [0.0007, 0.0076, 0.0087, 0.983]
[test epoch 54/100] | loss 44.2 | nw acc 0.498 | time 0 min 59 sec
cat 0: [70, 66, 0, 2] and [0.5072, 0.4783, 0.0, 0.0145]
cat 1: [0, 309, 0, 10] and [0.0, 0.9687, 0.0, 0.0313]
cat 2: [1, 395, 0, 69] and [0.0022, 0.8495, 0.0, 0.1484]
cat 3: [333, 227, 0, 769] and [0.2506, 0.1708, 0.0, 0.5786]
[train epoch 55/100] | loss 0.76667 | nw acc 0.975 | time 3 min 49 sec
cat 0: [1058, 3, 4, 5] and [0.9888, 0.0028, 0.0037, 0.0047]
cat 1: [2, 2137, 33, 22] and [0.0009, 0.974, 0.015, 0.01]
cat 2: [5, 9, 1152, 12] and [0.0042, 0.0076, 0.9779, 0.0102]
cat 3: [0, 31, 17, 2705] and [0.0, 0.0113, 0.0062, 0.9826]
[test epoch 55/100] | loss 43.1 | nw acc 0.517 | time 1 min 8 sec
cat 0: [50, 39, 0, 8] and [0.5155, 0.4021, 0.0, 0.0825]
cat 1: [0, 378, 0, 16] and [0.0, 0.9594, 0.0, 0.0406]
cat 2: [5, 363, 0, 62] and [0.0116, 0.8442, 0.0, 0.1442]
cat 3: [349, 217, 0, 764] and [0.2624, 0.1632, 0.0, 0.5744]
[train epoch 56/100] | loss 0.76347 | nw acc 0.978 | time 3 min 45 sec
cat 0: [1056, 1, 7, 5] and [0.9878, 0.0009, 0.0065, 0.0047]
cat 1: [3, 2145, 18, 20] and [0.0014, 0.9812, 0.0082, 0.0091]
cat 2: [4, 9, 1164, 13] and [0.0034, 0.0076, 0.9782, 0.0109]
cat 3: [2, 25, 17, 2706] and [0.0007, 0.0091, 0.0062, 0.984]
[test epoch 56/100] | loss 42.9 | nw acc 0.52 | time 1 min 5 sec
cat 0: [77, 62, 0, 10] and [0.5168, 0.4161, 0.0, 0.0671]
cat 1: [2, 401, 0, 15] and [0.0048, 0.9593, 0.0, 0.0359]
cat 2: [3, 391, 0, 104] and [0.006, 0.7851, 0.0, 0.2088]
cat 3: [322, 143, 0, 721] and [0.2715, 0.1206, 0.0, 0.6079]
[train epoch 57/100] | loss 0.76199 | nw acc 0.98 | time 3 min 50 sec
cat 0: [1056, 4, 7, 4] and [0.986, 0.0037, 0.0065, 0.0037]
cat 1: [2, 2151, 20, 11] and [0.0009, 0.9849, 0.0092, 0.005]
cat 2: [3, 4, 1166, 15] and [0.0025, 0.0034, 0.9815, 0.0126]
cat 3: [4, 21, 13, 2714] and [0.0015, 0.0076, 0.0047, 0.9862]
[test epoch 57/100] | loss 41.8 | nw acc 0.553 | time 1 min 10 sec
cat 0: [90, 57, 0, 15] and [0.5556, 0.3519, 0.0, 0.0926]
cat 1: [3, 493, 0, 24] and [0.0058, 0.9481, 0.0, 0.0462]
cat 2: [7, 383, 0, 121] and [0.0137, 0.7495, 0.0, 0.2368]
cat 3: [304, 64, 0, 690] and [0.2873, 0.0605, 0.0, 0.6522]
[train epoch 58/100] | loss 0.76148 | nw acc 0.98 | time 6 min 5 sec
cat 0: [1058, 1, 7, 4] and [0.9888, 0.0009, 0.0065, 0.0037]
cat 1: [4, 2148, 25, 11] and [0.0018, 0.9817, 0.0114, 0.005]
cat 2: [2, 8, 1160, 11] and [0.0017, 0.0068, 0.9822, 0.0093]
cat 3: [1, 23, 14, 2718] and [0.0004, 0.0083, 0.0051, 0.9862]
[test epoch 58/100] | loss 41.7 | nw acc 0.552 | time 1 min 2 sec
cat 0: [71, 21, 0, 11] and [0.6893, 0.2039, 0.0, 0.1068]
cat 1: [8, 563, 0, 32] and [0.0133, 0.9337, 0.0, 0.0531]
cat 2: [9, 365, 0, 169] and [0.0166, 0.6722, 0.0, 0.3112]
cat 3: [316, 48, 0, 638] and [0.3154, 0.0479, 0.0, 0.6367]
[train epoch 59/100] | loss 0.76394 | nw acc 0.977 | time 5 min 29 sec
cat 0: [1057, 2, 6, 4] and [0.9888, 0.0019, 0.0056, 0.0037]
cat 1: [3, 2147, 21, 12] and [0.0014, 0.9835, 0.0096, 0.0055]
cat 2: [1, 8, 1156, 22] and [0.0008, 0.0067, 0.9739, 0.0185]
cat 3: [4, 23, 23, 2706] and [0.0015, 0.0083, 0.0083, 0.9819]
[test epoch 59/100] | loss 42.3 | nw acc 0.535 | time 1 min 5 sec
cat 0: [83, 69, 0, 17] and [0.4911, 0.4083, 0.0, 0.1006]
cat 1: [2, 436, 0, 17] and [0.0044, 0.9582, 0.0, 0.0374]
cat 2: [4, 350, 0, 103] and [0.0088, 0.7659, 0.0, 0.2254]
cat 3: [315, 142, 0, 713] and [0.2692, 0.1214, 0.0, 0.6094]
[train epoch 60/100] | loss 0.76222 | nw acc 0.979 | time 6 min 6 sec
cat 0: [1059, 4, 8, 7] and [0.9824, 0.0037, 0.0074, 0.0065]
cat 1: [3, 2149, 20, 13] and [0.0014, 0.9835, 0.0092, 0.0059]
cat 2: [1, 9, 1161, 12] and [0.0008, 0.0076, 0.9814, 0.0101]
cat 3: [2, 18, 17, 2712] and [0.0007, 0.0065, 0.0062, 0.9865]
[test epoch 60/100] | loss 42.1 | nw acc 0.543 | time 1 min 15 sec
cat 0: [77, 34, 0, 16] and [0.6063, 0.2677, 0.0, 0.126]
cat 1: [2, 494, 0, 25] and [0.0038, 0.9482, 0.0, 0.048]
cat 2: [14, 376, 0, 129] and [0.027, 0.7245, 0.0, 0.2486]
cat 3: [311, 93, 0, 680] and [0.2869, 0.0858, 0.0, 0.6273]
[train epoch 61/100] | loss 0.75853 | nw acc 0.982 | time 5 min 52 sec
cat 0: [1061, 1, 6, 4] and [0.9897, 0.0009, 0.0056, 0.0037]
cat 1: [1, 2156, 19, 11] and [0.0005, 0.9858, 0.0087, 0.005]
cat 2: [1, 6, 1164, 7] and [0.0008, 0.0051, 0.9881, 0.0059]
cat 3: [2, 17, 17, 2722] and [0.0007, 0.0062, 0.0062, 0.9869]
[test epoch 61/100] | loss 41.4 | nw acc 0.563 | time 3 min 16 sec
cat 0: [87, 57, 0, 18] and [0.537, 0.3519, 0.0, 0.1111]
cat 1: [6, 539, 0, 32] and [0.0104, 0.9341, 0.0, 0.0555]
cat 2: [9, 354, 0, 128] and [0.0183, 0.721, 0.0, 0.2607]
cat 3: [302, 47, 0, 672] and [0.2958, 0.046, 0.0, 0.6582]
[train epoch 62/100] | loss 0.75906 | nw acc 0.982 | time 5 min 28 sec
cat 0: [1060, 1, 4, 3] and [0.9925, 0.0009, 0.0037, 0.0028]
cat 1: [0, 2153, 23, 8] and [0.0, 0.9858, 0.0105, 0.0037]
cat 2: [3, 4, 1165, 11] and [0.0025, 0.0034, 0.9848, 0.0093]
cat 3: [2, 22, 14, 2722] and [0.0007, 0.008, 0.0051, 0.9862]
[test epoch 62/100] | loss 41.3 | nw acc 0.566 | time 2 min 31 sec
cat 0: [75, 53, 0, 15] and [0.5245, 0.3706, 0.0, 0.1049]
cat 1: [2, 500, 0, 25] and [0.0038, 0.9488, 0.0, 0.0474]
cat 2: [5, 348, 0, 81] and [0.0115, 0.8018, 0.0, 0.1866]
cat 3: [322, 96, 0, 729] and [0.2807, 0.0837, 0.0, 0.6356]
[train epoch 63/100] | loss 0.76067 | nw acc 0.98 | time 4 min 36 sec
cat 0: [1058, 1, 8, 1] and [0.9906, 0.0009, 0.0075, 0.0009]
cat 1: [2, 2148, 24, 8] and [0.0009, 0.9844, 0.011, 0.0037]
cat 2: [3, 9, 1160, 12] and [0.0025, 0.0076, 0.9797, 0.0101]
cat 3: [2, 22, 14, 2723] and [0.0007, 0.008, 0.0051, 0.9862]
[test epoch 63/100] | loss 42.8 | nw acc 0.525 | time 2 min 47 sec
cat 0: [89, 51, 0, 15] and [0.5742, 0.329, 0.0, 0.0968]
cat 1: [19, 511, 0, 30] and [0.0339, 0.9125, 0.0, 0.0536]
cat 2: [16, 400, 0, 195] and [0.0262, 0.6547, 0.0, 0.3191]
cat 3: [280, 35, 0, 610] and [0.3027, 0.0378, 0.0, 0.6595]
[train epoch 64/100] | loss 0.76169 | nw acc 0.978 | time 6 min 2 sec
cat 0: [1058, 0, 9, 4] and [0.9879, 0.0, 0.0084, 0.0037]
cat 1: [1, 2146, 18, 18] and [0.0005, 0.9831, 0.0082, 0.0082]
cat 2: [3, 10, 1161, 11] and [0.0025, 0.0084, 0.9797, 0.0093]
cat 3: [3, 24, 18, 2711] and [0.0011, 0.0087, 0.0065, 0.9837]
[test epoch 64/100] | loss 46.2 | nw acc 0.451 | time 1 min 10 sec
cat 0: [60, 40, 0, 5] and [0.5714, 0.381, 0.0, 0.0476]
cat 1: [1, 288, 0, 12] and [0.0033, 0.9568, 0.0, 0.0399]
cat 2: [23, 578, 0, 141] and [0.031, 0.779, 0.0, 0.19]
cat 3: [320, 91, 0, 692] and [0.2901, 0.0825, 0.0, 0.6274]
