AlexNet(
  (conv1): Sequential(
    (0): Conv2d(3, 64, kernel_size=(11, 11), stride=(4, 4), padding=(2, 2))
    (1): ReLU(inplace)
    (2): MaxPool2d(kernel_size=3, stride=2, padding=0, dilation=1, ceil_mode=False)
  )
  (conv2): Sequential(
    (0): Conv2d(64, 192, kernel_size=(5, 5), stride=(1, 1), padding=(2, 2))
    (1): ReLU(inplace)
    (2): MaxPool2d(kernel_size=3, stride=2, padding=0, dilation=1, ceil_mode=False)
  )
  (conv3): Sequential(
    (0): Conv2d(192, 384, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    (1): ReLU(inplace)
  )
  (conv4): Sequential(
    (0): Conv2d(384, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    (1): ReLU(inplace)
  )
  (conv5): Sequential(
    (0): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    (1): ReLU(inplace)
    (2): MaxPool2d(kernel_size=3, stride=2, padding=0, dilation=1, ceil_mode=False)
  )
  (fc1): Sequential(
    (0): Dropout(p=0.5)
    (1): Linear(in_features=9216, out_features=4096, bias=True)
    (2): ReLU(inplace)
  )
  (fc2): Sequential(
    (0): Dropout(p=0.5)
    (1): Linear(in_features=4096, out_features=4096, bias=True)
    (2): ReLU(inplace)
  )
  (fc3): Sequential(
    (0): Linear(in_features=4096, out_features=4, bias=True)
    (1): Softmax()
  )
)
Child conv1 layer 0 param is frozen
Child conv1 layer 0 param is frozen
Child conv2 layer 0 param is frozen
Child conv2 layer 0 param is frozen
Child conv3 layer 0 param is frozen
Child conv3 layer 0 param is frozen
Child conv4 layer 0 param is frozen
Child conv4 layer 0 param is frozen
Child conv5 layer 0 param is frozen
Child conv5 layer 0 param is frozen
Child fc1 layer 1 param is not frozen
Child fc1 layer 1 param is not frozen
Child fc2 layer 1 param is not frozen
Child fc2 layer 1 param is not frozen
Child fc3 layer 0 param is not frozen
Child fc3 layer 0 param is not frozen
train patients [30 43 49 41 45  6 13 25 24  5 14 23 19 15 42 46  1 54 31 29 12 53  4 18
 51 55  8 48 40 32 36  0 17 47 10]
train labels [1386 2856 1206 2378]
test patients [34 11 35 50  3 44  7 22  2]
test labels [  83  321    0 1216]

[train epoch 1/100] | loss 1.1791 | nw acc 0.576 | time 2 min 59 sec
cat 0: [526, 117, 82, 104] and [0.6345, 0.1411, 0.0989, 0.1255]
cat 1: [588, 2409, 773, 671] and [0.1324, 0.5424, 0.1741, 0.1511]
cat 2: [6, 3, 0, 3] and [0.5, 0.25, 0.0, 0.25]
cat 3: [266, 327, 351, 1600] and [0.1046, 0.1285, 0.138, 0.6289]
[test epoch 1/100] | loss 28.2 | nw acc 0.646 | time 0 min 37 sec
cat 0: [10, 4, 0, 74] and [0.1136, 0.0455, 0.0, 0.8409]
cat 1: [73, 316, 0, 393] and [0.0934, 0.4041, 0.0, 0.5026]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 1, 0, 749] and [0.0, 0.0013, 0.0, 0.9987]
[train epoch 2/100] | loss 1.1117 | nw acc 0.631 | time 2 min 58 sec
cat 0: [882, 205, 124, 191] and [0.6291, 0.1462, 0.0884, 0.1362]
cat 1: [288, 2409, 696, 512] and [0.0738, 0.6169, 0.1782, 0.1311]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [216, 242, 386, 1675] and [0.0857, 0.0961, 0.1532, 0.6649]
[test epoch 2/100] | loss 27.1 | nw acc 0.698 | time 0 min 36 sec
cat 0: [65, 5, 0, 187] and [0.2529, 0.0195, 0.0, 0.7276]
cat 1: [18, 315, 0, 247] and [0.031, 0.5431, 0.0, 0.4259]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 1, 0, 782] and [0.0, 0.0013, 0.0, 0.9987]
[train epoch 3/100] | loss 1.0836 | nw acc 0.659 | time 3 min 52 sec
cat 0: [973, 220, 141, 194] and [0.6368, 0.144, 0.0923, 0.127]
cat 1: [211, 2370, 581, 442] and [0.0585, 0.6576, 0.1612, 0.1226]
cat 2: [39, 63, 160, 61] and [0.1207, 0.195, 0.4954, 0.1889]
cat 3: [163, 203, 324, 1681] and [0.0687, 0.0856, 0.1367, 0.709]
[test epoch 3/100] | loss 29.1 | nw acc 0.627 | time 1 min 7 sec
cat 0: [55, 4, 0, 91] and [0.3667, 0.0267, 0.0, 0.6067]
cat 1: [23, 316, 0, 202] and [0.0425, 0.5841, 0.0, 0.3734]
cat 2: [5, 0, 0, 250] and [0.0196, 0.0, 0.0, 0.9804]
cat 3: [0, 1, 0, 673] and [0.0, 0.0015, 0.0, 0.9985]
[train epoch 4/100] | loss 1.0529 | nw acc 0.698 | time 4 min 19 sec
cat 0: [1006, 150, 99, 170] and [0.706, 0.1053, 0.0695, 0.1193]
cat 1: [152, 2351, 430, 392] and [0.0457, 0.7071, 0.1293, 0.1179]
cat 2: [98, 171, 530, 208] and [0.0973, 0.1698, 0.5263, 0.2066]
cat 3: [130, 184, 147, 1608] and [0.0628, 0.0889, 0.071, 0.7772]
[test epoch 4/100] | loss 30.2 | nw acc 0.573 | time 0 min 53 sec
cat 0: [45, 4, 0, 71] and [0.375, 0.0333, 0.0, 0.5917]
cat 1: [33, 316, 0, 226] and [0.0574, 0.5496, 0.0, 0.393]
cat 2: [5, 0, 0, 327] and [0.0151, 0.0, 0.0, 0.9849]
cat 3: [0, 1, 0, 592] and [0.0, 0.0017, 0.0, 0.9983]
[train epoch 5/100] | loss 1.0361 | nw acc 0.71 | time 4 min 27 sec
cat 0: [1026, 158, 78, 177] and [0.713, 0.1098, 0.0542, 0.123]
cat 1: [146, 2354, 399, 365] and [0.0447, 0.7212, 0.1222, 0.1118]
cat 2: [105, 163, 605, 232] and [0.095, 0.1475, 0.5475, 0.21]
cat 3: [109, 181, 124, 1604] and [0.054, 0.0897, 0.0614, 0.7948]
[test epoch 5/100] | loss 28.3 | nw acc 0.65 | time 0 min 56 sec
cat 0: [65, 4, 0, 119] and [0.3457, 0.0213, 0.0, 0.633]
cat 1: [18, 316, 0, 197] and [0.0339, 0.5951, 0.0, 0.371]
cat 2: [0, 0, 0, 199] and [0.0, 0.0, 0.0, 1.0]
cat 3: [0, 1, 0, 701] and [0.0, 0.0014, 0.0, 0.9986]
[train epoch 6/100] | loss 1.0262 | nw acc 0.719 | time 4 min 23 sec
cat 0: [1039, 160, 94, 166] and [0.7121, 0.1097, 0.0644, 0.1138]
cat 1: [140, 2374, 380, 349] and [0.0432, 0.732, 0.1172, 0.1076]
cat 2: [100, 160, 586, 200] and [0.0956, 0.153, 0.5602, 0.1912]
cat 3: [107, 162, 146, 1663] and [0.0515, 0.078, 0.0703, 0.8003]
[test epoch 6/100] | loss 29.8 | nw acc 0.582 | time 0 min 52 sec
cat 0: [35, 2, 0, 40] and [0.4545, 0.026, 0.0, 0.5195]
cat 1: [44, 318, 0, 288] and [0.0677, 0.4892, 0.0, 0.4431]
cat 2: [4, 0, 0, 272] and [0.0145, 0.0, 0.0, 0.9855]
cat 3: [0, 1, 0, 616] and [0.0, 0.0016, 0.0, 0.9984]
[train epoch 7/100] | loss 1.0157 | nw acc 0.731 | time 4 min 22 sec
cat 0: [1063, 155, 77, 166] and [0.7276, 0.1061, 0.0527, 0.1136]
cat 1: [123, 2397, 361, 346] and [0.0381, 0.7428, 0.1119, 0.1072]
cat 2: [95, 155, 640, 215] and [0.086, 0.1403, 0.5792, 0.1946]
cat 3: [105, 149, 128, 1651] and [0.0516, 0.0733, 0.063, 0.8121]
[test epoch 7/100] | loss 26.5 | nw acc 0.719 | time 0 min 48 sec
cat 0: [72, 4, 0, 110] and [0.3871, 0.0215, 0.0, 0.5914]
cat 1: [11, 312, 0, 99] and [0.0261, 0.7393, 0.0, 0.2346]
cat 2: [0, 2, 0, 195] and [0.0, 0.0102, 0.0, 0.9898]
cat 3: [0, 3, 0, 812] and [0.0, 0.0037, 0.0, 0.9963]
[train epoch 8/100] | loss 1.0046 | nw acc 0.742 | time 4 min 17 sec
cat 0: [1087, 146, 73, 152] and [0.7455, 0.1001, 0.0501, 0.1043]
cat 1: [104, 2405, 341, 325] and [0.0328, 0.7575, 0.1074, 0.1024]
cat 2: [98, 146, 651, 204] and [0.0892, 0.1328, 0.5924, 0.1856]
cat 3: [97, 159, 141, 1697] and [0.0463, 0.0759, 0.0673, 0.8104]
[test epoch 8/100] | loss 27.9 | nw acc 0.66 | time 0 min 45 sec
cat 0: [56, 2, 0, 46] and [0.5385, 0.0192, 0.0, 0.4423]
cat 1: [23, 317, 0, 185] and [0.0438, 0.6038, 0.0, 0.3524]
cat 2: [4, 1, 0, 259] and [0.0152, 0.0038, 0.0, 0.9811]
cat 3: [0, 1, 0, 726] and [0.0, 0.0014, 0.0, 0.9986]
[train epoch 9/100] | loss 1.0035 | nw acc 0.743 | time 4 min 5 sec
cat 0: [1087, 132, 82, 160] and [0.744, 0.0903, 0.0561, 0.1095]
cat 1: [111, 2429, 353, 345] and [0.0343, 0.7502, 0.109, 0.1065]
cat 2: [102, 133, 654, 194] and [0.0942, 0.1228, 0.6039, 0.1791]
cat 3: [86, 162, 117, 1679] and [0.0421, 0.0793, 0.0572, 0.8214]
[test epoch 9/100] | loss 29 | nw acc 0.614 | time 0 min 45 sec
cat 0: [64, 2, 0, 112] and [0.3596, 0.0112, 0.0, 0.6292]
cat 1: [19, 318, 0, 273] and [0.0311, 0.5213, 0.0, 0.4475]
cat 2: [0, 0, 0, 192] and [0.0, 0.0, 0.0, 1.0]
cat 3: [0, 1, 0, 639] and [0.0, 0.0016, 0.0, 0.9984]
[train epoch 10/100] | loss 0.99037 | nw acc 0.757 | time 4 min 9 sec
cat 0: [1109, 139, 69, 132] and [0.7654, 0.0959, 0.0476, 0.0911]
cat 1: [99, 2452, 322, 309] and [0.0311, 0.7706, 0.1012, 0.0971]
cat 2: [74, 116, 694, 231] and [0.0664, 0.104, 0.6224, 0.2072]
cat 3: [104, 149, 121, 1706] and [0.05, 0.0716, 0.0582, 0.8202]
[test epoch 10/100] | loss 28.7 | nw acc 0.627 | time 0 min 38 sec
cat 0: [67, 3, 0, 100] and [0.3941, 0.0176, 0.0, 0.5882]
cat 1: [14, 316, 0, 197] and [0.0266, 0.5996, 0.0, 0.3738]
cat 2: [2, 1, 0, 258] and [0.0077, 0.0038, 0.0, 0.9885]
cat 3: [0, 1, 0, 661] and [0.0, 0.0015, 0.0, 0.9985]
[train epoch 11/100] | loss 0.9845 | nw acc 0.759 | time 4 min 4 sec
cat 0: [1118, 121, 87, 167] and [0.7488, 0.081, 0.0583, 0.1119]
cat 1: [91, 2461, 319, 309] and [0.0286, 0.7739, 0.1003, 0.0972]
cat 2: [84, 138, 687, 190] and [0.0764, 0.1256, 0.6251, 0.1729]
cat 3: [93, 136, 113, 1712] and [0.0453, 0.0662, 0.055, 0.8335]
[test epoch 11/100] | loss 28.7 | nw acc 0.623 | time 0 min 35 sec
cat 0: [67, 4, 0, 82] and [0.4379, 0.0261, 0.0, 0.5359]
cat 1: [10, 290, 0, 93] and [0.0254, 0.7379, 0.0, 0.2366]
cat 2: [6, 26, 0, 362] and [0.0152, 0.066, 0.0, 0.9188]
cat 3: [0, 1, 0, 679] and [0.0, 0.0015, 0.0, 0.9985]
[train epoch 12/100] | loss 0.98189 | nw acc 0.761 | time 4 min 6 sec
cat 0: [1131, 110, 80, 136] and [0.7763, 0.0755, 0.0549, 0.0933]
cat 1: [88, 2468, 314, 324] and [0.0276, 0.7727, 0.0983, 0.1014]
cat 2: [69, 130, 695, 221] and [0.0619, 0.1166, 0.6233, 0.1982]
cat 3: [98, 148, 117, 1697] and [0.0476, 0.0718, 0.0568, 0.8238]
[test epoch 12/100] | loss 27.2 | nw acc 0.692 | time 0 min 40 sec
cat 0: [72, 4, 0, 110] and [0.3871, 0.0215, 0.0, 0.5914]
cat 1: [9, 311, 0, 105] and [0.0212, 0.7318, 0.0, 0.2471]
cat 2: [2, 5, 0, 233] and [0.0083, 0.0208, 0.0, 0.9708]
cat 3: [0, 1, 0, 768] and [0.0, 0.0013, 0.0, 0.9987]
[train epoch 13/100] | loss 0.97907 | nw acc 0.766 | time 4 min 0 sec
cat 0: [1138, 106, 76, 138] and [0.7805, 0.0727, 0.0521, 0.0947]
cat 1: [81, 2466, 307, 318] and [0.0255, 0.7774, 0.0968, 0.1003]
cat 2: [69, 131, 717, 211] and [0.0612, 0.1161, 0.6356, 0.1871]
cat 3: [98, 153, 106, 1711] and [0.0474, 0.074, 0.0513, 0.8274]
[test epoch 13/100] | loss 27.2 | nw acc 0.691 | time 0 min 44 sec
cat 0: [73, 3, 0, 107] and [0.3989, 0.0164, 0.0, 0.5847]
cat 1: [9, 315, 0, 129] and [0.0199, 0.6954, 0.0, 0.2848]
cat 2: [1, 2, 0, 219] and [0.0045, 0.009, 0.0, 0.9865]
cat 3: [0, 1, 0, 761] and [0.0, 0.0013, 0.0, 0.9987]
[train epoch 14/100] | loss 0.97274 | nw acc 0.774 | time 4 min 4 sec
cat 0: [1143, 119, 76, 128] and [0.7797, 0.0812, 0.0518, 0.0873]
cat 1: [95, 2484, 312, 300] and [0.0298, 0.7784, 0.0978, 0.094]
cat 2: [71, 117, 713, 199] and [0.0645, 0.1064, 0.6482, 0.1809]
cat 3: [77, 136, 105, 1751] and [0.0372, 0.0657, 0.0507, 0.8463]
[test epoch 14/100] | loss 28.7 | nw acc 0.631 | time 0 min 48 sec
cat 0: [81, 6, 0, 177] and [0.3068, 0.0227, 0.0, 0.6705]
cat 1: [2, 292, 0, 89] and [0.0052, 0.7624, 0.0, 0.2324]
cat 2: [0, 22, 0, 273] and [0.0, 0.0746, 0.0, 0.9254]
cat 3: [0, 1, 0, 677] and [0.0, 0.0015, 0.0, 0.9985]
[train epoch 15/100] | loss 0.96889 | nw acc 0.778 | time 4 min 12 sec
cat 0: [1179, 125, 68, 148] and [0.7757, 0.0822, 0.0447, 0.0974]
cat 1: [69, 2450, 285, 283] and [0.0224, 0.7937, 0.0923, 0.0917]
cat 2: [57, 129, 747, 202] and [0.0502, 0.1137, 0.6581, 0.178]
cat 3: [81, 152, 106, 1745] and [0.0389, 0.0729, 0.0509, 0.8373]
[test epoch 15/100] | loss 27.5 | nw acc 0.667 | time 0 min 51 sec
cat 0: [65, 1, 0, 42] and [0.6019, 0.0093, 0.0, 0.3889]
cat 1: [13, 318, 0, 224] and [0.0234, 0.573, 0.0, 0.4036]
cat 2: [5, 1, 0, 223] and [0.0218, 0.0044, 0.0, 0.9738]
cat 3: [0, 1, 0, 727] and [0.0, 0.0014, 0.0, 0.9986]
[train epoch 16/100] | loss 0.96418 | nw acc 0.777 | time 4 min 9 sec
cat 0: [1143, 102, 77, 133] and [0.7856, 0.0701, 0.0529, 0.0914]
cat 1: [81, 2506, 294, 297] and [0.0255, 0.7885, 0.0925, 0.0935]
cat 2: [73, 115, 718, 202] and [0.0659, 0.1038, 0.648, 0.1823]
cat 3: [89, 133, 117, 1746] and [0.0427, 0.0638, 0.0561, 0.8374]
[test epoch 16/100] | loss 27.1 | nw acc 0.697 | time 0 min 52 sec
cat 0: [76, 3, 0, 145] and [0.3393, 0.0134, 0.0, 0.6473]
cat 1: [7, 316, 0, 124] and [0.0157, 0.7069, 0.0, 0.2774]
cat 2: [0, 1, 0, 179] and [0.0, 0.0056, 0.0, 0.9944]
cat 3: [0, 1, 0, 768] and [0.0, 0.0013, 0.0, 0.9987]
[train epoch 17/100] | loss 0.95928 | nw acc 0.788 | time 4 min 3 sec
cat 0: [1185, 101, 76, 125] and [0.7969, 0.0679, 0.0511, 0.0841]
cat 1: [74, 2525, 292, 307] and [0.0231, 0.7896, 0.0913, 0.096]
cat 2: [37, 99, 724, 173] and [0.0358, 0.0958, 0.7009, 0.1675]
cat 3: [90, 131, 114, 1773] and [0.0427, 0.0621, 0.0541, 0.8411]
[test epoch 17/100] | loss 27.5 | nw acc 0.664 | time 0 min 55 sec
cat 0: [74, 4, 0, 86] and [0.4512, 0.0244, 0.0, 0.5244]
cat 1: [4, 279, 0, 88] and [0.0108, 0.752, 0.0, 0.2372]
cat 2: [5, 36, 0, 290] and [0.0151, 0.1088, 0.0, 0.8761]
cat 3: [0, 2, 0, 752] and [0.0, 0.0027, 0.0, 0.9973]
[train epoch 18/100] | loss 0.95511 | nw acc 0.791 | time 4 min 17 sec
cat 0: [1183, 94, 53, 126] and [0.8125, 0.0646, 0.0364, 0.0865]
cat 1: [78, 2517, 279, 285] and [0.0247, 0.7968, 0.0883, 0.0902]
cat 2: [48, 101, 755, 195] and [0.0437, 0.0919, 0.687, 0.1774]
cat 3: [77, 144, 119, 1772] and [0.0365, 0.0682, 0.0563, 0.839]
[test epoch 18/100] | loss 27.9 | nw acc 0.656 | time 0 min 49 sec
cat 0: [71, 2, 0, 96] and [0.4201, 0.0118, 0.0, 0.568]
cat 1: [10, 316, 0, 181] and [0.0197, 0.6233, 0.0, 0.357]
cat 2: [2, 2, 0, 235] and [0.0084, 0.0084, 0.0, 0.9833]
cat 3: [0, 1, 0, 704] and [0.0, 0.0014, 0.0, 0.9986]
[train epoch 19/100] | loss 0.95237 | nw acc 0.794 | time 3 min 57 sec
cat 0: [1200, 103, 64, 126] and [0.8038, 0.069, 0.0429, 0.0844]
cat 1: [73, 2503, 273, 275] and [0.0234, 0.8012, 0.0874, 0.088]
cat 2: [52, 103, 750, 183] and [0.0478, 0.0947, 0.6893, 0.1682]
cat 3: [61, 147, 119, 1794] and [0.0288, 0.0693, 0.0561, 0.8458]
[test epoch 19/100] | loss 27.5 | nw acc 0.674 | time 0 min 57 sec
cat 0: [76, 3, 0, 120] and [0.3819, 0.0151, 0.0, 0.603]
cat 1: [6, 301, 0, 108] and [0.0145, 0.7253, 0.0, 0.2602]
cat 2: [1, 16, 0, 244] and [0.0038, 0.0613, 0.0, 0.9349]
cat 3: [0, 1, 0, 744] and [0.0, 0.0013, 0.0, 0.9987]
[train epoch 20/100] | loss 0.9477 | nw acc 0.797 | time 4 min 2 sec
cat 0: [1205, 102, 72, 117] and [0.8055, 0.0682, 0.0481, 0.0782]
cat 1: [75, 2512, 275, 268] and [0.024, 0.8026, 0.0879, 0.0856]
cat 2: [43, 107, 741, 180] and [0.0401, 0.0999, 0.6919, 0.1681]
cat 3: [63, 135, 118, 1813] and [0.0296, 0.0634, 0.0554, 0.8516]
[test epoch 20/100] | loss 26.5 | nw acc 0.716 | time 0 min 56 sec
cat 0: [79, 4, 0, 125] and [0.3798, 0.0192, 0.0, 0.601]
cat 1: [4, 313, 0, 124] and [0.0091, 0.7098, 0.0, 0.2812]
cat 2: [0, 2, 0, 167] and [0.0, 0.0118, 0.0, 0.9882]
cat 3: [0, 2, 0, 800] and [0.0, 0.0025, 0.0, 0.9975]
[train epoch 21/100] | loss 0.94476 | nw acc 0.803 | time 4 min 9 sec
cat 0: [1222, 95, 62, 133] and [0.8082, 0.0628, 0.041, 0.088]
cat 1: [65, 2541, 258, 267] and [0.0208, 0.8116, 0.0824, 0.0853]
cat 2: [27, 96, 756, 175] and [0.0256, 0.0911, 0.7173, 0.166]
cat 3: [72, 124, 130, 1803] and [0.0338, 0.0582, 0.0611, 0.8469]
[test epoch 21/100] | loss 27.6 | nw acc 0.663 | time 0 min 50 sec
cat 0: [77, 3, 0, 108] and [0.4096, 0.016, 0.0, 0.5745]
cat 1: [4, 294, 0, 113] and [0.0097, 0.7153, 0.0, 0.2749]
cat 2: [2, 22, 0, 263] and [0.007, 0.0767, 0.0, 0.9164]
cat 3: [0, 2, 0, 732] and [0.0, 0.0027, 0.0, 0.9973]
[train epoch 22/100] | loss 0.94012 | nw acc 0.804 | time 4 min 4 sec
cat 0: [1203, 89, 59, 118] and [0.8189, 0.0606, 0.0402, 0.0803]
cat 1: [68, 2540, 275, 265] and [0.0216, 0.8069, 0.0874, 0.0842]
cat 2: [43, 107, 772, 177] and [0.0391, 0.0974, 0.7025, 0.1611]
cat 3: [72, 120, 100, 1818] and [0.0341, 0.0569, 0.0474, 0.8616]
[test epoch 22/100] | loss 26.6 | nw acc 0.71 | time 0 min 51 sec
cat 0: [59, 1, 0, 29] and [0.6629, 0.0112, 0.0, 0.3258]
cat 1: [12, 312, 0, 146] and [0.0255, 0.6638, 0.0, 0.3106]
cat 2: [11, 7, 0, 231] and [0.0442, 0.0281, 0.0, 0.9277]
cat 3: [1, 1, 0, 810] and [0.0012, 0.0012, 0.0, 0.9975]
[train epoch 23/100] | loss 0.93759 | nw acc 0.808 | time 4 min 7 sec
cat 0: [1201, 78, 57, 104] and [0.834, 0.0542, 0.0396, 0.0722]
cat 1: [70, 2550, 270, 255] and [0.0223, 0.8108, 0.0859, 0.0811]
cat 2: [40, 91, 758, 166] and [0.0379, 0.0863, 0.7185, 0.1573]
cat 3: [75, 137, 121, 1853] and [0.0343, 0.0627, 0.0554, 0.8477]
[test epoch 23/100] | loss 26.9 | nw acc 0.689 | time 0 min 47 sec
cat 0: [78, 5, 0, 119] and [0.3861, 0.0248, 0.0, 0.5891]
cat 1: [4, 286, 0, 81] and [0.0108, 0.7709, 0.0, 0.2183]
cat 2: [1, 27, 0, 233] and [0.0038, 0.1034, 0.0, 0.8927]
cat 3: [0, 3, 0, 783] and [0.0, 0.0038, 0.0, 0.9962]
[train epoch 24/100] | loss 0.93594 | nw acc 0.811 | time 4 min 7 sec
cat 0: [1211, 83, 55, 110] and [0.83, 0.0569, 0.0377, 0.0754]
cat 1: [76, 2559, 254, 261] and [0.0241, 0.8124, 0.0806, 0.0829]
cat 2: [34, 95, 772, 168] and [0.0318, 0.0889, 0.7222, 0.1572]
cat 3: [65, 119, 125, 1839] and [0.0303, 0.0554, 0.0582, 0.8561]
[test epoch 24/100] | loss 27.3 | nw acc 0.675 | time 0 min 57 sec
cat 0: [78, 5, 0, 124] and [0.3768, 0.0242, 0.0, 0.599]
cat 1: [4, 289, 0, 101] and [0.0102, 0.7335, 0.0, 0.2563]
cat 2: [1, 25, 0, 234] and [0.0038, 0.0962, 0.0, 0.9]
cat 3: [0, 2, 0, 757] and [0.0, 0.0026, 0.0, 0.9974]
[train epoch 25/100] | loss 0.93269 | nw acc 0.812 | time 4 min 11 sec
cat 0: [1213, 76, 60, 114] and [0.8291, 0.0519, 0.041, 0.0779]
cat 1: [65, 2549, 259, 241] and [0.0209, 0.8186, 0.0832, 0.0774]
cat 2: [36, 100, 759, 150] and [0.0344, 0.0957, 0.7263, 0.1435]
cat 3: [72, 131, 128, 1873] and [0.0327, 0.0594, 0.0581, 0.8498]
[test epoch 25/100] | loss 26.2 | nw acc 0.722 | time 0 min 54 sec
cat 0: [77, 5, 0, 98] and [0.4278, 0.0278, 0.0, 0.5444]
cat 1: [4, 281, 0, 71] and [0.0112, 0.7893, 0.0, 0.1994]
cat 2: [2, 29, 0, 204] and [0.0085, 0.1234, 0.0, 0.8681]
cat 3: [0, 6, 0, 843] and [0.0, 0.0071, 0.0, 0.9929]
[train epoch 26/100] | loss 0.9268 | nw acc 0.821 | time 4 min 9 sec
cat 0: [1223, 73, 47, 125] and [0.8331, 0.0497, 0.032, 0.0851]
cat 1: [58, 2568, 243, 240] and [0.0187, 0.826, 0.0782, 0.0772]
cat 2: [40, 86, 804, 142] and [0.0373, 0.0802, 0.75, 0.1325]
cat 3: [65, 129, 112, 1871] and [0.0299, 0.0593, 0.0514, 0.8594]
[test epoch 26/100] | loss 26.5 | nw acc 0.71 | time 0 min 58 sec
cat 0: [70, 2, 0, 57] and [0.5426, 0.0155, 0.0, 0.4419]
cat 1: [6, 296, 0, 116] and [0.0144, 0.7081, 0.0, 0.2775]
cat 2: [6, 20, 0, 227] and [0.0237, 0.0791, 0.0, 0.8972]
cat 3: [1, 3, 0, 816] and [0.0012, 0.0037, 0.0, 0.9951]
[train epoch 27/100] | loss 0.925 | nw acc 0.823 | time 4 min 6 sec
cat 0: [1232, 74, 52, 115] and [0.8364, 0.0502, 0.0353, 0.0781]
cat 1: [53, 2571, 246, 250] and [0.017, 0.824, 0.0788, 0.0801]
cat 2: [39, 95, 807, 144] and [0.0359, 0.0876, 0.7438, 0.1327]
cat 3: [62, 116, 101, 1869] and [0.0289, 0.054, 0.047, 0.8701]
[test epoch 27/100] | loss 27.5 | nw acc 0.674 | time 0 min 49 sec
cat 0: [67, 1, 0, 48] and [0.5776, 0.0086, 0.0, 0.4138]
cat 1: [10, 315, 0, 190] and [0.0194, 0.6117, 0.0, 0.3689]
cat 2: [6, 4, 0, 239] and [0.0241, 0.0161, 0.0, 0.9598]
cat 3: [0, 1, 0, 739] and [0.0, 0.0014, 0.0, 0.9986]
[train epoch 28/100] | loss 0.91865 | nw acc 0.828 | time 4 min 7 sec
cat 0: [1231, 77, 53, 99] and [0.8432, 0.0527, 0.0363, 0.0678]
cat 1: [61, 2564, 225, 234] and [0.0198, 0.8314, 0.073, 0.0759]
cat 2: [19, 88, 801, 122] and [0.0184, 0.0854, 0.7777, 0.1184]
cat 3: [75, 127, 127, 1923] and [0.0333, 0.0564, 0.0564, 0.8539]
[test epoch 28/100] | loss 26.3 | nw acc 0.72 | time 0 min 55 sec
cat 0: [66, 1, 0, 43] and [0.6, 0.0091, 0.0, 0.3909]
cat 1: [8, 306, 0, 133] and [0.0179, 0.6846, 0.0, 0.2975]
cat 2: [8, 10, 0, 214] and [0.0345, 0.0431, 0.0, 0.9224]
cat 3: [1, 4, 0, 826] and [0.0012, 0.0048, 0.0, 0.994]
[train epoch 29/100] | loss 0.92025 | nw acc 0.825 | time 4 min 6 sec
cat 0: [1230, 66, 58, 103] and [0.8442, 0.0453, 0.0398, 0.0707]
cat 1: [56, 2560, 247, 225] and [0.0181, 0.829, 0.08, 0.0729]
cat 2: [37, 95, 780, 128] and [0.0356, 0.0913, 0.75, 0.1231]
cat 3: [63, 135, 121, 1922] and [0.0281, 0.0602, 0.054, 0.8577]
[test epoch 29/100] | loss 25.4 | nw acc 0.755 | time 0 min 50 sec
cat 0: [73, 1, 0, 58] and [0.553, 0.0076, 0.0, 0.4394]
cat 1: [7, 309, 0, 128] and [0.0158, 0.6959, 0.0, 0.2883]
cat 2: [2, 3, 0, 156] and [0.0124, 0.0186, 0.0, 0.9689]
cat 3: [1, 8, 0, 874] and [0.0011, 0.0091, 0.0, 0.9898]
[train epoch 30/100] | loss 0.91523 | nw acc 0.832 | time 4 min 5 sec
cat 0: [1238, 63, 43, 101] and [0.8567, 0.0436, 0.0298, 0.0699]
cat 1: [61, 2574, 236, 219] and [0.0197, 0.833, 0.0764, 0.0709]
cat 2: [33, 85, 802, 123] and [0.0316, 0.0815, 0.7689, 0.1179]
cat 3: [54, 134, 125, 1935] and [0.024, 0.0596, 0.0556, 0.8608]
[test epoch 30/100] | loss 27.8 | nw acc 0.658 | time 0 min 55 sec
cat 0: [63, 1, 0, 49] and [0.5575, 0.0088, 0.0, 0.4336]
cat 1: [5, 279, 0, 114] and [0.0126, 0.701, 0.0, 0.2864]
cat 2: [14, 37, 0, 300] and [0.0399, 0.1054, 0.0, 0.8547]
cat 3: [1, 4, 0, 753] and [0.0013, 0.0053, 0.0, 0.9934]
[train epoch 31/100] | loss 0.9161 | nw acc 0.831 | time 4 min 6 sec
cat 0: [1236, 84, 53, 101] and [0.8385, 0.057, 0.036, 0.0685]
cat 1: [56, 2549, 228, 199] and [0.0185, 0.8407, 0.0752, 0.0656]
cat 2: [29, 90, 799, 120] and [0.0279, 0.0867, 0.7697, 0.1156]
cat 3: [65, 133, 126, 1958] and [0.0285, 0.0583, 0.0552, 0.858]
[test epoch 31/100] | loss 27.9 | nw acc 0.659 | time 0 min 53 sec
cat 0: [72, 1, 0, 70] and [0.5035, 0.007, 0.0, 0.4895]
cat 1: [5, 293, 0, 137] and [0.0115, 0.6736, 0.0, 0.3149]
cat 2: [6, 25, 0, 277] and [0.0195, 0.0812, 0.0, 0.8994]
cat 3: [0, 2, 0, 732] and [0.0, 0.0027, 0.0, 0.9973]
[train epoch 32/100] | loss 0.90822 | nw acc 0.839 | time 4 min 5 sec
cat 0: [1245, 62, 53, 98] and [0.8539, 0.0425, 0.0364, 0.0672]
cat 1: [57, 2585, 220, 204] and [0.0186, 0.8431, 0.0718, 0.0665]
cat 2: [19, 81, 813, 112] and [0.0185, 0.079, 0.7932, 0.1093]
cat 3: [65, 128, 120, 1964] and [0.0285, 0.0562, 0.0527, 0.8625]
[test epoch 32/100] | loss 26.9 | nw acc 0.686 | time 0 min 54 sec
cat 0: [63, 1, 0, 55] and [0.5294, 0.0084, 0.0, 0.4622]
cat 1: [5, 288, 0, 115] and [0.0123, 0.7059, 0.0, 0.2819]
cat 2: [13, 26, 0, 256] and [0.0441, 0.0881, 0.0, 0.8678]
cat 3: [2, 6, 0, 790] and [0.0025, 0.0075, 0.0, 0.99]
[train epoch 33/100] | loss 0.90492 | nw acc 0.841 | time 4 min 6 sec
cat 0: [1256, 68, 52, 85] and [0.8597, 0.0465, 0.0356, 0.0582]
cat 1: [56, 2574, 228, 200] and [0.0183, 0.8417, 0.0746, 0.0654]
cat 2: [21, 79, 811, 112] and [0.0205, 0.0772, 0.7928, 0.1095]
cat 3: [53, 135, 115, 1981] and [0.0232, 0.0591, 0.0504, 0.8673]
[test epoch 33/100] | loss 26.8 | nw acc 0.695 | time 0 min 48 sec
cat 0: [77, 6, 0, 89] and [0.4477, 0.0349, 0.0, 0.5174]
cat 1: [3, 272, 0, 74] and [0.0086, 0.7794, 0.0, 0.212]
cat 2: [3, 34, 0, 245] and [0.0106, 0.1206, 0.0, 0.8688]
cat 3: [0, 9, 0, 808] and [0.0, 0.011, 0.0, 0.989]
[train epoch 34/100] | loss 0.90416 | nw acc 0.844 | time 4 min 5 sec
cat 0: [1249, 69, 52, 99] and [0.8502, 0.047, 0.0354, 0.0674]
cat 1: [54, 2576, 224, 167] and [0.0179, 0.8527, 0.0741, 0.0553]
cat 2: [21, 81, 808, 98] and [0.0208, 0.0804, 0.8016, 0.0972]
cat 3: [62, 130, 122, 2014] and [0.0266, 0.0558, 0.0524, 0.8651]
[test epoch 34/100] | loss 25.1 | nw acc 0.754 | time 0 min 53 sec
cat 0: [59, 1, 0, 34] and [0.6277, 0.0106, 0.0, 0.3617]
cat 1: [7, 297, 0, 107] and [0.017, 0.7226, 0.0, 0.2603]
cat 2: [10, 11, 0, 177] and [0.0505, 0.0556, 0.0, 0.8939]
cat 3: [7, 12, 0, 898] and [0.0076, 0.0131, 0.0, 0.9793]
[train epoch 35/100] | loss 0.90156 | nw acc 0.846 | time 4 min 5 sec
cat 0: [1244, 64, 39, 83] and [0.8699, 0.0448, 0.0273, 0.058]
cat 1: [64, 2580, 226, 175] and [0.021, 0.8473, 0.0742, 0.0575]
cat 2: [21, 77, 820, 106] and [0.0205, 0.0752, 0.8008, 0.1035]
cat 3: [57, 135, 121, 2014] and [0.0245, 0.058, 0.052, 0.8655]
[test epoch 35/100] | loss 26.5 | nw acc 0.706 | time 0 min 53 sec
cat 0: [68, 1, 0, 45] and [0.5965, 0.0088, 0.0, 0.3947]
cat 1: [6, 300, 0, 133] and [0.0137, 0.6834, 0.0, 0.303]
cat 2: [6, 11, 0, 231] and [0.0242, 0.0444, 0.0, 0.9315]
cat 3: [3, 9, 0, 807] and [0.0037, 0.011, 0.0, 0.9853]
[train epoch 36/100] | loss 0.89662 | nw acc 0.85 | time 4 min 6 sec
cat 0: [1237, 57, 39, 85] and [0.8724, 0.0402, 0.0275, 0.0599]
cat 1: [59, 2595, 224, 159] and [0.0194, 0.8545, 0.0738, 0.0524]
cat 2: [33, 74, 824, 101] and [0.032, 0.0717, 0.7984, 0.0979]
cat 3: [57, 130, 119, 2033] and [0.0244, 0.0556, 0.0509, 0.8692]
[test epoch 36/100] | loss 25.8 | nw acc 0.733 | time 0 min 53 sec
cat 0: [71, 2, 0, 66] and [0.5108, 0.0144, 0.0, 0.4748]
cat 1: [6, 302, 0, 106] and [0.0145, 0.7295, 0.0, 0.256]
cat 2: [4, 7, 0, 197] and [0.0192, 0.0337, 0.0, 0.9471]
cat 3: [2, 10, 0, 847] and [0.0023, 0.0116, 0.0, 0.986]
[train epoch 37/100] | loss 0.89554 | nw acc 0.852 | time 4 min 6 sec
cat 0: [1253, 58, 49, 89] and [0.8647, 0.04, 0.0338, 0.0614]
cat 1: [53, 2593, 218, 160] and [0.0175, 0.8575, 0.0721, 0.0529]
cat 2: [25, 75, 828, 96] and [0.0244, 0.0732, 0.8086, 0.0938]
cat 3: [55, 130, 111, 2033] and [0.0236, 0.0558, 0.0477, 0.8729]
[test epoch 37/100] | loss 25.7 | nw acc 0.734 | time 0 min 50 sec
cat 0: [71, 1, 0, 54] and [0.5635, 0.0079, 0.0, 0.4286]
cat 1: [5, 290, 0, 84] and [0.0132, 0.7652, 0.0, 0.2216]
cat 2: [4, 18, 0, 218] and [0.0167, 0.075, 0.0, 0.9083]
cat 3: [3, 12, 0, 860] and [0.0034, 0.0137, 0.0, 0.9829]
[train epoch 38/100] | loss 0.89658 | nw acc 0.848 | time 4 min 11 sec
cat 0: [1247, 72, 45, 73] and [0.8678, 0.0501, 0.0313, 0.0508]
cat 1: [67, 2568, 215, 165] and [0.0222, 0.8517, 0.0713, 0.0547]
cat 2: [16, 75, 829, 110] and [0.0155, 0.0728, 0.8049, 0.1068]
cat 3: [56, 141, 117, 2030] and [0.0239, 0.0602, 0.0499, 0.866]
[test epoch 38/100] | loss 26.6 | nw acc 0.698 | time 0 min 51 sec
cat 0: [64, 2, 0, 53] and [0.5378, 0.0168, 0.0, 0.4454]
cat 1: [4, 273, 0, 77] and [0.0113, 0.7712, 0.0, 0.2175]
cat 2: [13, 35, 0, 262] and [0.0419, 0.1129, 0.0, 0.8452]
cat 3: [2, 11, 0, 824] and [0.0024, 0.0131, 0.0, 0.9845]
[train epoch 39/100] | loss 0.88969 | nw acc 0.86 | time 4 min 4 sec
cat 0: [1268, 56, 38, 82] and [0.8781, 0.0388, 0.0263, 0.0568]
cat 1: [52, 2608, 209, 144] and [0.0173, 0.8656, 0.0694, 0.0478]
cat 2: [22, 78, 849, 109] and [0.0208, 0.0737, 0.8025, 0.103]
cat 3: [44, 114, 110, 2043] and [0.019, 0.0493, 0.0476, 0.884]
[test epoch 39/100] | loss 25.5 | nw acc 0.738 | time 0 min 50 sec
cat 0: [67, 3, 0, 49] and [0.563, 0.0252, 0.0, 0.4118]
cat 1: [3, 271, 0, 63] and [0.0089, 0.8042, 0.0, 0.1869]
cat 2: [9, 35, 0, 214] and [0.0349, 0.1357, 0.0, 0.8295]
cat 3: [4, 12, 0, 890] and [0.0044, 0.0132, 0.0, 0.9823]
[train epoch 40/100] | loss 0.8876 | nw acc 0.86 | time 4 min 11 sec
cat 0: [1258, 58, 44, 68] and [0.881, 0.0406, 0.0308, 0.0476]
cat 1: [50, 2596, 218, 137] and [0.0167, 0.865, 0.0726, 0.0457]
cat 2: [25, 68, 837, 93] and [0.0244, 0.0665, 0.8182, 0.0909]
cat 3: [53, 134, 107, 2080] and [0.0223, 0.0564, 0.0451, 0.8762]
[test epoch 40/100] | loss 25.9 | nw acc 0.725 | time 0 min 52 sec
cat 0: [69, 1, 0, 55] and [0.552, 0.008, 0.0, 0.44]
cat 1: [5, 278, 0, 73] and [0.014, 0.7809, 0.0, 0.2051]
cat 2: [6, 30, 0, 229] and [0.0226, 0.1132, 0.0, 0.8642]
cat 3: [3, 12, 0, 859] and [0.0034, 0.0137, 0.0, 0.9828]
[train epoch 41/100] | loss 0.8852 | nw acc 0.863 | time 4 min 7 sec
cat 0: [1266, 63, 38, 87] and [0.8707, 0.0433, 0.0261, 0.0598]
cat 1: [50, 2612, 199, 146] and [0.0166, 0.8686, 0.0662, 0.0486]
cat 2: [22, 75, 858, 87] and [0.0211, 0.072, 0.8234, 0.0835]
cat 3: [48, 106, 111, 2058] and [0.0207, 0.0456, 0.0478, 0.8859]
[test epoch 41/100] | loss 26.5 | nw acc 0.709 | time 0 min 54 sec
cat 0: [65, 1, 0, 37] and [0.6311, 0.0097, 0.0, 0.3592]
cat 1: [8, 313, 0, 173] and [0.0162, 0.6336, 0.0, 0.3502]
cat 2: [7, 1, 0, 204] and [0.033, 0.0047, 0.0, 0.9623]
cat 3: [3, 6, 0, 802] and [0.0037, 0.0074, 0.0, 0.9889]
[train epoch 42/100] | loss 0.88707 | nw acc 0.857 | time 4 min 1 sec
cat 0: [1251, 56, 47, 94] and [0.864, 0.0387, 0.0325, 0.0649]
cat 1: [54, 2603, 205, 140] and [0.018, 0.8671, 0.0683, 0.0466]
cat 2: [22, 74, 845, 97] and [0.0212, 0.0713, 0.8141, 0.0934]
cat 3: [59, 123, 109, 2047] and [0.0252, 0.0526, 0.0466, 0.8755]
[test epoch 42/100] | loss 25.1 | nw acc 0.75 | time 0 min 52 sec
cat 0: [64, 1, 0, 42] and [0.5981, 0.0093, 0.0, 0.3925]
cat 1: [5, 282, 0, 78] and [0.0137, 0.7726, 0.0, 0.2137]
cat 2: [10, 26, 0, 194] and [0.0435, 0.113, 0.0, 0.8435]
cat 3: [4, 12, 0, 902] and [0.0044, 0.0131, 0.0, 0.9826]
[train epoch 43/100] | loss 0.88494 | nw acc 0.861 | time 4 min 8 sec
cat 0: [1260, 59, 50, 69] and [0.8762, 0.041, 0.0348, 0.048]
cat 1: [50, 2602, 195, 155] and [0.0167, 0.8668, 0.065, 0.0516]
cat 2: [22, 82, 863, 103] and [0.0206, 0.0766, 0.8065, 0.0963]
cat 3: [54, 113, 98, 2051] and [0.0233, 0.0488, 0.0423, 0.8856]
[test epoch 43/100] | loss 26.2 | nw acc 0.715 | time 0 min 54 sec
cat 0: [69, 1, 0, 50] and [0.575, 0.0083, 0.0, 0.4167]
cat 1: [6, 298, 0, 130] and [0.0138, 0.6866, 0.0, 0.2995]
cat 2: [6, 12, 0, 213] and [0.026, 0.0519, 0.0, 0.9221]
cat 3: [2, 10, 0, 823] and [0.0024, 0.012, 0.0, 0.9856]
[train epoch 44/100] | loss 0.88432 | nw acc 0.862 | time 4 min 4 sec
cat 0: [1267, 55, 46, 69] and [0.8817, 0.0383, 0.032, 0.048]
cat 1: [45, 2604, 214, 149] and [0.0149, 0.8645, 0.071, 0.0495]
cat 2: [25, 63, 853, 99] and [0.024, 0.0606, 0.8202, 0.0952]
cat 3: [49, 134, 93, 2061] and [0.021, 0.0573, 0.0398, 0.8819]
[test epoch 44/100] | loss 25.7 | nw acc 0.725 | time 0 min 51 sec
cat 0: [58, 1, 0, 38] and [0.5979, 0.0103, 0.0, 0.3918]
cat 1: [6, 285, 0, 95] and [0.0155, 0.7383, 0.0, 0.2461]
cat 2: [13, 24, 0, 220] and [0.0506, 0.0934, 0.0, 0.856]
cat 3: [6, 11, 0, 863] and [0.0068, 0.0125, 0.0, 0.9807]
[train epoch 45/100] | loss 0.88225 | nw acc 0.864 | time 4 min 9 sec
cat 0: [1259, 55, 46, 68] and [0.8817, 0.0385, 0.0322, 0.0476]
cat 1: [49, 2609, 202, 141] and [0.0163, 0.8694, 0.0673, 0.047]
cat 2: [25, 75, 850, 89] and [0.0241, 0.0722, 0.8181, 0.0857]
cat 3: [53, 117, 108, 2080] and [0.0225, 0.0496, 0.0458, 0.8821]
[test epoch 45/100] | loss 25 | nw acc 0.759 | time 0 min 53 sec
cat 0: [71, 5, 0, 54] and [0.5462, 0.0385, 0.0, 0.4154]
cat 1: [3, 264, 0, 46] and [0.0096, 0.8435, 0.0, 0.147]
cat 2: [5, 37, 0, 188] and [0.0217, 0.1609, 0.0, 0.8174]
cat 3: [4, 15, 0, 928] and [0.0042, 0.0158, 0.0, 0.9799]
[train epoch 46/100] | loss 0.88128 | nw acc 0.863 | time 4 min 8 sec
cat 0: [1268, 53, 45, 81] and [0.8763, 0.0366, 0.0311, 0.056]
cat 1: [53, 2594, 191, 134] and [0.0178, 0.8728, 0.0643, 0.0451]
cat 2: [18, 85, 869, 99] and [0.0168, 0.0794, 0.8114, 0.0924]
cat 3: [47, 124, 101, 2064] and [0.0201, 0.0531, 0.0432, 0.8836]
[test epoch 46/100] | loss 25.2 | nw acc 0.748 | time 0 min 52 sec
cat 0: [61, 1, 0, 40] and [0.598, 0.0098, 0.0, 0.3922]
cat 1: [4, 274, 0, 64] and [0.0117, 0.8012, 0.0, 0.1871]
cat 2: [12, 34, 0, 202] and [0.0484, 0.1371, 0.0, 0.8145]
cat 3: [6, 12, 0, 910] and [0.0065, 0.0129, 0.0, 0.9806]
[train epoch 47/100] | loss 0.87806 | nw acc 0.868 | time 4 min 8 sec
cat 0: [1271, 52, 42, 76] and [0.882, 0.0361, 0.0291, 0.0527]
cat 1: [46, 2617, 198, 133] and [0.0154, 0.8741, 0.0661, 0.0444]
cat 2: [20, 79, 859, 84] and [0.0192, 0.0758, 0.8244, 0.0806]
cat 3: [49, 108, 107, 2085] and [0.0209, 0.046, 0.0456, 0.8876]
[test epoch 47/100] | loss 24.8 | nw acc 0.76 | time 0 min 50 sec
cat 0: [69, 1, 0, 45] and [0.6, 0.0087, 0.0, 0.3913]
cat 1: [5, 286, 0, 79] and [0.0135, 0.773, 0.0, 0.2135]
cat 2: [5, 20, 0, 183] and [0.024, 0.0962, 0.0, 0.8798]
cat 3: [4, 14, 0, 909] and [0.0043, 0.0151, 0.0, 0.9806]
[train epoch 48/100] | loss 0.87663 | nw acc 0.867 | time 4 min 15 sec
cat 0: [1271, 49, 37, 74] and [0.8882, 0.0342, 0.0259, 0.0517]
cat 1: [47, 2612, 209, 129] and [0.0157, 0.8715, 0.0697, 0.043]
cat 2: [23, 67, 847, 82] and [0.0226, 0.0658, 0.8312, 0.0805]
cat 3: [45, 128, 113, 2093] and [0.0189, 0.0538, 0.0475, 0.8798]
[test epoch 48/100] | loss 26.1 | nw acc 0.725 | time 0 min 48 sec
cat 0: [71, 1, 0, 53] and [0.568, 0.008, 0.0, 0.424]
cat 1: [5, 284, 0, 96] and [0.013, 0.7377, 0.0, 0.2494]
cat 2: [5, 26, 0, 216] and [0.0202, 0.1053, 0.0, 0.8745]
cat 3: [2, 10, 0, 851] and [0.0023, 0.0116, 0.0, 0.9861]
[train epoch 49/100] | loss 0.87291 | nw acc 0.874 | time 4 min 6 sec
cat 0: [1272, 48, 45, 61] and [0.892, 0.0337, 0.0316, 0.0428]
cat 1: [50, 2642, 204, 131] and [0.0165, 0.8728, 0.0674, 0.0433]
cat 2: [19, 63, 856, 76] and [0.0187, 0.0621, 0.8442, 0.075]
cat 3: [45, 103, 101, 2110] and [0.0191, 0.0437, 0.0428, 0.8944]
[test epoch 49/100] | loss 24.5 | nw acc 0.775 | time 0 min 51 sec
cat 0: [69, 2, 0, 53] and [0.5565, 0.0161, 0.0, 0.4274]
cat 1: [4, 269, 0, 46] and [0.0125, 0.8433, 0.0, 0.1442]
cat 2: [5, 33, 0, 165] and [0.0246, 0.1626, 0.0, 0.8128]
cat 3: [5, 17, 0, 952] and [0.0051, 0.0175, 0.0, 0.9774]
[train epoch 50/100] | loss 0.87175 | nw acc 0.873 | time 4 min 12 sec
cat 0: [1263, 54, 35, 77] and [0.8838, 0.0378, 0.0245, 0.0539]
cat 1: [41, 2632, 188, 121] and [0.0137, 0.8826, 0.063, 0.0406]
cat 2: [25, 68, 879, 82] and [0.0237, 0.0645, 0.834, 0.0778]
cat 3: [57, 102, 104, 2098] and [0.0241, 0.0432, 0.044, 0.8886]
[test epoch 50/100] | loss 26 | nw acc 0.716 | time 0 min 50 sec
cat 0: [57, 1, 0, 39] and [0.5876, 0.0103, 0.0, 0.4021]
cat 1: [6, 280, 0, 88] and [0.016, 0.7487, 0.0, 0.2353]
cat 2: [16, 29, 0, 235] and [0.0571, 0.1036, 0.0, 0.8393]
cat 3: [4, 11, 0, 854] and [0.0046, 0.0127, 0.0, 0.9827]
[train epoch 51/100] | loss 0.87477 | nw acc 0.868 | time 4 min 5 sec
cat 0: [1266, 50, 38, 73] and [0.8872, 0.035, 0.0266, 0.0512]
cat 1: [44, 2615, 199, 126] and [0.0147, 0.8763, 0.0667, 0.0422]
cat 2: [26, 73, 869, 95] and [0.0245, 0.0687, 0.8175, 0.0894]
cat 3: [50, 118, 100, 2084] and [0.0213, 0.0502, 0.0425, 0.8861]
[test epoch 51/100] | loss 25.7 | nw acc 0.735 | time 0 min 48 sec
cat 0: [66, 1, 0, 45] and [0.5893, 0.0089, 0.0, 0.4018]
cat 1: [6, 298, 0, 119] and [0.0142, 0.7045, 0.0, 0.2813]
cat 2: [8, 13, 0, 193] and [0.0374, 0.0607, 0.0, 0.9019]
cat 3: [3, 9, 0, 859] and [0.0034, 0.0103, 0.0, 0.9862]
[train epoch 52/100] | loss 0.8701 | nw acc 0.877 | time 4 min 6 sec
cat 0: [1281, 46, 30, 74] and [0.8952, 0.0321, 0.021, 0.0517]
cat 1: [42, 2653, 209, 123] and [0.0139, 0.8764, 0.069, 0.0406]
cat 2: [20, 64, 865, 76] and [0.0195, 0.0624, 0.8439, 0.0741]
cat 3: [43, 93, 102, 2105] and [0.0184, 0.0397, 0.0435, 0.8984]
[test epoch 52/100] | loss 26.3 | nw acc 0.704 | time 0 min 50 sec
cat 0: [60, 1, 0, 48] and [0.5505, 0.0092, 0.0, 0.4404]
cat 1: [4, 263, 0, 66] and [0.012, 0.7898, 0.0, 0.1982]
cat 2: [14, 44, 0, 253] and [0.045, 0.1415, 0.0, 0.8135]
cat 3: [5, 13, 0, 849] and [0.0058, 0.015, 0.0, 0.9792]
[train epoch 53/100] | loss 0.8732 | nw acc 0.87 | time 4 min 0 sec
cat 0: [1278, 52, 43, 76] and [0.882, 0.0359, 0.0297, 0.0524]
cat 1: [51, 2608, 193, 130] and [0.0171, 0.8746, 0.0647, 0.0436]
cat 2: [18, 73, 881, 92] and [0.0169, 0.0686, 0.828, 0.0865]
cat 3: [39, 123, 89, 2080] and [0.0167, 0.0528, 0.0382, 0.8923]
[test epoch 53/100] | loss 26.4 | nw acc 0.715 | time 0 min 53 sec
cat 0: [70, 1, 0, 50] and [0.5785, 0.0083, 0.0, 0.4132]
cat 1: [6, 302, 0, 146] and [0.0132, 0.6652, 0.0, 0.3216]
cat 2: [6, 12, 0, 203] and [0.0271, 0.0543, 0.0, 0.9186]
cat 3: [1, 6, 0, 817] and [0.0012, 0.0073, 0.0, 0.9915]
[train epoch 54/100] | loss 0.86557 | nw acc 0.882 | time 3 min 55 sec
cat 0: [1283, 47, 32, 67] and [0.8978, 0.0329, 0.0224, 0.0469]
cat 1: [45, 2642, 190, 102] and [0.0151, 0.8869, 0.0638, 0.0342]
cat 2: [17, 69, 895, 85] and [0.0159, 0.0647, 0.8396, 0.0797]
cat 3: [41, 98, 89, 2124] and [0.0174, 0.0417, 0.0378, 0.9031]
[test epoch 54/100] | loss 26.2 | nw acc 0.709 | time 0 min 48 sec
cat 0: [58, 1, 0, 42] and [0.5743, 0.0099, 0.0, 0.4158]
cat 1: [6, 277, 0, 84] and [0.0163, 0.7548, 0.0, 0.2289]
cat 2: [17, 32, 0, 245] and [0.0578, 0.1088, 0.0, 0.8333]
cat 3: [2, 11, 0, 845] and [0.0023, 0.0128, 0.0, 0.9848]
[train epoch 55/100] | loss 0.8674 | nw acc 0.877 | time 3 min 58 sec
cat 0: [1286, 48, 47, 68] and [0.8875, 0.0331, 0.0324, 0.0469]
cat 1: [42, 2623, 190, 113] and [0.0142, 0.8838, 0.064, 0.0381]
cat 2: [16, 72, 879, 82] and [0.0153, 0.0686, 0.8379, 0.0782]
cat 3: [42, 113, 90, 2115] and [0.0178, 0.0479, 0.0381, 0.8962]
[test epoch 55/100] | loss 26.3 | nw acc 0.711 | time 0 min 50 sec
cat 0: [65, 1, 0, 48] and [0.5702, 0.0088, 0.0, 0.4211]
cat 1: [5, 282, 0, 95] and [0.0131, 0.7382, 0.0, 0.2487]
cat 2: [12, 29, 0, 237] and [0.0432, 0.1043, 0.0, 0.8525]
cat 3: [1, 9, 0, 836] and [0.0012, 0.0106, 0.0, 0.9882]
[train epoch 56/100] | loss 0.86605 | nw acc 0.879 | time 3 min 59 sec
cat 0: [1279, 41, 52, 69] and [0.8876, 0.0285, 0.0361, 0.0479]
cat 1: [44, 2642, 176, 112] and [0.0148, 0.8884, 0.0592, 0.0377]
cat 2: [21, 63, 885, 87] and [0.0199, 0.0597, 0.8381, 0.0824]
cat 3: [42, 110, 93, 2110] and [0.0178, 0.0467, 0.0395, 0.896]
[test epoch 56/100] | loss 26.9 | nw acc 0.684 | time 0 min 51 sec
cat 0: [50, 1, 0, 28] and [0.6329, 0.0127, 0.0, 0.3544]
cat 1: [9, 300, 0, 163] and [0.0191, 0.6356, 0.0, 0.3453]
cat 2: [22, 15, 0, 237] and [0.0803, 0.0547, 0.0, 0.865]
cat 3: [2, 5, 0, 788] and [0.0025, 0.0063, 0.0, 0.9912]
[train epoch 57/100] | loss 0.86527 | nw acc 0.88 | time 4 min 0 sec
cat 0: [1274, 42, 38, 66] and [0.8972, 0.0296, 0.0268, 0.0465]
cat 1: [51, 2655, 174, 125] and [0.017, 0.8835, 0.0579, 0.0416]
cat 2: [24, 61, 898, 90] and [0.0224, 0.0568, 0.8369, 0.0839]
cat 3: [37, 98, 96, 2097] and [0.0159, 0.0421, 0.0412, 0.9008]
[test epoch 57/100] | loss 27 | nw acc 0.686 | time 0 min 50 sec
cat 0: [56, 1, 0, 41] and [0.5714, 0.0102, 0.0, 0.4184]
cat 1: [6, 278, 0, 99] and [0.0157, 0.7258, 0.0, 0.2585]
cat 2: [19, 33, 0, 268] and [0.0594, 0.1031, 0.0, 0.8375]
cat 3: [2, 9, 0, 808] and [0.0024, 0.011, 0.0, 0.9866]
[train epoch 58/100] | loss 0.86317 | nw acc 0.882 | time 4 min 8 sec
cat 0: [1277, 43, 31, 58] and [0.9063, 0.0305, 0.022, 0.0412]
cat 1: [51, 2640, 185, 114] and [0.0171, 0.8829, 0.0619, 0.0381]
cat 2: [20, 66, 904, 86] and [0.0186, 0.0613, 0.8401, 0.0799]
cat 3: [38, 107, 86, 2120] and [0.0162, 0.0455, 0.0366, 0.9017]
[test epoch 58/100] | loss 25.2 | nw acc 0.746 | time 0 min 48 sec
cat 0: [58, 1, 0, 31] and [0.6444, 0.0111, 0.0, 0.3444]
cat 1: [7, 292, 0, 95] and [0.0178, 0.7411, 0.0, 0.2411]
cat 2: [12, 17, 0, 198] and [0.0529, 0.0749, 0.0, 0.8722]
cat 3: [6, 11, 0, 892] and [0.0066, 0.0121, 0.0, 0.9813]
[train epoch 59/100] | loss 0.86367 | nw acc 0.882 | time 4 min 1 sec
cat 0: [1278, 48, 39, 54] and [0.9006, 0.0338, 0.0275, 0.0381]
cat 1: [36, 2648, 172, 116] and [0.0121, 0.891, 0.0579, 0.039]
cat 2: [17, 63, 896, 84] and [0.016, 0.0594, 0.8453, 0.0792]
cat 3: [55, 97, 99, 2124] and [0.0232, 0.0408, 0.0417, 0.8943]
[test epoch 59/100] | loss 27.1 | nw acc 0.675 | time 0 min 49 sec
cat 0: [49, 1, 0, 30] and [0.6125, 0.0125, 0.0, 0.375]
cat 1: [6, 285, 0, 132] and [0.0142, 0.6738, 0.0, 0.3121]
cat 2: [26, 28, 0, 264] and [0.0818, 0.0881, 0.0, 0.8302]
cat 3: [2, 7, 0, 790] and [0.0025, 0.0088, 0.0, 0.9887]
[train epoch 60/100] | loss 0.86251 | nw acc 0.882 | time 4 min 0 sec
cat 0: [1281, 42, 35, 60] and [0.9034, 0.0296, 0.0247, 0.0423]
cat 1: [44, 2632, 164, 117] and [0.0149, 0.8901, 0.0555, 0.0396]
cat 2: [18, 76, 912, 83] and [0.0165, 0.0698, 0.8375, 0.0762]
cat 3: [43, 106, 95, 2118] and [0.0182, 0.0449, 0.0402, 0.8967]
[test epoch 60/100] | loss 25.6 | nw acc 0.731 | time 0 min 51 sec
cat 0: [56, 1, 0, 35] and [0.6087, 0.0109, 0.0, 0.3804]
cat 1: [6, 274, 0, 76] and [0.0169, 0.7697, 0.0, 0.2135]
cat 2: [15, 34, 0, 218] and [0.0562, 0.1273, 0.0, 0.8165]
cat 3: [6, 12, 0, 887] and [0.0066, 0.0133, 0.0, 0.9801]
[train epoch 61/100] | loss 0.86186 | nw acc 0.883 | time 6 min 14 sec
cat 0: [1278, 49, 39, 63] and [0.8943, 0.0343, 0.0273, 0.0441]
cat 1: [50, 2640, 178, 98] and [0.0169, 0.8901, 0.06, 0.033]
cat 2: [22, 71, 895, 80] and [0.0206, 0.0665, 0.838, 0.0749]
cat 3: [36, 96, 94, 2137] and [0.0152, 0.0406, 0.0398, 0.9044]
[test epoch 61/100] | loss 25.4 | nw acc 0.734 | time 0 min 48 sec
cat 0: [64, 2, 0, 45] and [0.5766, 0.018, 0.0, 0.4054]
cat 1: [5, 279, 0, 79] and [0.0138, 0.7686, 0.0, 0.2176]
cat 2: [10, 28, 0, 214] and [0.0397, 0.1111, 0.0, 0.8492]
cat 3: [4, 12, 0, 878] and [0.0045, 0.0134, 0.0, 0.9821]
[train epoch 62/100] | loss 0.85926 | nw acc 0.885 | time 5 min 40 sec
cat 0: [1283, 49, 38, 63] and [0.8953, 0.0342, 0.0265, 0.044]
cat 1: [41, 2653, 174, 98] and [0.0138, 0.8945, 0.0587, 0.033]
cat 2: [26, 59, 907, 95] and [0.0239, 0.0543, 0.8344, 0.0874]
cat 3: [36, 95, 87, 2122] and [0.0154, 0.0406, 0.0372, 0.9068]
[test epoch 62/100] | loss 26.1 | nw acc 0.724 | time 0 min 48 sec
cat 0: [71, 3, 0, 55] and [0.5504, 0.0233, 0.0, 0.4264]
cat 1: [5, 275, 0, 81] and [0.0139, 0.7618, 0.0, 0.2244]
cat 2: [6, 33, 0, 222] and [0.023, 0.1264, 0.0, 0.8506]
cat 3: [1, 10, 0, 858] and [0.0012, 0.0115, 0.0, 0.9873]
[train epoch 63/100] | loss 0.86034 | nw acc 0.885 | time 7 min 17 sec
cat 0: [1283, 45, 34, 61] and [0.9016, 0.0316, 0.0239, 0.0429]
cat 1: [37, 2641, 165, 113] and [0.0125, 0.8934, 0.0558, 0.0382]
cat 2: [15, 67, 909, 69] and [0.0142, 0.0632, 0.8575, 0.0651]
cat 3: [51, 103, 98, 2135] and [0.0214, 0.0432, 0.0411, 0.8944]
[test epoch 63/100] | loss 26 | nw acc 0.724 | time 0 min 48 sec
cat 0: [68, 1, 0, 48] and [0.5812, 0.0085, 0.0, 0.4103]
cat 1: [5, 282, 0, 95] and [0.0131, 0.7382, 0.0, 0.2487]
cat 2: [8, 28, 0, 219] and [0.0314, 0.1098, 0.0, 0.8588]
cat 3: [2, 10, 0, 854] and [0.0023, 0.0115, 0.0, 0.9861]
[train epoch 64/100] | loss 0.85592 | nw acc 0.891 | time 6 min 7 sec
cat 0: [1292, 42, 34, 56] and [0.9073, 0.0295, 0.0239, 0.0393]
cat 1: [42, 2665, 173, 99] and [0.0141, 0.8946, 0.0581, 0.0332]
cat 2: [17, 62, 915, 79] and [0.0158, 0.0578, 0.8527, 0.0736]
cat 3: [35, 87, 84, 2144] and [0.0149, 0.037, 0.0357, 0.9123]
[test epoch 64/100] | loss 26.7 | nw acc 0.69 | time 0 min 46 sec
cat 0: [36, 1, 0, 13] and [0.72, 0.02, 0.0, 0.26]
cat 1: [6, 252, 0, 71] and [0.0182, 0.766, 0.0, 0.2158]
cat 2: [38, 56, 0, 272] and [0.1038, 0.153, 0.0, 0.7432]
cat 3: [3, 12, 0, 860] and [0.0034, 0.0137, 0.0, 0.9829]
[train epoch 65/100] | loss 0.8579 | nw acc 0.886 | time 7 min 37 sec
cat 0: [1276, 39, 35, 52] and [0.9101, 0.0278, 0.025, 0.0371]
cat 1: [50, 2651, 153, 118] and [0.0168, 0.892, 0.0515, 0.0397]
cat 2: [15, 78, 915, 78] and [0.0138, 0.0718, 0.8425, 0.0718]
cat 3: [45, 88, 103, 2130] and [0.019, 0.0372, 0.0435, 0.9003]
[test epoch 65/100] | loss 25.1 | nw acc 0.751 | time 0 min 47 sec
cat 0: [62, 2, 0, 42] and [0.5849, 0.0189, 0.0, 0.3962]
cat 1: [4, 263, 0, 55] and [0.0124, 0.8168, 0.0, 0.1708]
cat 2: [10, 37, 0, 195] and [0.0413, 0.1529, 0.0, 0.8058]
cat 3: [7, 19, 0, 924] and [0.0074, 0.02, 0.0, 0.9726]
[train epoch 66/100] | loss 0.85556 | nw acc 0.89 | time 4 min 51 sec
cat 0: [1292, 44, 33, 64] and [0.9016, 0.0307, 0.023, 0.0447]
cat 1: [41, 2665, 156, 110] and [0.0138, 0.8967, 0.0525, 0.037]
cat 2: [17, 54, 918, 73] and [0.016, 0.0508, 0.8644, 0.0687]
cat 3: [36, 93, 99, 2131] and [0.0153, 0.0394, 0.042, 0.9033]
[test epoch 66/100] | loss 25.9 | nw acc 0.721 | time 0 min 45 sec
cat 0: [65, 2, 0, 43] and [0.5909, 0.0182, 0.0, 0.3909]
cat 1: [5, 268, 0, 76] and [0.0143, 0.7679, 0.0, 0.2178]
cat 2: [10, 41, 0, 230] and [0.0356, 0.1459, 0.0, 0.8185]
cat 3: [3, 10, 0, 867] and [0.0034, 0.0114, 0.0, 0.9852]
[train epoch 67/100] | loss 0.85205 | nw acc 0.895 | time 7 min 32 sec
cat 0: [1292, 42, 31, 57] and [0.9086, 0.0295, 0.0218, 0.0401]
cat 1: [35, 2672, 158, 99] and [0.0118, 0.9015, 0.0533, 0.0334]
cat 2: [20, 55, 931, 72] and [0.0186, 0.051, 0.8636, 0.0668]
cat 3: [39, 87, 86, 2150] and [0.0165, 0.0368, 0.0364, 0.9102]
[test epoch 67/100] | loss 26.7 | nw acc 0.698 | time 0 min 54 sec
cat 0: [63, 1, 0, 45] and [0.578, 0.0092, 0.0, 0.4128]
cat 1: [5, 281, 0, 109] and [0.0127, 0.7114, 0.0, 0.2759]
cat 2: [14, 32, 0, 244] and [0.0483, 0.1103, 0.0, 0.8414]
cat 3: [1, 7, 0, 818] and [0.0012, 0.0085, 0.0, 0.9903]
[train epoch 68/100] | loss 0.85505 | nw acc 0.89 | time 6 min 7 sec
cat 0: [1290, 42, 35, 65] and [0.9008, 0.0293, 0.0244, 0.0454]
cat 1: [38, 2662, 163, 96] and [0.0128, 0.8996, 0.0551, 0.0324]
cat 2: [23, 71, 922, 83] and [0.0209, 0.0646, 0.8389, 0.0755]
cat 3: [35, 81, 86, 2134] and [0.015, 0.0347, 0.0368, 0.9135]
