AlexNet(
  (conv1): Sequential(
    (0): Conv2d(3, 64, kernel_size=(11, 11), stride=(4, 4), padding=(2, 2))
    (1): ReLU(inplace)
    (2): MaxPool2d(kernel_size=3, stride=2, padding=0, dilation=1, ceil_mode=False)
  )
  (conv2): Sequential(
    (0): Conv2d(64, 192, kernel_size=(5, 5), stride=(1, 1), padding=(2, 2))
    (1): ReLU(inplace)
    (2): MaxPool2d(kernel_size=3, stride=2, padding=0, dilation=1, ceil_mode=False)
  )
  (conv3): Sequential(
    (0): Conv2d(192, 384, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    (1): ReLU(inplace)
  )
  (conv4): Sequential(
    (0): Conv2d(384, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    (1): ReLU(inplace)
  )
  (conv5): Sequential(
    (0): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    (1): ReLU(inplace)
    (2): MaxPool2d(kernel_size=3, stride=2, padding=0, dilation=1, ceil_mode=False)
  )
  (fc1): Sequential(
    (0): Dropout(p=0.5)
    (1): Linear(in_features=9216, out_features=4096, bias=True)
    (2): ReLU(inplace)
  )
  (fc2): Sequential(
    (0): Dropout(p=0.5)
    (1): Linear(in_features=4096, out_features=4096, bias=True)
    (2): ReLU(inplace)
  )
  (fc3): Sequential(
    (0): Linear(in_features=4096, out_features=4, bias=True)
    (1): Softmax()
  )
)
Child conv1 layer 0 param is frozen
Child conv1 layer 0 param is frozen
Child conv2 layer 0 param is not frozen
Child conv2 layer 0 param is not frozen
Child conv3 layer 0 param is not frozen
Child conv3 layer 0 param is not frozen
Child conv4 layer 0 param is not frozen
Child conv4 layer 0 param is not frozen
Child conv5 layer 0 param is not frozen
Child conv5 layer 0 param is not frozen
Child fc1 layer 1 param is not frozen
Child fc1 layer 1 param is not frozen
Child fc2 layer 1 param is not frozen
Child fc2 layer 1 param is not frozen
Child fc3 layer 0 param is not frozen
Child fc3 layer 0 param is not frozen
train patients [18 47  2 45 31 41 22  1 44 24  6 50 14 54 23 53 48 10  4 17 11 51 30 42
 19 40 25 12  7 35 36  0  5 13  8]
train labels [1469 2262 1016 2278]
test patients [ 3 32 49 15 29 34 43 46 55]
test labels [   0  915  190 1316]

[train epoch 1/100] | loss 1.1941 | nw acc 0.539 | time 4 min 2 sec
cat 0: [709, 154, 104, 296] and [0.5614, 0.1219, 0.0823, 0.2344]
cat 1: [331, 1637, 408, 528] and [0.114, 0.5637, 0.1405, 0.1818]
cat 2: [0, 3, 0, 5] and [0.0, 0.375, 0.0, 0.625]
cat 3: [429, 468, 504, 1449] and [0.1505, 0.1642, 0.1768, 0.5084]
[test epoch 1/100] | loss 49.5 | nw acc 0.411 | time 1 min 26 sec
cat 0: [0, 227, 1, 390] and [0.0, 0.3673, 0.0016, 0.6311]
cat 1: [0, 678, 189, 604] and [0.0, 0.4609, 0.1285, 0.4106]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 10, 0, 322] and [0.0, 0.0301, 0.0, 0.9699]
[train epoch 2/100] | loss 1.063 | nw acc 0.677 | time 4 min 0 sec
cat 0: [1123, 127, 160, 248] and [0.6773, 0.0766, 0.0965, 0.1496]
cat 1: [107, 1880, 354, 265] and [0.0411, 0.7214, 0.1358, 0.1017]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [239, 255, 502, 1765] and [0.0866, 0.0924, 0.1818, 0.6393]
[test epoch 2/100] | loss 40.5 | nw acc 0.667 | time 1 min 32 sec
cat 0: [0, 218, 1, 87] and [0.0, 0.7124, 0.0033, 0.2843]
cat 1: [0, 418, 109, 24] and [0.0, 0.7586, 0.1978, 0.0436]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 279, 80, 1205] and [0.0, 0.1784, 0.0512, 0.7705]
[train epoch 3/100] | loss 1.0043 | nw acc 0.741 | time 3 min 53 sec
cat 0: [1247, 67, 184, 172] and [0.7467, 0.0401, 0.1102, 0.103]
cat 1: [47, 2000, 324, 133] and [0.0188, 0.7987, 0.1294, 0.0531]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [175, 195, 508, 1973] and [0.0614, 0.0684, 0.1782, 0.692]
[test epoch 3/100] | loss 49 | nw acc 0.425 | time 1 min 8 sec
cat 0: [0, 291, 0, 486] and [0.0, 0.3745, 0.0, 0.6255]
cat 1: [0, 605, 188, 401] and [0.0, 0.5067, 0.1575, 0.3358]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 19, 2, 429] and [0.0, 0.0422, 0.0044, 0.9533]
[train epoch 4/100] | loss 0.97987 | nw acc 0.765 | time 4 min 6 sec
cat 0: [1298, 50, 181, 135] and [0.78, 0.03, 0.1088, 0.0811]
cat 1: [48, 2076, 308, 128] and [0.0187, 0.8109, 0.1203, 0.05]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [123, 136, 527, 2015] and [0.0439, 0.0486, 0.1881, 0.7194]
[test epoch 4/100] | loss 41.8 | nw acc 0.623 | time 1 min 25 sec
cat 0: [0, 230, 1, 85] and [0.0, 0.7278, 0.0032, 0.269]
cat 1: [0, 297, 117, 14] and [0.0, 0.6939, 0.2734, 0.0327]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 388, 72, 1217] and [0.0, 0.2314, 0.0429, 0.7257]
[train epoch 5/100] | loss 0.96133 | nw acc 0.783 | time 3 min 46 sec
cat 0: [1330, 30, 166, 102] and [0.817, 0.0184, 0.102, 0.0627]
cat 1: [39, 2113, 320, 106] and [0.0151, 0.8196, 0.1241, 0.0411]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [100, 119, 530, 2070] and [0.0355, 0.0422, 0.188, 0.7343]
[test epoch 5/100] | loss 40.7 | nw acc 0.655 | time 1 min 5 sec
cat 0: [0, 288, 0, 97] and [0.0, 0.7481, 0.0, 0.2519]
cat 1: [0, 405, 116, 30] and [0.0, 0.735, 0.2105, 0.0544]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 222, 74, 1189] and [0.0, 0.1495, 0.0498, 0.8007]
[train epoch 6/100] | loss 0.94888 | nw acc 0.794 | time 3 min 46 sec
cat 0: [1359, 24, 178, 92] and [0.8221, 0.0145, 0.1077, 0.0557]
cat 1: [32, 2143, 310, 98] and [0.0124, 0.8297, 0.12, 0.0379]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [78, 95, 528, 2088] and [0.028, 0.0341, 0.1893, 0.7487]
[test epoch 6/100] | loss 38.9 | nw acc 0.709 | time 1 min 10 sec
cat 0: [0, 55, 0, 32] and [0.0, 0.6322, 0.0, 0.3678]
cat 1: [0, 479, 112, 38] and [0.0, 0.7615, 0.1781, 0.0604]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 381, 78, 1246] and [0.0, 0.2235, 0.0457, 0.7308]
[train epoch 7/100] | loss 0.94179 | nw acc 0.802 | time 3 min 57 sec
cat 0: [1380, 27, 187, 78] and [0.8254, 0.0161, 0.1118, 0.0467]
cat 1: [27, 2142, 320, 77] and [0.0105, 0.8348, 0.1247, 0.03]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [62, 93, 509, 2123] and [0.0222, 0.0334, 0.1826, 0.7618]
[test epoch 7/100] | loss 38.6 | nw acc 0.717 | time 1 min 24 sec
cat 0: [0, 76, 0, 38] and [0.0, 0.6667, 0.0, 0.3333]
cat 1: [0, 496, 114, 31] and [0.0, 0.7738, 0.1778, 0.0484]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 343, 76, 1247] and [0.0, 0.2059, 0.0456, 0.7485]
[train epoch 8/100] | loss 0.93251 | nw acc 0.812 | time 3 min 41 sec
cat 0: [1394, 16, 149, 52] and [0.8653, 0.0099, 0.0925, 0.0323]
cat 1: [23, 2165, 311, 67] and [0.009, 0.8437, 0.1212, 0.0261]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [52, 81, 556, 2159] and [0.0183, 0.0284, 0.1952, 0.7581]
[test epoch 8/100] | loss 38.9 | nw acc 0.712 | time 1 min 20 sec
cat 0: [0, 121, 0, 62] and [0.0, 0.6612, 0.0, 0.3388]
cat 1: [0, 521, 135, 43] and [0.0, 0.7454, 0.1931, 0.0615]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 273, 55, 1211] and [0.0, 0.1774, 0.0357, 0.7869]
[train epoch 9/100] | loss 0.93032 | nw acc 0.812 | time 3 min 55 sec
cat 0: [1380, 19, 173, 57] and [0.8471, 0.0117, 0.1062, 0.035]
cat 1: [22, 2171, 323, 55] and [0.0086, 0.8444, 0.1256, 0.0214]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [67, 72, 520, 2166] and [0.0237, 0.0255, 0.1841, 0.7667]
[test epoch 9/100] | loss 37.3 | nw acc 0.754 | time 1 min 14 sec
cat 0: [0, 57, 0, 38] and [0.0, 0.6, 0.0, 0.4]
cat 1: [0, 600, 124, 45] and [0.0, 0.7802, 0.1612, 0.0585]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [0, 258, 66, 1233] and [0.0, 0.1657, 0.0424, 0.7919]
[train epoch 10/100] | loss 0.91914 | nw acc 0.824 | time 3 min 48 sec
cat 0: [1381, 15, 162, 58] and [0.8546, 0.0093, 0.1002, 0.0359]
cat 1: [23, 2145, 266, 69] and [0.0092, 0.857, 0.1063, 0.0276]
cat 2: [21, 45, 176, 54] and [0.0709, 0.152, 0.5946, 0.1824]
cat 3: [44, 57, 412, 2097] and [0.0169, 0.0218, 0.1579, 0.8034]
[test epoch 10/100] | loss 36.6 | nw acc 0.777 | time 1 min 15 sec
cat 0: [0, 13, 0, 23] and [0.0, 0.3611, 0.0, 0.6389]
cat 1: [0, 744, 156, 137] and [0.0, 0.7175, 0.1504, 0.1321]
cat 2: [0, 2, 5, 15] and [0.0, 0.0909, 0.2273, 0.6818]
cat 3: [0, 156, 29, 1141] and [0.0, 0.1176, 0.0219, 0.8605]
[train epoch 11/100] | loss 0.88458 | nw acc 0.865 | time 3 min 51 sec
cat 0: [1370, 12, 80, 54] and [0.9037, 0.0079, 0.0528, 0.0356]
cat 1: [18, 2111, 168, 69] and [0.0076, 0.8922, 0.071, 0.0292]
cat 2: [27, 71, 550, 98] and [0.0362, 0.0952, 0.7373, 0.1314]
cat 3: [54, 68, 218, 2057] and [0.0225, 0.0284, 0.0909, 0.8582]
[test epoch 11/100] | loss 36.5 | nw acc 0.782 | time 1 min 12 sec
cat 0: [0, 38, 0, 26] and [0.0, 0.5938, 0.0, 0.4062]
cat 1: [0, 665, 113, 57] and [0.0, 0.7964, 0.1353, 0.0683]
cat 2: [0, 34, 69, 66] and [0.0, 0.2012, 0.4083, 0.3905]
cat 3: [0, 178, 8, 1167] and [0.0, 0.1316, 0.0059, 0.8625]
[train epoch 12/100] | loss 0.86484 | nw acc 0.883 | time 3 min 56 sec
cat 0: [1362, 20, 63, 50] and [0.911, 0.0134, 0.0421, 0.0334]
cat 1: [20, 2118, 141, 52] and [0.0086, 0.9086, 0.0605, 0.0223]
cat 2: [34, 55, 659, 101] and [0.04, 0.0648, 0.7762, 0.119]
cat 3: [53, 69, 153, 2075] and [0.0226, 0.0294, 0.0651, 0.883]
[test epoch 12/100] | loss 40.2 | nw acc 0.671 | time 1 min 20 sec
cat 0: [0, 78, 0, 38] and [0.0, 0.6724, 0.0, 0.3276]
cat 1: [0, 321, 99, 7] and [0.0, 0.7518, 0.2319, 0.0164]
cat 2: [0, 3, 46, 6] and [0.0, 0.0545, 0.8364, 0.1091]
cat 3: [0, 513, 45, 1265] and [0.0, 0.2814, 0.0247, 0.6939]
[train epoch 13/100] | loss 0.85432 | nw acc 0.894 | time 3 min 45 sec
cat 0: [1371, 14, 64, 42] and [0.9195, 0.0094, 0.0429, 0.0282]
cat 1: [21, 2136, 127, 53] and [0.009, 0.914, 0.0543, 0.0227]
cat 2: [37, 52, 677, 73] and [0.0441, 0.062, 0.8069, 0.087]
cat 3: [40, 60, 148, 2110] and [0.017, 0.0254, 0.0628, 0.8948]
[test epoch 13/100] | loss 38.6 | nw acc 0.717 | time 1 min 16 sec
cat 0: [0, 42, 0, 20] and [0.0, 0.6774, 0.0, 0.3226]
cat 1: [0, 466, 104, 19] and [0.0, 0.7912, 0.1766, 0.0323]
cat 2: [0, 50, 65, 64] and [0.0, 0.2793, 0.3631, 0.3575]
cat 3: [0, 357, 21, 1213] and [0.0, 0.2244, 0.0132, 0.7624]
[train epoch 14/100] | loss 0.83714 | nw acc 0.911 | time 3 min 53 sec
cat 0: [1383, 17, 51, 38] and [0.9288, 0.0114, 0.0343, 0.0255]
cat 1: [16, 2168, 119, 46] and [0.0068, 0.9229, 0.0507, 0.0196]
cat 2: [27, 37, 734, 66] and [0.0312, 0.0428, 0.8495, 0.0764]
cat 3: [43, 40, 112, 2128] and [0.0185, 0.0172, 0.0482, 0.9161]
[test epoch 14/100] | loss 38.3 | nw acc 0.729 | time 1 min 19 sec
cat 0: [0, 131, 0, 63] and [0.0, 0.6753, 0.0, 0.3247]
cat 1: [0, 597, 112, 67] and [0.0, 0.7693, 0.1443, 0.0863]
cat 2: [0, 27, 76, 85] and [0.0, 0.1436, 0.4043, 0.4521]
cat 3: [0, 160, 2, 1101] and [0.0, 0.1267, 0.0016, 0.8717]
[train epoch 15/100] | loss 0.82481 | nw acc 0.922 | time 3 min 57 sec
cat 0: [1402, 11, 33, 34] and [0.9473, 0.0074, 0.0223, 0.023]
cat 1: [16, 2179, 118, 38] and [0.0068, 0.9268, 0.0502, 0.0162]
cat 2: [23, 24, 757, 55] and [0.0268, 0.0279, 0.8813, 0.064]
cat 3: [28, 48, 108, 2151] and [0.012, 0.0206, 0.0463, 0.9212]
[test epoch 15/100] | loss 41.2 | nw acc 0.648 | time 1 min 20 sec
cat 0: [0, 350, 1, 86] and [0.0, 0.8009, 0.0023, 0.1968]
cat 1: [0, 320, 100, 7] and [0.0, 0.7494, 0.2342, 0.0164]
cat 2: [0, 10, 64, 32] and [0.0, 0.0943, 0.6038, 0.3019]
cat 3: [0, 235, 25, 1191] and [0.0, 0.162, 0.0172, 0.8208]
[train epoch 16/100] | loss 0.8274 | nw acc 0.919 | time 3 min 45 sec
cat 0: [1389, 21, 43, 31] and [0.936, 0.0142, 0.029, 0.0209]
cat 1: [19, 2160, 103, 43] and [0.0082, 0.929, 0.0443, 0.0185]
cat 2: [22, 32, 768, 51] and [0.0252, 0.0367, 0.8797, 0.0584]
cat 3: [39, 49, 102, 2153] and [0.0166, 0.0209, 0.0435, 0.9189]
[test epoch 16/100] | loss 38.9 | nw acc 0.708 | time 1 min 11 sec
cat 0: [0, 13, 0, 15] and [0.0, 0.4643, 0.0, 0.5357]
cat 1: [0, 410, 101, 13] and [0.0, 0.7824, 0.1927, 0.0248]
cat 2: [0, 42, 73, 48] and [0.0, 0.2577, 0.4479, 0.2945]
cat 3: [0, 450, 16, 1240] and [0.0, 0.2638, 0.0094, 0.7268]
[train epoch 17/100] | loss 0.82079 | nw acc 0.925 | time 3 min 55 sec
cat 0: [1404, 15, 33, 29] and [0.948, 0.0101, 0.0223, 0.0196]
cat 1: [20, 2168, 111, 50] and [0.0085, 0.9229, 0.0473, 0.0213]
cat 2: [20, 33, 780, 41] and [0.0229, 0.0378, 0.8924, 0.0469]
cat 3: [25, 46, 92, 2158] and [0.0108, 0.0198, 0.0396, 0.9298]
[test epoch 17/100] | loss 42.3 | nw acc 0.615 | time 1 min 5 sec
cat 0: [0, 164, 5, 40] and [0.0, 0.7847, 0.0239, 0.1914]
cat 1: [0, 159, 74, 1] and [0.0, 0.6795, 0.3162, 0.0043]
cat 2: [0, 35, 85, 24] and [0.0, 0.2431, 0.5903, 0.1667]
cat 3: [0, 557, 26, 1251] and [0.0, 0.3037, 0.0142, 0.6821]
[train epoch 18/100] | loss 0.81497 | nw acc 0.932 | time 3 min 46 sec
cat 0: [1415, 10, 28, 28] and [0.9554, 0.0068, 0.0189, 0.0189]
cat 1: [11, 2182, 95, 36] and [0.0047, 0.9389, 0.0409, 0.0155]
cat 2: [13, 25, 800, 47] and [0.0147, 0.0282, 0.904, 0.0531]
cat 3: [30, 45, 93, 2167] and [0.0128, 0.0193, 0.0398, 0.9281]
[test epoch 18/100] | loss 37.9 | nw acc 0.733 | time 1 min 24 sec
cat 0: [0, 143, 0, 62] and [0.0, 0.6976, 0.0, 0.3024]
cat 1: [0, 550, 112, 36] and [0.0, 0.788, 0.1605, 0.0516]
cat 2: [0, 25, 76, 61] and [0.0, 0.1543, 0.4691, 0.3765]
cat 3: [0, 197, 2, 1157] and [0.0, 0.1453, 0.0015, 0.8532]
[train epoch 19/100] | loss 0.81007 | nw acc 0.935 | time 3 min 46 sec
cat 0: [1418, 12, 33, 22] and [0.9549, 0.0081, 0.0222, 0.0148]
cat 1: [12, 2186, 94, 35] and [0.0052, 0.9394, 0.0404, 0.015]
cat 2: [9, 24, 801, 42] and [0.0103, 0.0274, 0.9144, 0.0479]
cat 3: [30, 40, 88, 2179] and [0.0128, 0.0171, 0.0377, 0.9324]
[test epoch 19/100] | loss 40.3 | nw acc 0.673 | time 1 min 7 sec
cat 0: [0, 238, 1, 60] and [0.0, 0.796, 0.0033, 0.2007]
cat 1: [0, 352, 93, 6] and [0.0, 0.7805, 0.2062, 0.0133]
cat 2: [0, 26, 75, 41] and [0.0, 0.1831, 0.5282, 0.2887]
cat 3: [0, 299, 21, 1209] and [0.0, 0.1956, 0.0137, 0.7907]
[train epoch 20/100] | loss 0.81417 | nw acc 0.931 | time 3 min 52 sec
cat 0: [1402, 12, 41, 31] and [0.9435, 0.0081, 0.0276, 0.0209]
cat 1: [19, 2185, 88, 43] and [0.0081, 0.9358, 0.0377, 0.0184]
cat 2: [21, 22, 798, 33] and [0.024, 0.0252, 0.913, 0.0378]
cat 3: [27, 43, 89, 2171] and [0.0116, 0.0185, 0.0382, 0.9318]
[test epoch 20/100] | loss 38.4 | nw acc 0.72 | time 1 min 23 sec
cat 0: [0, 104, 0, 33] and [0.0, 0.7591, 0.0, 0.2409]
cat 1: [0, 462, 106, 27] and [0.0, 0.7765, 0.1782, 0.0454]
cat 2: [0, 34, 75, 43] and [0.0, 0.2237, 0.4934, 0.2829]
cat 3: [0, 315, 9, 1213] and [0.0, 0.2049, 0.0059, 0.7892]
[train epoch 21/100] | loss 0.80518 | nw acc 0.939 | time 3 min 53 sec
cat 0: [1410, 10, 28, 17] and [0.9625, 0.0068, 0.0191, 0.0116]
cat 1: [14, 2187, 83, 28] and [0.0061, 0.9459, 0.0359, 0.0121]
cat 2: [12, 31, 814, 34] and [0.0135, 0.0348, 0.9136, 0.0382]
cat 3: [33, 34, 91, 2199] and [0.014, 0.0144, 0.0386, 0.933]
[test epoch 21/100] | loss 37.5 | nw acc 0.744 | time 1 min 12 sec
cat 0: [0, 107, 0, 40] and [0.0, 0.7279, 0.0, 0.2721]
cat 1: [0, 549, 103, 37] and [0.0, 0.7968, 0.1495, 0.0537]
cat 2: [0, 43, 76, 54] and [0.0, 0.2486, 0.4393, 0.3121]
cat 3: [0, 216, 11, 1185] and [0.0, 0.153, 0.0078, 0.8392]
[train epoch 22/100] | loss 0.79819 | nw acc 0.948 | time 3 min 43 sec
cat 0: [1432, 5, 19, 16] and [0.9728, 0.0034, 0.0129, 0.0109]
cat 1: [11, 2206, 90, 30] and [0.0047, 0.9439, 0.0385, 0.0128]
cat 2: [5, 19, 833, 29] and [0.0056, 0.0214, 0.9402, 0.0327]
cat 3: [21, 32, 74, 2203] and [0.009, 0.0137, 0.0318, 0.9455]
[test epoch 22/100] | loss 36.7 | nw acc 0.769 | time 1 min 17 sec
cat 0: [0, 51, 0, 33] and [0.0, 0.6071, 0.0, 0.3929]
cat 1: [0, 570, 106, 34] and [0.0, 0.8028, 0.1493, 0.0479]
cat 2: [0, 10, 67, 15] and [0.0, 0.1087, 0.7283, 0.163]
cat 3: [0, 284, 17, 1234] and [0.0, 0.185, 0.0111, 0.8039]
[train epoch 23/100] | loss 0.79959 | nw acc 0.947 | time 3 min 52 sec
cat 0: [1424, 9, 30, 20] and [0.9602, 0.0061, 0.0202, 0.0135]
cat 1: [10, 2209, 79, 30] and [0.0043, 0.9489, 0.0339, 0.0129]
cat 2: [14, 16, 830, 26] and [0.0158, 0.0181, 0.9368, 0.0293]
cat 3: [21, 28, 77, 2202] and [0.009, 0.012, 0.0331, 0.9459]
[test epoch 23/100] | loss 38.5 | nw acc 0.715 | time 1 min 16 sec
cat 0: [0, 86, 0, 26] and [0.0, 0.7679, 0.0, 0.2321]
cat 1: [0, 500, 94, 37] and [0.0, 0.7924, 0.149, 0.0586]
cat 2: [0, 65, 89, 104] and [0.0, 0.2519, 0.345, 0.4031]
cat 3: [0, 264, 7, 1149] and [0.0, 0.1859, 0.0049, 0.8092]
[train epoch 24/100] | loss 0.79439 | nw acc 0.951 | time 3 min 45 sec
cat 0: [1429, 9, 25, 13] and [0.9682, 0.0061, 0.0169, 0.0088]
cat 1: [10, 2213, 74, 23] and [0.0043, 0.9539, 0.0319, 0.0099]
cat 2: [9, 12, 840, 31] and [0.0101, 0.0135, 0.9417, 0.0348]
cat 3: [21, 28, 77, 2211] and [0.009, 0.012, 0.0329, 0.9461]
[test epoch 24/100] | loss 37.1 | nw acc 0.755 | time 1 min 5 sec
cat 0: [0, 66, 0, 32] and [0.0, 0.6735, 0.0, 0.3265]
cat 1: [0, 544, 104, 41] and [0.0, 0.7896, 0.1509, 0.0595]
cat 2: [0, 18, 65, 15] and [0.0, 0.1837, 0.6633, 0.1531]
cat 3: [0, 287, 21, 1228] and [0.0, 0.1868, 0.0137, 0.7995]
[train epoch 25/100] | loss 0.79347 | nw acc 0.953 | time 3 min 51 sec
cat 0: [1433, 8, 25, 14] and [0.9682, 0.0054, 0.0169, 0.0095]
cat 1: [10, 2212, 78, 18] and [0.0043, 0.9543, 0.0336, 0.0078]
cat 2: [6, 21, 842, 23] and [0.0067, 0.0235, 0.9439, 0.0258]
cat 3: [20, 21, 71, 2223] and [0.0086, 0.009, 0.0304, 0.952]
[test epoch 25/100] | loss 42.7 | nw acc 0.607 | time 1 min 13 sec
cat 0: [0, 259, 0, 241] and [0.0, 0.518, 0.0, 0.482]
cat 1: [0, 570, 105, 153] and [0.0, 0.6884, 0.1268, 0.1848]
cat 2: [0, 26, 85, 100] and [0.0, 0.1232, 0.4028, 0.4739]
cat 3: [0, 60, 0, 822] and [0.0, 0.068, 0.0, 0.932]
[train epoch 26/100] | loss 0.79578 | nw acc 0.949 | time 3 min 42 sec
cat 0: [1424, 10, 26, 18] and [0.9635, 0.0068, 0.0176, 0.0122]
cat 1: [12, 2203, 69, 22] and [0.0052, 0.9553, 0.0299, 0.0095]
cat 2: [9, 11, 844, 30] and [0.0101, 0.0123, 0.9441, 0.0336]
cat 3: [24, 38, 77, 2208] and [0.0102, 0.0162, 0.0328, 0.9408]
[test epoch 26/100] | loss 36.6 | nw acc 0.771 | time 1 min 19 sec
cat 0: [0, 26, 0, 18] and [0.0, 0.5909, 0.0, 0.4091]
cat 1: [0, 564, 103, 33] and [0.0, 0.8057, 0.1471, 0.0471]
cat 2: [0, 36, 75, 29] and [0.0, 0.2571, 0.5357, 0.2071]
cat 3: [0, 289, 12, 1236] and [0.0, 0.188, 0.0078, 0.8042]
[train epoch 27/100] | loss 0.78939 | nw acc 0.955 | time 3 min 48 sec
cat 0: [1428, 5, 31, 11] and [0.9681, 0.0034, 0.021, 0.0075]
cat 1: [13, 2215, 72, 21] and [0.0056, 0.9543, 0.031, 0.009]
cat 2: [5, 19, 848, 15] and [0.0056, 0.0214, 0.956, 0.0169]
cat 3: [23, 23, 65, 2231] and [0.0098, 0.0098, 0.0278, 0.9526]
[test epoch 27/100] | loss 38 | nw acc 0.73 | time 1 min 14 sec
cat 0: [0, 78, 0, 24] and [0.0, 0.7647, 0.0, 0.2353]
cat 1: [0, 583, 96, 69] and [0.0, 0.7794, 0.1283, 0.0922]
cat 2: [0, 75, 89, 119] and [0.0, 0.265, 0.3145, 0.4205]
cat 3: [0, 179, 5, 1104] and [0.0, 0.139, 0.0039, 0.8571]
[train epoch 28/100] | loss 0.78593 | nw acc 0.96 | time 3 min 42 sec
cat 0: [1439, 5, 19, 12] and [0.9756, 0.0034, 0.0129, 0.0081]
cat 1: [7, 2219, 61, 20] and [0.003, 0.9619, 0.0264, 0.0087]
cat 2: [6, 17, 866, 14] and [0.0066, 0.0188, 0.959, 0.0155]
cat 3: [17, 21, 70, 2232] and [0.0073, 0.009, 0.0299, 0.9538]
[test epoch 28/100] | loss 37.1 | nw acc 0.755 | time 1 min 18 sec
cat 0: [0, 102, 0, 44] and [0.0, 0.6986, 0.0, 0.3014]
cat 1: [0, 625, 109, 75] and [0.0, 0.7726, 0.1347, 0.0927]
cat 2: [0, 51, 81, 66] and [0.0, 0.2576, 0.4091, 0.3333]
cat 3: [0, 137, 0, 1131] and [0.0, 0.108, 0.0, 0.892]
[train epoch 29/100] | loss 0.7891 | nw acc 0.955 | time 3 min 49 sec
cat 0: [1433, 8, 29, 19] and [0.9624, 0.0054, 0.0195, 0.0128]
cat 1: [6, 2219, 64, 23] and [0.0026, 0.9598, 0.0277, 0.0099]
cat 2: [9, 17, 855, 17] and [0.01, 0.0189, 0.9521, 0.0189]
cat 3: [21, 18, 68, 2219] and [0.009, 0.0077, 0.0292, 0.954]
[test epoch 29/100] | loss 36.5 | nw acc 0.774 | time 1 min 14 sec
cat 0: [0, 48, 0, 27] and [0.0, 0.64, 0.0, 0.36]
cat 1: [0, 622, 98, 54] and [0.0, 0.8036, 0.1266, 0.0698]
cat 2: [0, 47, 85, 60] and [0.0, 0.2448, 0.4427, 0.3125]
cat 3: [0, 198, 7, 1175] and [0.0, 0.1435, 0.0051, 0.8514]
[train epoch 30/100] | loss 0.78762 | nw acc 0.956 | time 3 min 39 sec
cat 0: [1430, 6, 21, 12] and [0.9735, 0.0041, 0.0143, 0.0082]
cat 1: [9, 2221, 66, 16] and [0.0039, 0.9606, 0.0285, 0.0069]
cat 2: [8, 11, 854, 22] and [0.0089, 0.0123, 0.9542, 0.0246]
cat 3: [22, 24, 75, 2228] and [0.0094, 0.0102, 0.0319, 0.9485]
[test epoch 30/100] | loss 38.8 | nw acc 0.708 | time 1 min 17 sec
cat 0: [0, 61, 0, 27] and [0.0, 0.6932, 0.0, 0.3068]
cat 1: [0, 418, 98, 26] and [0.0, 0.7712, 0.1808, 0.048]
cat 2: [0, 26, 63, 23] and [0.0, 0.2321, 0.5625, 0.2054]
cat 3: [0, 410, 29, 1240] and [0.0, 0.2442, 0.0173, 0.7385]
[train epoch 31/100] | loss 0.78532 | nw acc 0.959 | time 3 min 45 sec
cat 0: [1433, 10, 23, 8] and [0.9722, 0.0068, 0.0156, 0.0054]
cat 1: [13, 2212, 64, 16] and [0.0056, 0.9597, 0.0278, 0.0069]
cat 2: [4, 16, 867, 13] and [0.0044, 0.0178, 0.9633, 0.0144]
cat 3: [19, 24, 62, 2241] and [0.0081, 0.0102, 0.0264, 0.9552]
[test epoch 31/100] | loss 37.1 | nw acc 0.755 | time 1 min 19 sec
cat 0: [0, 47, 0, 27] and [0.0, 0.6351, 0.0, 0.3649]
cat 1: [0, 552, 103, 40] and [0.0, 0.7942, 0.1482, 0.0576]
cat 2: [0, 38, 55, 20] and [0.0, 0.3363, 0.4867, 0.177]
cat 3: [0, 278, 32, 1229] and [0.0, 0.1806, 0.0208, 0.7986]
[train epoch 32/100] | loss 0.78375 | nw acc 0.961 | time 3 min 45 sec
cat 0: [1436, 11, 21, 9] and [0.9722, 0.0074, 0.0142, 0.0061]
cat 1: [7, 2224, 59, 19] and [0.003, 0.9632, 0.0256, 0.0082]
cat 2: [6, 11, 873, 19] and [0.0066, 0.0121, 0.9604, 0.0209]
cat 3: [20, 16, 63, 2231] and [0.0086, 0.0069, 0.027, 0.9575]
[test epoch 32/100] | loss 38.8 | nw acc 0.71 | time 1 min 13 sec
cat 0: [0, 104, 0, 32] and [0.0, 0.7647, 0.0, 0.2353]
cat 1: [0, 510, 88, 33] and [0.0, 0.8082, 0.1395, 0.0523]
cat 2: [0, 120, 95, 129] and [0.0, 0.3488, 0.2762, 0.375]
cat 3: [0, 181, 7, 1122] and [0.0, 0.1382, 0.0053, 0.8565]
[train epoch 33/100] | loss 0.78348 | nw acc 0.961 | time 3 min 49 sec
cat 0: [1429, 7, 30, 14] and [0.9655, 0.0047, 0.0203, 0.0095]
cat 1: [7, 2225, 46, 13] and [0.0031, 0.9712, 0.0201, 0.0057]
cat 2: [10, 12, 879, 16] and [0.0109, 0.0131, 0.9586, 0.0174]
cat 3: [23, 18, 61, 2235] and [0.0098, 0.0077, 0.0261, 0.9564]
[test epoch 33/100] | loss 36 | nw acc 0.789 | time 1 min 19 sec
cat 0: [0, 21, 0, 20] and [0.0, 0.5122, 0.0, 0.4878]
cat 1: [0, 648, 134, 58] and [0.0, 0.7714, 0.1595, 0.069]
cat 2: [0, 8, 45, 12] and [0.0, 0.1231, 0.6923, 0.1846]
cat 3: [0, 238, 11, 1226] and [0.0, 0.1614, 0.0075, 0.8312]
[train epoch 34/100] | loss 0.78526 | nw acc 0.96 | time 3 min 42 sec
cat 0: [1430, 9, 25, 13] and [0.9682, 0.0061, 0.0169, 0.0088]
cat 1: [8, 2216, 54, 17] and [0.0035, 0.9656, 0.0235, 0.0074]
cat 2: [8, 14, 872, 11] and [0.0088, 0.0155, 0.9635, 0.0122]
cat 3: [23, 23, 65, 2237] and [0.0098, 0.0098, 0.0277, 0.9527]
[test epoch 34/100] | loss 37.6 | nw acc 0.738 | time 1 min 19 sec
cat 0: [0, 59, 0, 16] and [0.0, 0.7867, 0.0, 0.2133]
cat 1: [0, 538, 88, 38] and [0.0, 0.8102, 0.1325, 0.0572]
cat 2: [0, 80, 90, 94] and [0.0, 0.303, 0.3409, 0.3561]
cat 3: [0, 238, 12, 1168] and [0.0, 0.1678, 0.0085, 0.8237]
[train epoch 35/100] | loss 0.77983 | nw acc 0.965 | time 3 min 48 sec
cat 0: [1438, 4, 27, 8] and [0.9736, 0.0027, 0.0183, 0.0054]
cat 1: [10, 2228, 51, 19] and [0.0043, 0.9653, 0.0221, 0.0082]
cat 2: [5, 9, 890, 13] and [0.0055, 0.0098, 0.9706, 0.0142]
cat 3: [16, 21, 48, 2238] and [0.0069, 0.009, 0.0207, 0.9634]
[test epoch 35/100] | loss 36.8 | nw acc 0.767 | time 1 min 20 sec
cat 0: [0, 23, 0, 13] and [0.0, 0.6389, 0.0, 0.3611]
cat 1: [0, 573, 111, 52] and [0.0, 0.7785, 0.1508, 0.0707]
cat 2: [0, 44, 70, 28] and [0.0, 0.3099, 0.493, 0.1972]
cat 3: [0, 275, 9, 1223] and [0.0, 0.1825, 0.006, 0.8115]
[train epoch 36/100] | loss 0.78139 | nw acc 0.963 | time 3 min 42 sec
cat 0: [1441, 2, 19, 7] and [0.9809, 0.0014, 0.0129, 0.0048]
cat 1: [8, 2221, 55, 22] and [0.0035, 0.9631, 0.0239, 0.0095]
cat 2: [4, 17, 883, 18] and [0.0043, 0.0184, 0.9577, 0.0195]
cat 3: [16, 22, 59, 2231] and [0.0069, 0.0095, 0.0253, 0.9583]
[test epoch 36/100] | loss 39.2 | nw acc 0.699 | time 1 min 19 sec
cat 0: [0, 151, 0, 50] and [0.0, 0.7512, 0.0, 0.2488]
cat 1: [0, 381, 67, 21] and [0.0, 0.8124, 0.1429, 0.0448]
cat 2: [0, 92, 112, 37] and [0.0, 0.3817, 0.4647, 0.1535]
cat 3: [0, 291, 11, 1208] and [0.0, 0.1927, 0.0073, 0.8]
[train epoch 37/100] | loss 0.77593 | nw acc 0.968 | time 3 min 54 sec
cat 0: [1440, 4, 14, 12] and [0.9796, 0.0027, 0.0095, 0.0082]
cat 1: [7, 2220, 41, 9] and [0.0031, 0.975, 0.018, 0.004]
cat 2: [8, 18, 917, 16] and [0.0083, 0.0188, 0.9562, 0.0167]
cat 3: [14, 20, 44, 2241] and [0.006, 0.0086, 0.019, 0.9664]
[test epoch 37/100] | loss 37.5 | nw acc 0.752 | time 1 min 16 sec
cat 0: [0, 76, 0, 32] and [0.0, 0.7037, 0.0, 0.2963]
cat 1: [0, 591, 120, 83] and [0.0, 0.7443, 0.1511, 0.1045]
cat 2: [0, 42, 56, 20] and [0.0, 0.3559, 0.4746, 0.1695]
cat 3: [0, 206, 14, 1181] and [0.0, 0.147, 0.01, 0.843]
[train epoch 38/100] | loss 0.77481 | nw acc 0.97 | time 3 min 41 sec
cat 0: [1442, 6, 19, 7] and [0.9783, 0.0041, 0.0129, 0.0047]
cat 1: [5, 2228, 39, 17] and [0.0022, 0.9734, 0.017, 0.0074]
cat 2: [8, 12, 917, 11] and [0.0084, 0.0127, 0.9673, 0.0116]
cat 3: [14, 16, 41, 2243] and [0.0061, 0.0069, 0.0177, 0.9693]
[test epoch 38/100] | loss 36.8 | nw acc 0.764 | time 1 min 14 sec
cat 0: [0, 54, 0, 23] and [0.0, 0.7013, 0.0, 0.2987]
cat 1: [0, 608, 104, 74] and [0.0, 0.7735, 0.1323, 0.0941]
cat 2: [0, 76, 70, 38] and [0.0, 0.413, 0.3804, 0.2065]
cat 3: [0, 177, 16, 1181] and [0.0, 0.1288, 0.0116, 0.8595]
[train epoch 39/100] | loss 0.7765 | nw acc 0.968 | time 3 min 50 sec
cat 0: [1438, 7, 18, 17] and [0.9716, 0.0047, 0.0122, 0.0115]
cat 1: [9, 2221, 29, 12] and [0.004, 0.978, 0.0128, 0.0053]
cat 2: [3, 17, 925, 20] and [0.0031, 0.0176, 0.9585, 0.0207]
cat 3: [19, 17, 44, 2229] and [0.0082, 0.0074, 0.0191, 0.9654]
[test epoch 39/100] | loss 36.8 | nw acc 0.77 | time 1 min 14 sec
cat 0: [0, 37, 0, 22] and [0.0, 0.6271, 0.0, 0.3729]
cat 1: [0, 582, 103, 59] and [0.0, 0.7823, 0.1384, 0.0793]
cat 2: [0, 62, 67, 12] and [0.0, 0.4397, 0.4752, 0.0851]
cat 3: [0, 234, 20, 1223] and [0.0, 0.1584, 0.0135, 0.828]
[train epoch 40/100] | loss 0.77562 | nw acc 0.969 | time 3 min 43 sec
cat 0: [1439, 7, 15, 11] and [0.9776, 0.0048, 0.0102, 0.0075]
cat 1: [8, 2224, 31, 16] and [0.0035, 0.9759, 0.0136, 0.007]
cat 2: [5, 12, 932, 23] and [0.0051, 0.0123, 0.9588, 0.0237]
cat 3: [17, 19, 38, 2228] and [0.0074, 0.0083, 0.0165, 0.9679]
[test epoch 40/100] | loss 37.5 | nw acc 0.748 | time 1 min 11 sec
cat 0: [0, 29, 0, 17] and [0.0, 0.6304, 0.0, 0.3696]
cat 1: [0, 521, 122, 34] and [0.0, 0.7696, 0.1802, 0.0502]
cat 2: [0, 55, 58, 26] and [0.0, 0.3957, 0.4173, 0.1871]
cat 3: [0, 310, 10, 1239] and [0.0, 0.1988, 0.0064, 0.7947]
[train epoch 41/100] | loss 0.77253 | nw acc 0.972 | time 3 min 43 sec
cat 0: [1441, 5, 11, 7] and [0.9843, 0.0034, 0.0075, 0.0048]
cat 1: [8, 2226, 21, 18] and [0.0035, 0.9793, 0.0092, 0.0079]
cat 2: [6, 15, 945, 19] and [0.0061, 0.0152, 0.9594, 0.0193]
cat 3: [14, 16, 39, 2234] and [0.0061, 0.0069, 0.0169, 0.97]
[test epoch 41/100] | loss 36.3 | nw acc 0.784 | time 1 min 24 sec
cat 0: [0, 59, 0, 35] and [0.0, 0.6277, 0.0, 0.3723]
cat 1: [0, 655, 106, 88] and [0.0, 0.7715, 0.1249, 0.1037]
cat 2: [0, 57, 74, 16] and [0.0, 0.3878, 0.5034, 0.1088]
cat 3: [0, 144, 10, 1177] and [0.0, 0.1082, 0.0075, 0.8843]
[train epoch 42/100] | loss 0.77077 | nw acc 0.973 | time 3 min 45 sec
cat 0: [1444, 4, 11, 7] and [0.985, 0.0027, 0.0075, 0.0048]
cat 1: [6, 2232, 32, 14] and [0.0026, 0.9772, 0.014, 0.0061]
cat 2: [6, 12, 931, 11] and [0.0063, 0.0125, 0.9698, 0.0115]
cat 3: [13, 14, 42, 2246] and [0.0056, 0.006, 0.0181, 0.9702]
[test epoch 42/100] | loss 37 | nw acc 0.764 | time 1 min 13 sec
cat 0: [0, 73, 0, 43] and [0.0, 0.6293, 0.0, 0.3707]
cat 1: [0, 649, 103, 97] and [0.0, 0.7644, 0.1213, 0.1143]
cat 2: [0, 92, 81, 47] and [0.0, 0.4182, 0.3682, 0.2136]
cat 3: [0, 101, 6, 1129] and [0.0, 0.0817, 0.0049, 0.9134]
[train epoch 43/100] | loss 0.76972 | nw acc 0.975 | time 3 min 48 sec
cat 0: [1441, 2, 15, 10] and [0.9816, 0.0014, 0.0102, 0.0068]
cat 1: [7, 2239, 26, 13] and [0.0031, 0.9799, 0.0114, 0.0057]
cat 2: [4, 7, 941, 11] and [0.0042, 0.0073, 0.9772, 0.0114]
cat 3: [17, 14, 34, 2244] and [0.0074, 0.0061, 0.0147, 0.9718]
[test epoch 43/100] | loss 39.7 | nw acc 0.69 | time 1 min 23 sec
cat 0: [0, 199, 0, 64] and [0.0, 0.7567, 0.0, 0.2433]
cat 1: [0, 365, 62, 21] and [0.0, 0.8147, 0.1384, 0.0469]
cat 2: [0, 156, 113, 30] and [0.0, 0.5217, 0.3779, 0.1003]
cat 3: [0, 195, 15, 1201] and [0.0, 0.1382, 0.0106, 0.8512]
[train epoch 44/100] | loss 0.769 | nw acc 0.976 | time 3 min 42 sec
cat 0: [1442, 5, 10, 4] and [0.987, 0.0034, 0.0068, 0.0027]
cat 1: [4, 2230, 21, 10] and [0.0018, 0.9845, 0.0093, 0.0044]
cat 2: [4, 14, 955, 18] and [0.004, 0.0141, 0.9637, 0.0182]
cat 3: [19, 13, 30, 2246] and [0.0082, 0.0056, 0.013, 0.9731]
[test epoch 44/100] | loss 42.5 | nw acc 0.611 | time 1 min 23 sec
cat 0: [0, 278, 0, 164] and [0.0, 0.629, 0.0, 0.371]
cat 1: [0, 400, 79, 49] and [0.0, 0.7576, 0.1496, 0.0928]
cat 2: [0, 177, 108, 125] and [0.0, 0.4317, 0.2634, 0.3049]
cat 3: [0, 60, 3, 978] and [0.0, 0.0576, 0.0029, 0.9395]
[train epoch 45/100] | loss 0.76575 | nw acc 0.978 | time 3 min 57 sec
cat 0: [1439, 3, 10, 11] and [0.9836, 0.0021, 0.0068, 0.0075]
cat 1: [3, 2233, 19, 12] and [0.0013, 0.985, 0.0084, 0.0053]
cat 2: [11, 10, 965, 7] and [0.0111, 0.0101, 0.9718, 0.007]
cat 3: [16, 16, 22, 2248] and [0.007, 0.007, 0.0096, 0.9765]
[test epoch 45/100] | loss 36.7 | nw acc 0.769 | time 1 min 13 sec
cat 0: [0, 78, 0, 37] and [0.0, 0.6783, 0.0, 0.3217]
cat 1: [0, 601, 104, 56] and [0.0, 0.7898, 0.1367, 0.0736]
cat 2: [0, 69, 80, 35] and [0.0, 0.375, 0.4348, 0.1902]
cat 3: [0, 167, 6, 1188] and [0.0, 0.1227, 0.0044, 0.8729]
[train epoch 46/100] | loss 0.76628 | nw acc 0.979 | time 3 min 38 sec
cat 0: [1447, 3, 8, 7] and [0.9877, 0.002, 0.0055, 0.0048]
cat 1: [5, 2240, 20, 7] and [0.0022, 0.9859, 0.0088, 0.0031]
cat 2: [3, 6, 952, 12] and [0.0031, 0.0062, 0.9784, 0.0123]
cat 3: [14, 13, 36, 2252] and [0.006, 0.0056, 0.0156, 0.9728]
[test epoch 46/100] | loss 37.9 | nw acc 0.736 | time 1 min 22 sec
cat 0: [0, 113, 0, 42] and [0.0, 0.729, 0.0, 0.271]
cat 1: [0, 488, 76, 38] and [0.0, 0.8106, 0.1262, 0.0631]
cat 2: [0, 152, 103, 37] and [0.0, 0.5205, 0.3527, 0.1267]
cat 3: [0, 162, 11, 1199] and [0.0, 0.1181, 0.008, 0.8739]
[train epoch 47/100] | loss 0.76799 | nw acc 0.976 | time 3 min 48 sec
cat 0: [1446, 5, 10, 10] and [0.983, 0.0034, 0.0068, 0.0068]
cat 1: [5, 2232, 23, 11] and [0.0022, 0.9828, 0.0101, 0.0048]
cat 2: [4, 6, 953, 18] and [0.0041, 0.0061, 0.9715, 0.0183]
cat 3: [14, 19, 30, 2239] and [0.0061, 0.0083, 0.013, 0.9726]
[test epoch 47/100] | loss 39.4 | nw acc 0.696 | time 1 min 14 sec
cat 0: [0, 145, 1, 38] and [0.0, 0.788, 0.0054, 0.2065]
cat 1: [0, 402, 92, 24] and [0.0, 0.7761, 0.1776, 0.0463]
cat 2: [0, 104, 74, 38] and [0.0, 0.4815, 0.3426, 0.1759]
cat 3: [0, 264, 23, 1216] and [0.0, 0.1756, 0.0153, 0.809]
[train epoch 48/100] | loss 0.76437 | nw acc 0.98 | time 3 min 39 sec
cat 0: [1443, 7, 7, 8] and [0.985, 0.0048, 0.0048, 0.0055]
cat 1: [4, 2233, 14, 8] and [0.0018, 0.9885, 0.0062, 0.0035]
cat 2: [8, 10, 970, 9] and [0.008, 0.01, 0.9729, 0.009]
cat 3: [14, 12, 25, 2253] and [0.0061, 0.0052, 0.0109, 0.9779]
[test epoch 48/100] | loss 37.1 | nw acc 0.753 | time 1 min 21 sec
cat 0: [0, 85, 0, 39] and [0.0, 0.6855, 0.0, 0.3145]
cat 1: [0, 573, 102, 71] and [0.0, 0.7681, 0.1367, 0.0952]
cat 2: [0, 92, 81, 29] and [0.0, 0.4554, 0.401, 0.1436]
cat 3: [0, 165, 7, 1177] and [0.0, 0.1223, 0.0052, 0.8725]
[train epoch 49/100] | loss 0.76301 | nw acc 0.981 | time 3 min 45 sec
cat 0: [1449, 4, 9, 6] and [0.9871, 0.0027, 0.0061, 0.0041]
cat 1: [4, 2242, 19, 8] and [0.0018, 0.9864, 0.0084, 0.0035]
cat 2: [6, 5, 967, 13] and [0.0061, 0.005, 0.9758, 0.0131]
cat 3: [10, 11, 21, 2251] and [0.0044, 0.0048, 0.0092, 0.9817]
[test epoch 49/100] | loss 38.9 | nw acc 0.71 | time 1 min 22 sec
cat 0: [0, 153, 0, 50] and [0.0, 0.7537, 0.0, 0.2463]
cat 1: [0, 434, 96, 30] and [0.0, 0.775, 0.1714, 0.0536]
cat 2: [0, 123, 85, 28] and [0.0, 0.5212, 0.3602, 0.1186]
cat 3: [0, 205, 9, 1208] and [0.0, 0.1442, 0.0063, 0.8495]
[train epoch 50/100] | loss 0.76435 | nw acc 0.98 | time 3 min 41 sec
cat 0: [1445, 5, 14, 10] and [0.9803, 0.0034, 0.0095, 0.0068]
cat 1: [5, 2241, 19, 8] and [0.0022, 0.9859, 0.0084, 0.0035]
cat 2: [3, 7, 964, 10] and [0.003, 0.0071, 0.9797, 0.0102]
cat 3: [16, 9, 19, 2250] and [0.007, 0.0039, 0.0083, 0.9808]
[test epoch 50/100] | loss 40.9 | nw acc 0.654 | time 1 min 6 sec
cat 0: [0, 69, 0, 18] and [0.0, 0.7931, 0.0, 0.2069]
cat 1: [0, 234, 50, 5] and [0.0, 0.8097, 0.173, 0.0173]
cat 2: [0, 112, 87, 23] and [0.0, 0.5045, 0.3919, 0.1036]
cat 3: [0, 500, 53, 1270] and [0.0, 0.2743, 0.0291, 0.6967]
[train epoch 51/100] | loss 0.762 | nw acc 0.982 | time 3 min 38 sec
cat 0: [1450, 4, 4, 6] and [0.9904, 0.0027, 0.0027, 0.0041]
cat 1: [6, 2237, 21, 7] and [0.0026, 0.985, 0.0092, 0.0031]
cat 2: [4, 4, 973, 9] and [0.004, 0.004, 0.9828, 0.0091]
cat 3: [9, 17, 18, 2256] and [0.0039, 0.0074, 0.0078, 0.9809]
[test epoch 51/100] | loss 39.7 | nw acc 0.684 | time 1 min 11 sec
cat 0: [0, 157, 0, 68] and [0.0, 0.6978, 0.0, 0.3022]
cat 1: [0, 433, 75, 38] and [0.0, 0.793, 0.1374, 0.0696]
cat 2: [0, 213, 106, 85] and [0.0, 0.5272, 0.2624, 0.2104]
cat 3: [0, 112, 9, 1125] and [0.0, 0.0899, 0.0072, 0.9029]
[train epoch 52/100] | loss 0.76233 | nw acc 0.982 | time 3 min 36 sec
cat 0: [1451, 4, 11, 8] and [0.9844, 0.0027, 0.0075, 0.0054]
cat 1: [5, 2240, 10, 9] and [0.0022, 0.9894, 0.0044, 0.004]
cat 2: [5, 8, 972, 9] and [0.005, 0.008, 0.9779, 0.0091]
cat 3: [8, 10, 23, 2252] and [0.0035, 0.0044, 0.01, 0.9821]
[test epoch 52/100] | loss 38.2 | nw acc 0.732 | time 1 min 15 sec
cat 0: [0, 68, 0, 68] and [0.0, 0.5, 0.0, 0.5]
cat 1: [0, 670, 96, 114] and [0.0, 0.7614, 0.1091, 0.1295]
cat 2: [0, 124, 93, 116] and [0.0, 0.3724, 0.2793, 0.3483]
cat 3: [0, 53, 1, 1018] and [0.0, 0.0494, 0.0009, 0.9496]
[train epoch 53/100] | loss 0.76185 | nw acc 0.982 | time 3 min 43 sec
cat 0: [1453, 4, 7, 7] and [0.9878, 0.0027, 0.0048, 0.0048]
cat 1: [5, 2236, 16, 11] and [0.0022, 0.9859, 0.0071, 0.0049]
cat 2: [3, 12, 976, 9] and [0.003, 0.012, 0.976, 0.009]
cat 3: [8, 10, 17, 2251] and [0.0035, 0.0044, 0.0074, 0.9847]
[test epoch 53/100] | loss 36.3 | nw acc 0.78 | time 1 min 13 sec
cat 0: [0, 48, 0, 36] and [0.0, 0.5714, 0.0, 0.4286]
cat 1: [0, 656, 108, 87] and [0.0, 0.7709, 0.1269, 0.1022]
cat 2: [0, 97, 81, 34] and [0.0, 0.4575, 0.3821, 0.1604]
cat 3: [0, 114, 1, 1159] and [0.0, 0.0895, 0.0008, 0.9097]
[train epoch 54/100] | loss 0.76219 | nw acc 0.982 | time 3 min 34 sec
cat 0: [1447, 7, 11, 7] and [0.983, 0.0048, 0.0075, 0.0048]
cat 1: [6, 2242, 15, 10] and [0.0026, 0.9864, 0.0066, 0.0044]
cat 2: [6, 7, 970, 10] and [0.006, 0.007, 0.9768, 0.0101]
cat 3: [10, 6, 20, 2251] and [0.0044, 0.0026, 0.0087, 0.9843]
[test epoch 54/100] | loss 38.4 | nw acc 0.724 | time 1 min 15 sec
cat 0: [0, 160, 1, 48] and [0.0, 0.7656, 0.0048, 0.2297]
cat 1: [0, 489, 97, 45] and [0.0, 0.775, 0.1537, 0.0713]
cat 2: [0, 89, 82, 33] and [0.0, 0.4363, 0.402, 0.1618]
cat 3: [0, 177, 10, 1190] and [0.0, 0.1285, 0.0073, 0.8642]
[train epoch 55/100] | loss 0.75904 | nw acc 0.984 | time 3 min 41 sec
cat 0: [1452, 3, 8, 3] and [0.9905, 0.002, 0.0055, 0.002]
cat 1: [5, 2243, 16, 7] and [0.0022, 0.9877, 0.007, 0.0031]
cat 2: [4, 10, 972, 10] and [0.004, 0.01, 0.9759, 0.01]
cat 3: [8, 6, 20, 2258] and [0.0035, 0.0026, 0.0087, 0.9852]
[test epoch 55/100] | loss 37.7 | nw acc 0.744 | time 1 min 14 sec
cat 0: [0, 136, 0, 48] and [0.0, 0.7391, 0.0, 0.2609]
cat 1: [0, 524, 103, 43] and [0.0, 0.7821, 0.1537, 0.0642]
cat 2: [0, 74, 78, 18] and [0.0, 0.4353, 0.4588, 0.1059]
cat 3: [0, 181, 9, 1207] and [0.0, 0.1296, 0.0064, 0.864]
[train epoch 56/100] | loss 0.75895 | nw acc 0.984 | time 3 min 32 sec
cat 0: [1453, 3, 6, 9] and [0.9878, 0.002, 0.0041, 0.0061]
cat 1: [4, 2241, 16, 6] and [0.0018, 0.9885, 0.0071, 0.0026]
cat 2: [6, 7, 979, 6] and [0.006, 0.007, 0.981, 0.006]
cat 3: [6, 11, 15, 2257] and [0.0026, 0.0048, 0.0066, 0.986]
[test epoch 56/100] | loss 37.8 | nw acc 0.739 | time 1 min 19 sec
cat 0: [0, 81, 0, 25] and [0.0, 0.7642, 0.0, 0.2358]
cat 1: [0, 499, 99, 39] and [0.0, 0.7834, 0.1554, 0.0612]
cat 2: [0, 134, 85, 38] and [0.0, 0.5214, 0.3307, 0.1479]
cat 3: [0, 201, 6, 1214] and [0.0, 0.1414, 0.0042, 0.8543]
[train epoch 57/100] | loss 0.75765 | nw acc 0.986 | time 3 min 46 sec
cat 0: [1452, 6, 6, 3] and [0.9898, 0.0041, 0.0041, 0.002]
cat 1: [5, 2243, 11, 10] and [0.0022, 0.9885, 0.0048, 0.0044]
cat 2: [6, 5, 989, 5] and [0.006, 0.005, 0.9841, 0.005]
cat 3: [6, 8, 10, 2260] and [0.0026, 0.0035, 0.0044, 0.9895]
[test epoch 57/100] | loss 38.2 | nw acc 0.723 | time 1 min 12 sec
cat 0: [0, 128, 0, 38] and [0.0, 0.7711, 0.0, 0.2289]
cat 1: [0, 470, 83, 29] and [0.0, 0.8076, 0.1426, 0.0498]
cat 2: [0, 136, 93, 53] and [0.0, 0.4823, 0.3298, 0.1879]
cat 3: [0, 181, 14, 1196] and [0.0, 0.1301, 0.0101, 0.8598]
[train epoch 58/100] | loss 0.76849 | nw acc 0.975 | time 4 min 15 sec
cat 0: [1436, 3, 16, 22] and [0.9722, 0.002, 0.0108, 0.0149]
cat 1: [7, 2242, 19, 13] and [0.0031, 0.9829, 0.0083, 0.0057]
cat 2: [7, 7, 958, 15] and [0.0071, 0.0071, 0.9706, 0.0152]
cat 3: [19, 10, 23, 2228] and [0.0083, 0.0044, 0.0101, 0.9772]
[test epoch 58/100] | loss 38.5 | nw acc 0.719 | time 1 min 18 sec
cat 0: [0, 102, 0, 38] and [0.0, 0.7286, 0.0, 0.2714]
cat 1: [0, 425, 77, 23] and [0.0, 0.8095, 0.1467, 0.0438]
cat 2: [0, 139, 98, 30] and [0.0, 0.5206, 0.367, 0.1124]
cat 3: [0, 249, 15, 1225] and [0.0, 0.1672, 0.0101, 0.8227]
[train epoch 59/100] | loss 0.75728 | nw acc 0.987 | time 4 min 44 sec
cat 0: [1453, 4, 4, 5] and [0.9911, 0.0027, 0.0027, 0.0034]
cat 1: [6, 2245, 14, 7] and [0.0026, 0.9881, 0.0062, 0.0031]
cat 2: [2, 5, 986, 5] and [0.002, 0.005, 0.988, 0.005]
cat 3: [8, 8, 12, 2261] and [0.0035, 0.0035, 0.0052, 0.9878]
[test epoch 59/100] | loss 39.4 | nw acc 0.692 | time 3 min 31 sec
cat 0: [0, 162, 0, 50] and [0.0, 0.7642, 0.0, 0.2358]
cat 1: [0, 414, 89, 32] and [0.0, 0.7738, 0.1664, 0.0598]
cat 2: [0, 162, 91, 57] and [0.0, 0.5226, 0.2935, 0.1839]
cat 3: [0, 177, 10, 1177] and [0.0, 0.1298, 0.0073, 0.8629]
[train epoch 60/100] | loss 0.75777 | nw acc 0.986 | time 3 min 34 sec
cat 0: [1455, 4, 2, 3] and [0.9939, 0.0027, 0.0014, 0.002]
cat 1: [5, 2242, 14, 11] and [0.0022, 0.9868, 0.0062, 0.0048]
cat 2: [3, 6, 987, 5] and [0.003, 0.006, 0.986, 0.005]
cat 3: [6, 10, 13, 2259] and [0.0026, 0.0044, 0.0057, 0.9873]
[test epoch 60/100] | loss 39.4 | nw acc 0.695 | time 1 min 56 sec
cat 0: [0, 110, 0, 49] and [0.0, 0.6918, 0.0, 0.3082]
cat 1: [0, 500, 99, 67] and [0.0, 0.7508, 0.1486, 0.1006]
cat 2: [0, 223, 89, 98] and [0.0, 0.5439, 0.2171, 0.239]
cat 3: [0, 82, 2, 1102] and [0.0, 0.0691, 0.0017, 0.9292]
[train epoch 61/100] | loss 0.7586 | nw acc 0.984 | time 5 min 58 sec
cat 0: [1453, 3, 7, 7] and [0.9884, 0.002, 0.0048, 0.0048]
cat 1: [5, 2243, 15, 6] and [0.0022, 0.9885, 0.0066, 0.0026]
cat 2: [5, 6, 979, 10] and [0.005, 0.006, 0.979, 0.01]
cat 3: [6, 10, 15, 2255] and [0.0026, 0.0044, 0.0066, 0.9864]
[test epoch 61/100] | loss 38.5 | nw acc 0.72 | time 2 min 21 sec
cat 0: [0, 168, 0, 63] and [0.0, 0.7273, 0.0, 0.2727]
cat 1: [0, 495, 95, 50] and [0.0, 0.7734, 0.1484, 0.0781]
cat 2: [0, 110, 89, 37] and [0.0, 0.4661, 0.3771, 0.1568]
cat 3: [0, 142, 6, 1166] and [0.0, 0.1081, 0.0046, 0.8874]
[train epoch 62/100] | loss 0.75576 | nw acc 0.988 | time 5 min 54 sec
cat 0: [1457, 4, 5, 6] and [0.9898, 0.0027, 0.0034, 0.0041]
cat 1: [5, 2243, 9, 5] and [0.0022, 0.9916, 0.004, 0.0022]
cat 2: [4, 9, 989, 2] and [0.004, 0.009, 0.9851, 0.002]
cat 3: [3, 6, 13, 2265] and [0.0013, 0.0026, 0.0057, 0.9904]
[test epoch 62/100] | loss 37.2 | nw acc 0.755 | time 1 min 7 sec
cat 0: [0, 83, 0, 31] and [0.0, 0.7281, 0.0, 0.2719]
cat 1: [0, 610, 102, 66] and [0.0, 0.7841, 0.1311, 0.0848]
cat 2: [0, 112, 83, 77] and [0.0, 0.4118, 0.3051, 0.2831]
cat 3: [0, 110, 5, 1142] and [0.0, 0.0875, 0.004, 0.9085]
[train epoch 63/100] | loss 0.75858 | nw acc 0.985 | time 5 min 45 sec
cat 0: [1447, 5, 4, 9] and [0.9877, 0.0034, 0.0027, 0.0061]
cat 1: [6, 2246, 12, 7] and [0.0026, 0.989, 0.0053, 0.0031]
cat 2: [7, 5, 984, 6] and [0.007, 0.005, 0.982, 0.006]
cat 3: [9, 6, 16, 2256] and [0.0039, 0.0026, 0.007, 0.9864]
[test epoch 63/100] | loss 37.8 | nw acc 0.734 | time 1 min 43 sec
cat 0: [0, 136, 0, 45] and [0.0, 0.7514, 0.0, 0.2486]
cat 1: [0, 482, 88, 30] and [0.0, 0.8033, 0.1467, 0.05]
cat 2: [0, 108, 90, 29] and [0.0, 0.4758, 0.3965, 0.1278]
cat 3: [0, 189, 12, 1212] and [0.0, 0.1338, 0.0085, 0.8577]
[train epoch 64/100] | loss 0.75505 | nw acc 0.988 | time 5 min 17 sec
cat 0: [1456, 6, 3, 6] and [0.9898, 0.0041, 0.002, 0.0041]
cat 1: [3, 2248, 9, 6] and [0.0013, 0.9921, 0.004, 0.0026]
cat 2: [3, 1, 993, 4] and [0.003, 0.001, 0.992, 0.004]
cat 3: [7, 7, 11, 2262] and [0.0031, 0.0031, 0.0048, 0.9891]
[test epoch 64/100] | loss 38 | nw acc 0.733 | time 1 min 11 sec
cat 0: [0, 97, 0, 38] and [0.0, 0.7185, 0.0, 0.2815]
cat 1: [0, 521, 96, 55] and [0.0, 0.7753, 0.1429, 0.0818]
cat 2: [0, 132, 85, 47] and [0.0, 0.5, 0.322, 0.178]
cat 3: [0, 165, 9, 1176] and [0.0, 0.1222, 0.0067, 0.8711]
