MaunaNet4AugDrop(
  (conv1): Conv2d(1, 3, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn1): BatchNorm2d(3, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (drop1): Dropout2d(p=0.2)
  (pool1): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv2): Conv2d(3, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
  (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (drop2): Dropout2d(p=0.2)
  (pool2): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv3): Conv2d(64, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
  (bn3): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (drop3): Dropout2d(p=0.2)
  (pool3): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv4): Conv2d(128, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
  (bn4): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (drop4): Dropout2d(p=0.2)
  (pool4): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (avgpool): AvgPool2d(kernel_size=7, stride=7, padding=0)
  (fc1): Linear(in_features=256, out_features=4, bias=True)
)
[train epoch 1/100] | loss 1.27 | nw acc 0.415 | time 2 min 13 sec
cat 0: [88, 77, 29, 95] and [0.3045, 0.2664, 0.1003, 0.3287]
cat 1: [580, 1311, 498, 1016] and [0.1703, 0.385, 0.1463, 0.2984]
cat 2: [35, 68, 38, 38] and [0.1955, 0.3799, 0.2123, 0.2123]
cat 3: [472, 1085, 400, 1726] and [0.1282, 0.2946, 0.1086, 0.4686]
[test epoch 1/100] | loss 0.312 | nw acc 0.426 | time 0 min 36 sec
cat 0: [24, 4, 3, 6] and [0.6486, 0.1081, 0.0811, 0.1622]
cat 1: [193, 510, 208, 429] and [0.144, 0.3806, 0.1552, 0.3201]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [77, 122, 30, 284] and [0.1501, 0.2378, 0.0585, 0.5536]
[train epoch 2/100] | loss 1.2435 | nw acc 0.42 | time 2 min 36 sec
cat 0: [68, 42, 10, 29] and [0.4564, 0.2819, 0.0671, 0.1946]
cat 1: [746, 1736, 699, 1449] and [0.1611, 0.3749, 0.151, 0.313]
cat 2: [1, 5, 2, 4] and [0.0833, 0.4167, 0.1667, 0.3333]
cat 3: [360, 758, 254, 1393] and [0.1302, 0.2741, 0.0919, 0.5038]
[test epoch 2/100] | loss 0.309 | nw acc 0.43 | time 0 min 38 sec
cat 0: [68, 33, 6, 30] and [0.4964, 0.2409, 0.0438, 0.219]
cat 1: [184, 498, 203, 423] and [0.1407, 0.3807, 0.1552, 0.3234]
cat 2: [1, 8, 2, 8] and [0.0526, 0.4211, 0.1053, 0.4211]
cat 3: [41, 97, 30, 258] and [0.0962, 0.2277, 0.0704, 0.6056]
[train epoch 3/100] | loss 1.2159 | nw acc 0.434 | time 2 min 33 sec
cat 0: [26, 15, 5, 18] and [0.4062, 0.2344, 0.0781, 0.2812]
cat 1: [654, 1530, 597, 1085] and [0.1692, 0.3958, 0.1544, 0.2807]
cat 2: [20, 28, 15, 41] and [0.1923, 0.2692, 0.1442, 0.3942]
cat 3: [475, 968, 348, 1731] and [0.1349, 0.2748, 0.0988, 0.4915]
[test epoch 3/100] | loss 0.327 | nw acc 0.326 | time 0 min 38 sec
cat 0: [2, 0, 0, 5] and [0.2857, 0.0, 0.0, 0.7143]
cat 1: [285, 608, 234, 681] and [0.1576, 0.3363, 0.1294, 0.3767]
cat 2: [4, 24, 7, 24] and [0.0678, 0.4068, 0.1186, 0.4068]
cat 3: [3, 4, 0, 9] and [0.1875, 0.25, 0.0, 0.5625]
[train epoch 4/100] | loss 1.2051 | nw acc 0.455 | time 2 min 35 sec
cat 0: [74, 38, 10, 46] and [0.4405, 0.2262, 0.0595, 0.2738]
cat 1: [612, 1514, 538, 931] and [0.1702, 0.4211, 0.1497, 0.259]
cat 2: [12, 39, 34, 51] and [0.0882, 0.2868, 0.25, 0.375]
cat 3: [477, 950, 383, 1847] and [0.1304, 0.2598, 0.1047, 0.5051]
[test epoch 4/100] | loss 0.305 | nw acc 0.48 | time 0 min 39 sec
cat 0: [65, 48, 6, 35] and [0.4221, 0.3117, 0.039, 0.2273]
cat 1: [101, 288, 105, 97] and [0.1709, 0.4873, 0.1777, 0.1641]
cat 2: [1, 12, 1, 19] and [0.0303, 0.3636, 0.0303, 0.5758]
cat 3: [127, 288, 129, 568] and [0.1142, 0.259, 0.116, 0.5108]
[train epoch 5/100] | loss 1.1901 | nw acc 0.462 | time 2 min 32 sec
cat 0: [69, 26, 7, 33] and [0.5111, 0.1926, 0.0519, 0.2444]
cat 1: [610, 1407, 522, 792] and [0.1831, 0.4224, 0.1567, 0.2378]
cat 2: [13, 21, 16, 25] and [0.1733, 0.28, 0.2133, 0.3333]
cat 3: [483, 1087, 420, 2025] and [0.1203, 0.2707, 0.1046, 0.5044]
[test epoch 5/100] | loss 0.288 | nw acc 0.503 | time 0 min 40 sec
cat 0: [69, 33, 13, 28] and [0.4825, 0.2308, 0.0909, 0.1958]
cat 1: [147, 366, 143, 154] and [0.1815, 0.4519, 0.1765, 0.1901]
cat 2: [12, 34, 25, 31] and [0.1176, 0.3333, 0.2451, 0.3039]
cat 3: [66, 203, 60, 506] and [0.079, 0.2431, 0.0719, 0.606]
[train epoch 6/100] | loss 1.1828 | nw acc 0.466 | time 2 min 34 sec
cat 0: [82, 24, 14, 23] and [0.5734, 0.1678, 0.0979, 0.1608]
cat 1: [600, 1531, 542, 873] and [0.1692, 0.4318, 0.1528, 0.2462]
cat 2: [14, 63, 35, 76] and [0.0745, 0.3351, 0.1862, 0.4043]
cat 3: [479, 923, 374, 1903] and [0.1302, 0.2509, 0.1017, 0.5173]
[test epoch 6/100] | loss 0.305 | nw acc 0.422 | time 0 min 39 sec
cat 0: [24, 7, 2, 35] and [0.3529, 0.1029, 0.0294, 0.5147]
cat 1: [137, 432, 168, 311] and [0.1307, 0.4122, 0.1603, 0.2968]
cat 2: [1, 16, 3, 21] and [0.0244, 0.3902, 0.0732, 0.5122]
cat 3: [132, 181, 68, 352] and [0.1801, 0.2469, 0.0928, 0.4802]
[train epoch 7/100] | loss 1.1653 | nw acc 0.481 | time 2 min 34 sec
cat 0: [182, 69, 26, 92] and [0.4932, 0.187, 0.0705, 0.2493]
cat 1: [542, 1468, 481, 760] and [0.1667, 0.4516, 0.148, 0.2338]
cat 2: [27, 61, 52, 59] and [0.1357, 0.3065, 0.2613, 0.2965]
cat 3: [424, 943, 406, 1964] and [0.1135, 0.2523, 0.1086, 0.5256]
[test epoch 7/100] | loss 0.299 | nw acc 0.495 | time 0 min 39 sec
cat 0: [130, 66, 48, 83] and [0.3976, 0.2018, 0.1468, 0.2538]
cat 1: [26, 314, 39, 136] and [0.0505, 0.6097, 0.0757, 0.2641]
cat 2: [49, 77, 61, 54] and [0.2033, 0.3195, 0.2531, 0.2241]
cat 3: [89, 179, 93, 446] and [0.1103, 0.2218, 0.1152, 0.5527]
[train epoch 8/100] | loss 1.1602 | nw acc 0.489 | time 2 min 36 sec
cat 0: [222, 90, 43, 100] and [0.4879, 0.1978, 0.0945, 0.2198]
cat 1: [530, 1446, 490, 696] and [0.1676, 0.4573, 0.155, 0.2201]
cat 2: [36, 68, 65, 89] and [0.1395, 0.2636, 0.2519, 0.345]
cat 3: [387, 937, 367, 1990] and [0.1051, 0.2546, 0.0997, 0.5406]
[test epoch 8/100] | loss 0.278 | nw acc 0.527 | time 0 min 39 sec
cat 0: [130, 65, 38, 66] and [0.4348, 0.2174, 0.1271, 0.2207]
cat 1: [79, 281, 95, 49] and [0.1567, 0.5575, 0.1885, 0.0972]
cat 2: [2, 9, 0, 4] and [0.1333, 0.6, 0.0, 0.2667]
cat 3: [83, 281, 108, 600] and [0.0774, 0.2621, 0.1007, 0.5597]
[train epoch 9/100] | loss 1.1362 | nw acc 0.501 | time 2 min 35 sec
cat 0: [224, 99, 48, 123] and [0.4534, 0.2004, 0.0972, 0.249]
cat 1: [504, 1431, 457, 588] and [0.1691, 0.4802, 0.1534, 0.1973]
cat 2: [30, 44, 39, 42] and [0.1935, 0.2839, 0.2516, 0.271]
cat 3: [417, 967, 421, 2122] and [0.1062, 0.2462, 0.1072, 0.5404]
[test epoch 9/100] | loss 0.278 | nw acc 0.527 | time 0 min 39 sec
cat 0: [132, 64, 32, 113] and [0.3871, 0.1877, 0.0938, 0.3314]
cat 1: [108, 405, 87, 153] and [0.1434, 0.5378, 0.1155, 0.2032]
cat 2: [33, 59, 70, 49] and [0.1564, 0.2796, 0.3318, 0.2322]
cat 3: [21, 108, 52, 404] and [0.0359, 0.1846, 0.0889, 0.6906]
[train epoch 10/100] | loss 1.12 | nw acc 0.513 | time 2 min 34 sec
cat 0: [323, 148, 93, 182] and [0.433, 0.1984, 0.1247, 0.244]
cat 1: [395, 1439, 412, 564] and [0.1406, 0.5121, 0.1466, 0.2007]
cat 2: [45, 72, 71, 53] and [0.1867, 0.2988, 0.2946, 0.2199]
cat 3: [412, 882, 389, 2076] and [0.1096, 0.2346, 0.1035, 0.5523]
[test epoch 10/100] | loss 0.259 | nw acc 0.586 | time 0 min 40 sec
cat 0: [101, 30, 9, 52] and [0.526, 0.1562, 0.0469, 0.2708]
cat 1: [71, 352, 49, 50] and [0.136, 0.6743, 0.0939, 0.0958]
cat 2: [40, 38, 84, 29] and [0.2094, 0.199, 0.4398, 0.1518]
cat 3: [82, 216, 99, 588] and [0.0832, 0.2193, 0.1005, 0.597]
[train epoch 11/100] | loss 1.1088 | nw acc 0.526 | time 2 min 31 sec
cat 0: [337, 163, 81, 163] and [0.453, 0.2191, 0.1089, 0.2191]
cat 1: [394, 1446, 379, 533] and [0.1432, 0.5254, 0.1377, 0.1937]
cat 2: [55, 63, 105, 58] and [0.1957, 0.2242, 0.3737, 0.2064]
cat 3: [389, 869, 400, 2121] and [0.1029, 0.23, 0.1058, 0.5613]
[test epoch 11/100] | loss 0.28 | nw acc 0.504 | time 0 min 37 sec
cat 0: [117, 62, 19, 91] and [0.4048, 0.2145, 0.0657, 0.3149]
cat 1: [9, 192, 23, 31] and [0.0353, 0.7529, 0.0902, 0.1216]
cat 2: [65, 70, 89, 28] and [0.2579, 0.2778, 0.3532, 0.1111]
cat 3: [103, 312, 110, 569] and [0.0941, 0.2852, 0.1005, 0.5201]
[train epoch 12/100] | loss 1.106 | nw acc 0.52 | time 2 min 35 sec
cat 0: [324, 152, 78, 185] and [0.4384, 0.2057, 0.1055, 0.2503]
cat 1: [469, 1501, 429, 597] and [0.1565, 0.501, 0.1432, 0.1993]
cat 2: [22, 41, 77, 34] and [0.1264, 0.2356, 0.4425, 0.1954]
cat 3: [360, 847, 381, 2059] and [0.0987, 0.2322, 0.1045, 0.5646]
[test epoch 12/100] | loss 0.252 | nw acc 0.59 | time 0 min 35 sec
cat 0: [101, 15, 10, 37] and [0.6196, 0.092, 0.0613, 0.227]
cat 1: [140, 493, 109, 194] and [0.1496, 0.5267, 0.1165, 0.2073]
cat 2: [24, 26, 70, 20] and [0.1714, 0.1857, 0.5, 0.1429]
cat 3: [29, 102, 52, 468] and [0.0445, 0.1567, 0.0799, 0.7189]
[train epoch 13/100] | loss 1.0926 | nw acc 0.537 | time 2 min 36 sec
cat 0: [361, 149, 80, 161] and [0.4807, 0.1984, 0.1065, 0.2144]
cat 1: [355, 1469, 380, 525] and [0.1301, 0.5383, 0.1392, 0.1924]
cat 2: [71, 82, 135, 62] and [0.2029, 0.2343, 0.3857, 0.1771]
cat 3: [388, 841, 370, 2127] and [0.1041, 0.2257, 0.0993, 0.5709]
[test epoch 13/100] | loss 0.316 | nw acc 0.429 | time 0 min 40 sec
cat 0: [86, 31, 15, 8] and [0.6143, 0.2214, 0.1071, 0.0571]
cat 1: [0, 26, 1, 0] and [0.0, 0.963, 0.037, 0.0]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [208, 579, 225, 711] and [0.1207, 0.336, 0.1306, 0.4127]
[train epoch 14/100] | loss 1.0845 | nw acc 0.532 | time 2 min 38 sec
cat 0: [351, 155, 100, 168] and [0.4535, 0.2003, 0.1292, 0.2171]
cat 1: [373, 1488, 370, 561] and [0.1336, 0.533, 0.1325, 0.2009]
cat 2: [49, 77, 117, 51] and [0.1667, 0.2619, 0.398, 0.1735]
cat 3: [402, 821, 378, 2095] and [0.1088, 0.2221, 0.1023, 0.5668]
[test epoch 14/100] | loss 0.27 | nw acc 0.555 | time 0 min 38 sec
cat 0: [220, 133, 95, 143] and [0.3723, 0.225, 0.1607, 0.242]
cat 1: [19, 264, 26, 22] and [0.0574, 0.7976, 0.0785, 0.0665]
cat 2: [13, 57, 73, 46] and [0.0688, 0.3016, 0.3862, 0.2434]
cat 3: [42, 182, 47, 508] and [0.0539, 0.2336, 0.0603, 0.6521]
[train epoch 15/100] | loss 1.07 | nw acc 0.549 | time 2 min 36 sec
cat 0: [413, 178, 79, 160] and [0.4976, 0.2145, 0.0952, 0.1928]
cat 1: [342, 1482, 363, 528] and [0.126, 0.5459, 0.1337, 0.1945]
cat 2: [53, 90, 160, 58] and [0.1468, 0.2493, 0.4432, 0.1607]
cat 3: [367, 791, 363, 2129] and [0.1005, 0.2167, 0.0995, 0.5833]
[test epoch 15/100] | loss 0.265 | nw acc 0.551 | time 0 min 42 sec
cat 0: [168, 52, 71, 101] and [0.4286, 0.1327, 0.1811, 0.2577]
cat 1: [56, 448, 101, 188] and [0.0706, 0.5649, 0.1274, 0.2371]
cat 2: [1, 17, 40, 28] and [0.0116, 0.1977, 0.4651, 0.3256]
cat 3: [69, 119, 29, 402] and [0.1115, 0.1922, 0.0468, 0.6494]
[train epoch 16/100] | loss 1.0719 | nw acc 0.553 | time 2 min 30 sec
cat 0: [421, 197, 110, 191] and [0.4581, 0.2144, 0.1197, 0.2078]
cat 1: [343, 1453, 338, 458] and [0.1323, 0.5606, 0.1304, 0.1767]
cat 2: [48, 106, 178, 66] and [0.1206, 0.2663, 0.4472, 0.1658]
cat 3: [363, 785, 339, 2160] and [0.0995, 0.2152, 0.093, 0.5923]
[test epoch 16/100] | loss 0.263 | nw acc 0.571 | time 0 min 38 sec
cat 0: [205, 85, 60, 169] and [0.395, 0.1638, 0.1156, 0.3256]
cat 1: [50, 394, 43, 112] and [0.0835, 0.6578, 0.0718, 0.187]
cat 2: [22, 65, 124, 65] and [0.0797, 0.2355, 0.4493, 0.2355]
cat 3: [17, 92, 14, 373] and [0.0343, 0.1855, 0.0282, 0.752]
[train epoch 17/100] | loss 1.0595 | nw acc 0.56 | time 2 min 37 sec
cat 0: [463, 178, 110, 178] and [0.4984, 0.1916, 0.1184, 0.1916]
cat 1: [290, 1478, 315, 497] and [0.1124, 0.5729, 0.1221, 0.1926]
cat 2: [57, 111, 198, 73] and [0.1298, 0.2528, 0.451, 0.1663]
cat 3: [365, 774, 342, 2127] and [0.1012, 0.2145, 0.0948, 0.5895]
[test epoch 17/100] | loss 0.249 | nw acc 0.594 | time 0 min 38 sec
cat 0: [122, 34, 11, 42] and [0.5837, 0.1627, 0.0526, 0.201]
cat 1: [20, 297, 30, 26] and [0.0536, 0.7962, 0.0804, 0.0697]
cat 2: [53, 57, 114, 43] and [0.1985, 0.2135, 0.427, 0.161]
cat 3: [99, 248, 86, 608] and [0.0951, 0.2382, 0.0826, 0.5841]
[train epoch 18/100] | loss 1.0511 | nw acc 0.562 | time 2 min 35 sec
cat 0: [448, 170, 85, 175] and [0.5103, 0.1936, 0.0968, 0.1993]
cat 1: [291, 1461, 310, 465] and [0.1152, 0.5782, 0.1227, 0.184]
cat 2: [99, 184, 237, 99] and [0.1599, 0.2973, 0.3829, 0.1599]
cat 3: [337, 726, 333, 2136] and [0.0954, 0.2055, 0.0943, 0.6048]
[test epoch 18/100] | loss 0.232 | nw acc 0.639 | time 0 min 38 sec
cat 0: [183, 56, 31, 44] and [0.5828, 0.1783, 0.0987, 0.1401]
cat 1: [37, 382, 61, 58] and [0.0688, 0.71, 0.1134, 0.1078]
cat 2: [9, 25, 56, 12] and [0.0882, 0.2451, 0.549, 0.1176]
cat 3: [65, 173, 93, 605] and [0.0694, 0.1848, 0.0994, 0.6464]
[train epoch 19/100] | loss 1.0434 | nw acc 0.572 | time 2 min 33 sec
cat 0: [502, 191, 90, 188] and [0.517, 0.1967, 0.0927, 0.1936]
cat 1: [290, 1525, 315, 494] and [0.1105, 0.5812, 0.12, 0.1883]
cat 2: [52, 96, 209, 73] and [0.1209, 0.2233, 0.486, 0.1698]
cat 3: [331, 729, 351, 2120] and [0.0937, 0.2065, 0.0994, 0.6004]
[test epoch 19/100] | loss 0.269 | nw acc 0.553 | time 0 min 40 sec
cat 0: [260, 144, 95, 216] and [0.3636, 0.2014, 0.1329, 0.3021]
cat 1: [27, 380, 37, 114] and [0.0484, 0.681, 0.0663, 0.2043]
cat 2: [3, 57, 103, 71] and [0.0128, 0.2436, 0.4402, 0.3034]
cat 3: [4, 55, 6, 318] and [0.0104, 0.1436, 0.0157, 0.8303]
[train epoch 20/100] | loss 1.0372 | nw acc 0.576 | time 2 min 32 sec
cat 0: [501, 191, 103, 176] and [0.516, 0.1967, 0.1061, 0.1813]
cat 1: [284, 1476, 319, 438] and [0.1128, 0.5864, 0.1267, 0.174]
cat 2: [52, 125, 232, 85] and [0.1053, 0.253, 0.4696, 0.1721]
cat 3: [338, 749, 311, 2176] and [0.0946, 0.2096, 0.087, 0.6088]
[test epoch 20/100] | loss 0.242 | nw acc 0.632 | time 0 min 39 sec
cat 0: [183, 57, 17, 94] and [0.5214, 0.1624, 0.0484, 0.2678]
cat 1: [26, 377, 45, 64] and [0.0508, 0.7363, 0.0879, 0.125]
cat 2: [54, 66, 141, 48] and [0.1748, 0.2136, 0.4563, 0.1553]
cat 3: [31, 136, 38, 513] and [0.0432, 0.1894, 0.0529, 0.7145]
[train epoch 21/100] | loss 1.0242 | nw acc 0.582 | time 2 min 39 sec
cat 0: [489, 189, 115, 182] and [0.5015, 0.1938, 0.1179, 0.1867]
cat 1: [272, 1541, 288, 429] and [0.1075, 0.6091, 0.1138, 0.1696]
cat 2: [65, 116, 234, 92] and [0.1282, 0.2288, 0.4615, 0.1815]
cat 3: [349, 695, 328, 2172] and [0.0985, 0.1961, 0.0926, 0.6129]
[test epoch 21/100] | loss 0.248 | nw acc 0.594 | time 0 min 37 sec
cat 0: [167, 70, 25, 71] and [0.5015, 0.2102, 0.0751, 0.2132]
cat 1: [11, 260, 31, 15] and [0.0347, 0.8202, 0.0978, 0.0473]
cat 2: [35, 63, 113, 33] and [0.1434, 0.2582, 0.4631, 0.1352]
cat 3: [81, 243, 72, 600] and [0.0813, 0.244, 0.0723, 0.6024]
[train epoch 22/100] | loss 1.0281 | nw acc 0.584 | time 2 min 34 sec
cat 0: [480, 184, 113, 218] and [0.4824, 0.1849, 0.1136, 0.2191]
cat 1: [261, 1556, 294, 419] and [0.1032, 0.615, 0.1162, 0.1656]
cat 2: [72, 125, 251, 76] and [0.1374, 0.2385, 0.479, 0.145]
cat 3: [362, 676, 307, 2162] and [0.1032, 0.1928, 0.0875, 0.6165]
[test epoch 22/100] | loss 0.252 | nw acc 0.608 | time 0 min 40 sec
cat 0: [203, 94, 32, 103] and [0.4699, 0.2176, 0.0741, 0.2384]
cat 1: [4, 291, 27, 38] and [0.0111, 0.8083, 0.075, 0.1056]
cat 2: [32, 71, 142, 47] and [0.1096, 0.2432, 0.4863, 0.161]
cat 3: [55, 180, 40, 531] and [0.0682, 0.2233, 0.0496, 0.6588]
[train epoch 23/100] | loss 1.0305 | nw acc 0.579 | time 2 min 37 sec
cat 0: [493, 191, 102, 176] and [0.5125, 0.1985, 0.106, 0.183]
cat 1: [274, 1549, 312, 473] and [0.1051, 0.5939, 0.1196, 0.1814]
cat 2: [70, 127, 245, 107] and [0.1275, 0.2313, 0.4463, 0.1949]
cat 3: [338, 674, 306, 2119] and [0.0983, 0.1961, 0.089, 0.6165]
[test epoch 23/100] | loss 0.249 | nw acc 0.605 | time 0 min 36 sec
cat 0: [259, 125, 87, 170] and [0.4041, 0.195, 0.1357, 0.2652]
cat 1: [8, 349, 34, 61] and [0.0177, 0.7721, 0.0752, 0.135]
cat 2: [3, 51, 102, 36] and [0.0156, 0.2656, 0.5312, 0.1875]
cat 3: [24, 111, 18, 452] and [0.0397, 0.1835, 0.0298, 0.7471]
[train epoch 24/100] | loss 1.006 | nw acc 0.595 | time 2 min 34 sec
cat 0: [510, 156, 106, 194] and [0.528, 0.1615, 0.1097, 0.2008]
cat 1: [278, 1600, 323, 413] and [0.1064, 0.6121, 0.1236, 0.158]
cat 2: [60, 143, 250, 98] and [0.1089, 0.2595, 0.4537, 0.1779]
cat 3: [327, 642, 286, 2170] and [0.0955, 0.1874, 0.0835, 0.6336]
[test epoch 24/100] | loss 0.238 | nw acc 0.631 | time 0 min 38 sec
cat 0: [255, 105, 68, 147] and [0.4435, 0.1826, 0.1183, 0.2557]
cat 1: [11, 361, 42, 42] and [0.0241, 0.7917, 0.0921, 0.0921]
cat 2: [5, 51, 102, 37] and [0.0256, 0.2615, 0.5231, 0.1897]
cat 3: [23, 119, 29, 493] and [0.0346, 0.1792, 0.0437, 0.7425]
[train epoch 25/100] | loss 1.0056 | nw acc 0.591 | time 2 min 38 sec
cat 0: [528, 181, 112, 208] and [0.5131, 0.1759, 0.1088, 0.2021]
cat 1: [261, 1552, 288, 435] and [0.1029, 0.612, 0.1136, 0.1715]
cat 2: [57, 121, 274, 82] and [0.1067, 0.2266, 0.5131, 0.1536]
cat 3: [329, 687, 291, 2150] and [0.0952, 0.1987, 0.0842, 0.6219]
[test epoch 25/100] | loss 0.25 | nw acc 0.602 | time 0 min 41 sec
cat 0: [206, 70, 31, 91] and [0.5176, 0.1759, 0.0779, 0.2286]
cat 1: [16, 335, 25, 61] and [0.0366, 0.7666, 0.0572, 0.1396]
cat 2: [40, 114, 173, 125] and [0.0885, 0.2522, 0.3827, 0.2765]
cat 3: [32, 117, 12, 442] and [0.0531, 0.194, 0.0199, 0.733]
[train epoch 26/100] | loss 1.0118 | nw acc 0.598 | time 2 min 35 sec
cat 0: [520, 179, 123, 194] and [0.5118, 0.1762, 0.1211, 0.1909]
cat 1: [250, 1606, 292, 441] and [0.0966, 0.6203, 0.1128, 0.1703]
cat 2: [60, 126, 276, 89] and [0.1089, 0.2287, 0.5009, 0.1615]
cat 3: [345, 630, 274, 2151] and [0.1015, 0.1853, 0.0806, 0.6326]
[test epoch 26/100] | loss 0.257 | nw acc 0.554 | time 0 min 38 sec
cat 0: [83, 11, 2, 3] and [0.8384, 0.1111, 0.0202, 0.0303]
cat 1: [16, 214, 31, 9] and [0.0593, 0.7926, 0.1148, 0.0333]
cat 2: [22, 34, 70, 10] and [0.1618, 0.25, 0.5147, 0.0735]
cat 3: [173, 377, 138, 697] and [0.1249, 0.2722, 0.0996, 0.5032]
[train epoch 27/100] | loss 1.0107 | nw acc 0.595 | time 2 min 32 sec
cat 0: [511, 194, 100, 195] and [0.511, 0.194, 0.1, 0.195]
cat 1: [288, 1569, 305, 425] and [0.1113, 0.6065, 0.1179, 0.1643]
cat 2: [56, 110, 271, 73] and [0.1098, 0.2157, 0.5314, 0.1431]
cat 3: [320, 668, 289, 2182] and [0.0925, 0.1931, 0.0836, 0.6308]
[test epoch 27/100] | loss 0.235 | nw acc 0.642 | time 0 min 38 sec
cat 0: [234, 75, 51, 108] and [0.5, 0.1603, 0.109, 0.2308]
cat 1: [21, 414, 43, 98] and [0.0365, 0.7188, 0.0747, 0.1701]
cat 2: [16, 63, 140, 68] and [0.0557, 0.2195, 0.4878, 0.2369]
cat 3: [23, 84, 7, 445] and [0.0411, 0.1503, 0.0125, 0.7961]
[train epoch 28/100] | loss 0.99621 | nw acc 0.598 | time 2 min 36 sec
cat 0: [544, 188, 133, 183] and [0.5191, 0.1794, 0.1269, 0.1746]
cat 1: [235, 1593, 282, 455] and [0.0916, 0.6211, 0.1099, 0.1774]
cat 2: [60, 127, 277, 100] and [0.1064, 0.2252, 0.4911, 0.1773]
cat 3: [336, 633, 273, 2137] and [0.0994, 0.1873, 0.0808, 0.6324]
[test epoch 28/100] | loss 0.241 | nw acc 0.628 | time 0 min 38 sec
cat 0: [185, 73, 31, 80] and [0.5014, 0.1978, 0.084, 0.2168]
cat 1: [9, 328, 32, 44] and [0.0218, 0.7942, 0.0775, 0.1065]
cat 2: [35, 65, 137, 40] and [0.1264, 0.2347, 0.4946, 0.1444]
cat 3: [65, 170, 41, 555] and [0.0782, 0.2046, 0.0493, 0.6679]
[train epoch 29/100] | loss 0.98755 | nw acc 0.606 | time 2 min 34 sec
cat 0: [549, 152, 85, 169] and [0.5749, 0.1592, 0.089, 0.177]
cat 1: [246, 1634, 312, 460] and [0.0928, 0.6161, 0.1176, 0.1735]
cat 2: [65, 152, 270, 87] and [0.1132, 0.2648, 0.4704, 0.1516]
cat 3: [315, 603, 298, 2159] and [0.0933, 0.1787, 0.0883, 0.6397]
[test epoch 29/100] | loss 0.246 | nw acc 0.574 | time 0 min 39 sec
cat 0: [113, 16, 6, 30] and [0.6848, 0.097, 0.0364, 0.1818]
cat 1: [29, 321, 38, 25] and [0.0702, 0.7772, 0.092, 0.0605]
cat 2: [0, 8, 4, 0] and [0.0, 0.6667, 0.3333, 0.0]
cat 3: [152, 291, 193, 664] and [0.1169, 0.2238, 0.1485, 0.5108]
[train epoch 30/100] | loss 0.99034 | nw acc 0.605 | time 2 min 34 sec
cat 0: [565, 148, 115, 191] and [0.5545, 0.1452, 0.1129, 0.1874]
cat 1: [248, 1613, 316, 442] and [0.0947, 0.6159, 0.1207, 0.1688]
cat 2: [60, 130, 276, 88] and [0.1083, 0.2347, 0.4982, 0.1588]
cat 3: [302, 650, 258, 2154] and [0.0898, 0.1932, 0.0767, 0.6403]
[test epoch 30/100] | loss 0.233 | nw acc 0.633 | time 0 min 38 sec
cat 0: [194, 48, 22, 79] and [0.5656, 0.1399, 0.0641, 0.2303]
cat 1: [18, 407, 36, 100] and [0.0321, 0.7255, 0.0642, 0.1783]
cat 2: [48, 96, 167, 93] and [0.1188, 0.2376, 0.4134, 0.2302]
cat 3: [34, 85, 16, 447] and [0.0584, 0.146, 0.0275, 0.768]
[train epoch 31/100] | loss 0.99365 | nw acc 0.605 | time 2 min 37 sec
cat 0: [560, 187, 97, 180] and [0.5469, 0.1826, 0.0947, 0.1758]
cat 1: [227, 1564, 294, 392] and [0.0916, 0.6314, 0.1187, 0.1583]
cat 2: [72, 133, 289, 110] and [0.1192, 0.2202, 0.4785, 0.1821]
cat 3: [316, 657, 285, 2193] and [0.0916, 0.1904, 0.0826, 0.6355]
[test epoch 31/100] | loss 0.226 | nw acc 0.663 | time 0 min 39 sec
cat 0: [197, 65, 23, 53] and [0.5828, 0.1923, 0.068, 0.1568]
cat 1: [20, 353, 43, 32] and [0.0446, 0.7879, 0.096, 0.0714]
cat 2: [13, 39, 103, 14] and [0.0769, 0.2308, 0.6095, 0.0828]
cat 3: [64, 179, 72, 620] and [0.0684, 0.1914, 0.077, 0.6631]
[train epoch 32/100] | loss 0.98623 | nw acc 0.607 | time 2 min 34 sec
cat 0: [535, 171, 116, 203] and [0.522, 0.1668, 0.1132, 0.198]
cat 1: [255, 1645, 302, 400] and [0.098, 0.6322, 0.1161, 0.1537]
cat 2: [59, 130, 280, 108] and [0.1023, 0.2253, 0.4853, 0.1872]
cat 3: [326, 595, 267, 2164] and [0.0973, 0.1775, 0.0797, 0.6456]
[test epoch 32/100] | loss 0.221 | nw acc 0.67 | time 0 min 37 sec
cat 0: [234, 78, 56, 77] and [0.5258, 0.1753, 0.1258, 0.173]
cat 1: [10, 365, 37, 48] and [0.0217, 0.7935, 0.0804, 0.1043]
cat 2: [7, 47, 121, 28] and [0.0345, 0.2315, 0.5961, 0.1379]
cat 3: [43, 146, 27, 566] and [0.055, 0.1867, 0.0345, 0.7238]
[train epoch 33/100] | loss 0.97814 | nw acc 0.614 | time 2 min 30 sec
cat 0: [581, 163, 109, 184] and [0.5603, 0.1572, 0.1051, 0.1774]
cat 1: [229, 1670, 301, 463] and [0.086, 0.6271, 0.113, 0.1739]
cat 2: [68, 128, 293, 98] and [0.1158, 0.2181, 0.4991, 0.167]
cat 3: [297, 580, 262, 2130] and [0.0909, 0.1774, 0.0801, 0.6516]
[test epoch 33/100] | loss 0.225 | nw acc 0.671 | time 0 min 39 sec
cat 0: [220, 60, 39, 92] and [0.5353, 0.146, 0.0949, 0.2238]
cat 1: [22, 410, 46, 59] and [0.041, 0.7635, 0.0857, 0.1099]
cat 2: [17, 60, 131, 40] and [0.0685, 0.2419, 0.5282, 0.1613]
cat 3: [35, 106, 25, 528] and [0.0504, 0.1527, 0.036, 0.7608]
[train epoch 34/100] | loss 0.97244 | nw acc 0.616 | time 2 min 34 sec
cat 0: [566, 185, 87, 172] and [0.5604, 0.1832, 0.0861, 0.1703]
cat 1: [239, 1640, 295, 459] and [0.0908, 0.6229, 0.112, 0.1743]
cat 2: [63, 115, 344, 102] and [0.101, 0.1843, 0.5513, 0.1635]
cat 3: [307, 601, 239, 2142] and [0.0933, 0.1827, 0.0727, 0.6513]
[test epoch 34/100] | loss 0.265 | nw acc 0.54 | time 0 min 41 sec
cat 0: [174, 63, 26, 57] and [0.5437, 0.1969, 0.0813, 0.1781]
cat 1: [9, 166, 13, 3] and [0.0471, 0.8691, 0.0681, 0.0157]
cat 2: [3, 56, 52, 15] and [0.0238, 0.4444, 0.4127, 0.119]
cat 3: [108, 351, 150, 644] and [0.0862, 0.2801, 0.1197, 0.514]
[train epoch 35/100] | loss 0.97324 | nw acc 0.613 | time 2 min 35 sec
cat 0: [538, 152, 92, 157] and [0.5729, 0.1619, 0.098, 0.1672]
cat 1: [265, 1645, 304, 438] and [0.0999, 0.6203, 0.1146, 0.1652]
cat 2: [57, 110, 286, 79] and [0.1071, 0.2068, 0.5376, 0.1485]
cat 3: [315, 634, 283, 2201] and [0.0918, 0.1847, 0.0824, 0.6411]
[test epoch 35/100] | loss 0.225 | nw acc 0.643 | time 0 min 39 sec
cat 0: [167, 39, 21, 26] and [0.6601, 0.1542, 0.083, 0.1028]
cat 1: [11, 323, 28, 19] and [0.0289, 0.8478, 0.0735, 0.0499]
cat 2: [21, 49, 100, 29] and [0.1055, 0.2462, 0.5025, 0.1457]
cat 3: [95, 225, 92, 645] and [0.0899, 0.2129, 0.087, 0.6102]
[train epoch 36/100] | loss 0.96464 | nw acc 0.62 | time 2 min 36 sec
cat 0: [580, 181, 118, 206] and [0.5346, 0.1668, 0.1088, 0.1899]
cat 1: [223, 1650, 278, 407] and [0.0872, 0.645, 0.1087, 0.1591]
cat 2: [61, 128, 295, 68] and [0.1105, 0.2319, 0.5344, 0.1232]
cat 3: [311, 582, 274, 2194] and [0.0925, 0.1732, 0.0815, 0.6528]
[test epoch 36/100] | loss 0.223 | nw acc 0.672 | time 0 min 38 sec
cat 0: [217, 31, 24, 87] and [0.6045, 0.0864, 0.0669, 0.2423]
cat 1: [39, 485, 59, 120] and [0.0555, 0.6899, 0.0839, 0.1707]
cat 2: [23, 47, 142, 66] and [0.0827, 0.1691, 0.5108, 0.2374]
cat 3: [15, 73, 16, 446] and [0.0273, 0.1327, 0.0291, 0.8109]
[train epoch 37/100] | loss 0.9631 | nw acc 0.618 | time 2 min 37 sec
cat 0: [589, 162, 112, 180] and [0.5647, 0.1553, 0.1074, 0.1726]
cat 1: [198, 1645, 305, 426] and [0.0769, 0.6391, 0.1185, 0.1655]
cat 2: [77, 158, 302, 95] and [0.1218, 0.25, 0.4778, 0.1503]
cat 3: [311, 576, 246, 2174] and [0.094, 0.1742, 0.0744, 0.6574]
[test epoch 37/100] | loss 0.22 | nw acc 0.676 | time 0 min 38 sec
cat 0: [202, 36, 18, 65] and [0.6293, 0.1121, 0.0561, 0.2025]
cat 1: [31, 422, 47, 72] and [0.0542, 0.7378, 0.0822, 0.1259]
cat 2: [11, 54, 143, 51] and [0.0425, 0.2085, 0.5521, 0.1969]
cat 3: [50, 124, 33, 531] and [0.0678, 0.168, 0.0447, 0.7195]
[train epoch 38/100] | loss 0.96806 | nw acc 0.629 | time 2 min 37 sec
cat 0: [594, 151, 117, 197] and [0.5609, 0.1426, 0.1105, 0.186]
cat 1: [230, 1728, 310, 433] and [0.0852, 0.6398, 0.1148, 0.1603]
cat 2: [68, 131, 325, 105] and [0.1081, 0.2083, 0.5167, 0.1669]
cat 3: [283, 531, 213, 2140] and [0.0894, 0.1677, 0.0673, 0.6757]
[test epoch 38/100] | loss 0.23 | nw acc 0.643 | time 0 min 39 sec
cat 0: [260, 94, 81, 152] and [0.4429, 0.1601, 0.138, 0.2589]
cat 1: [16, 379, 44, 44] and [0.0331, 0.7847, 0.0911, 0.0911]
cat 2: [6, 41, 98, 25] and [0.0353, 0.2412, 0.5765, 0.1471]
cat 3: [12, 122, 18, 498] and [0.0185, 0.1877, 0.0277, 0.7662]
[train epoch 39/100] | loss 0.95068 | nw acc 0.633 | time 2 min 36 sec
cat 0: [607, 175, 97, 184] and [0.571, 0.1646, 0.0913, 0.1731]
cat 1: [235, 1708, 302, 417] and [0.0883, 0.6416, 0.1134, 0.1566]
cat 2: [64, 139, 327, 95] and [0.1024, 0.2224, 0.5232, 0.152]
cat 3: [269, 519, 239, 2179] and [0.0839, 0.1619, 0.0745, 0.6797]
[test epoch 39/100] | loss 0.228 | nw acc 0.658 | time 0 min 38 sec
cat 0: [235, 71, 53, 105] and [0.5065, 0.153, 0.1142, 0.2263]
cat 1: [26, 435, 51, 93] and [0.043, 0.719, 0.0843, 0.1537]
cat 2: [11, 40, 118, 46] and [0.0512, 0.186, 0.5488, 0.214]
cat 3: [22, 90, 19, 475] and [0.0363, 0.1485, 0.0314, 0.7838]
[train epoch 40/100] | loss 0.96204 | nw acc 0.625 | time 2 min 36 sec
cat 0: [618, 174, 109, 191] and [0.5659, 0.1593, 0.0998, 0.1749]
cat 1: [230, 1686, 278, 460] and [0.0867, 0.6353, 0.1047, 0.1733]
cat 2: [56, 112, 301, 72] and [0.1035, 0.207, 0.5564, 0.1331]
cat 3: [271, 569, 277, 2152] and [0.0829, 0.1741, 0.0847, 0.6583]
[test epoch 40/100] | loss 0.222 | nw acc 0.683 | time 0 min 38 sec
cat 0: [236, 57, 54, 91] and [0.5388, 0.1301, 0.1233, 0.2078]
cat 1: [21, 426, 56, 68] and [0.0368, 0.7461, 0.0981, 0.1191]
cat 2: [4, 42, 102, 13] and [0.0248, 0.2609, 0.6335, 0.0807]
cat 3: [33, 111, 29, 547] and [0.0458, 0.1542, 0.0403, 0.7597]
[train epoch 41/100] | loss 0.94946 | nw acc 0.631 | time 2 min 37 sec
cat 0: [624, 168, 109, 195] and [0.5693, 0.1533, 0.0995, 0.1779]
cat 1: [203, 1724, 324, 436] and [0.0755, 0.6416, 0.1206, 0.1623]
cat 2: [59, 125, 302, 88] and [0.1028, 0.2178, 0.5261, 0.1533]
cat 3: [289, 524, 230, 2156] and [0.0903, 0.1638, 0.0719, 0.674]
[test epoch 41/100] | loss 0.225 | nw acc 0.658 | time 0 min 38 sec
cat 0: [221, 80, 41, 80] and [0.5237, 0.1896, 0.0972, 0.1896]
cat 1: [20, 347, 39, 33] and [0.0456, 0.7904, 0.0888, 0.0752]
cat 2: [15, 58, 132, 42] and [0.0607, 0.2348, 0.5344, 0.17]
cat 3: [38, 151, 29, 564] and [0.0486, 0.1931, 0.0371, 0.7212]
[train epoch 42/100] | loss 0.94592 | nw acc 0.637 | time 2 min 40 sec
cat 0: [626, 180, 112, 184] and [0.5681, 0.1633, 0.1016, 0.167]
cat 1: [199, 1712, 279, 419] and [0.0763, 0.6562, 0.1069, 0.1606]
cat 2: [74, 110, 324, 84] and [0.125, 0.1858, 0.5473, 0.1419]
cat 3: [276, 539, 250, 2188] and [0.0848, 0.1657, 0.0769, 0.6726]
[test epoch 42/100] | loss 0.224 | nw acc 0.658 | time 0 min 39 sec
cat 0: [210, 42, 47, 55] and [0.5932, 0.1186, 0.1328, 0.1554]
cat 1: [24, 425, 63, 84] and [0.0403, 0.7131, 0.1057, 0.1409]
cat 2: [13, 44, 108, 60] and [0.0578, 0.1956, 0.48, 0.2667]
cat 3: [47, 125, 23, 520] and [0.0657, 0.1748, 0.0322, 0.7273]
[train epoch 43/100] | loss 0.94748 | nw acc 0.637 | time 2 min 39 sec
cat 0: [623, 174, 118, 184] and [0.5669, 0.1583, 0.1074, 0.1674]
cat 1: [223, 1738, 291, 438] and [0.0829, 0.6461, 0.1082, 0.1628]
cat 2: [67, 107, 334, 96] and [0.1109, 0.1772, 0.553, 0.1589]
cat 3: [262, 522, 222, 2157] and [0.0828, 0.165, 0.0702, 0.6819]
[test epoch 43/100] | loss 0.225 | nw acc 0.67 | time 0 min 38 sec
cat 0: [275, 126, 82, 134] and [0.4457, 0.2042, 0.1329, 0.2172]
cat 1: [4, 382, 26, 40] and [0.0088, 0.8451, 0.0575, 0.0885]
cat 2: [3, 38, 108, 24] and [0.0173, 0.2197, 0.6243, 0.1387]
cat 3: [12, 90, 25, 521] and [0.0185, 0.1389, 0.0386, 0.804]
[train epoch 44/100] | loss 0.94242 | nw acc 0.637 | time 2 min 33 sec
cat 0: [624, 165, 108, 168] and [0.5859, 0.1549, 0.1014, 0.1577]
cat 1: [230, 1735, 280, 415] and [0.0865, 0.6523, 0.1053, 0.156]
cat 2: [57, 122, 308, 104] and [0.0964, 0.2064, 0.5212, 0.176]
cat 3: [264, 519, 269, 2188] and [0.0815, 0.1602, 0.083, 0.6753]
[test epoch 44/100] | loss 0.232 | nw acc 0.645 | time 0 min 39 sec
cat 0: [259, 117, 62, 151] and [0.4397, 0.1986, 0.1053, 0.2564]
cat 1: [16, 385, 44, 58] and [0.0318, 0.7654, 0.0875, 0.1153]
cat 2: [7, 46, 118, 33] and [0.0343, 0.2255, 0.5784, 0.1618]
cat 3: [12, 88, 17, 477] and [0.0202, 0.1481, 0.0286, 0.803]
[train epoch 45/100] | loss 0.94537 | nw acc 0.64 | time 2 min 35 sec
cat 0: [633, 189, 103, 193] and [0.5662, 0.1691, 0.0921, 0.1726]
cat 1: [210, 1718, 273, 394] and [0.0809, 0.662, 0.1052, 0.1518]
cat 2: [64, 131, 353, 117] and [0.0962, 0.197, 0.5308, 0.1759]
cat 3: [268, 503, 236, 2171] and [0.0843, 0.1583, 0.0743, 0.6831]
[test epoch 45/100] | loss 0.219 | nw acc 0.678 | time 0 min 37 sec
cat 0: [257, 92, 73, 101] and [0.4914, 0.1759, 0.1396, 0.1931]
cat 1: [12, 397, 34, 49] and [0.0244, 0.8069, 0.0691, 0.0996]
cat 2: [3, 34, 103, 24] and [0.0183, 0.2073, 0.628, 0.1463]
cat 3: [22, 113, 31, 545] and [0.0309, 0.1589, 0.0436, 0.7665]
[train epoch 46/100] | loss 0.92989 | nw acc 0.647 | time 2 min 33 sec
cat 0: [633, 147, 115, 181] and [0.5883, 0.1366, 0.1069, 0.1682]
cat 1: [194, 1789, 286, 424] and [0.072, 0.6643, 0.1062, 0.1574]
cat 2: [68, 120, 333, 96] and [0.1102, 0.1945, 0.5397, 0.1556]
cat 3: [280, 485, 231, 2174] and [0.0883, 0.153, 0.0729, 0.6858]
[test epoch 46/100] | loss 0.22 | nw acc 0.684 | time 0 min 38 sec
cat 0: [259, 87, 55, 98] and [0.519, 0.1743, 0.1102, 0.1964]
cat 1: [7, 391, 34, 51] and [0.0145, 0.8095, 0.0704, 0.1056]
cat 2: [11, 54, 131, 38] and [0.047, 0.2308, 0.5598, 0.1624]
cat 3: [17, 104, 21, 532] and [0.0252, 0.1543, 0.0312, 0.7893]
[train epoch 47/100] | loss 0.92967 | nw acc 0.649 | time 2 min 38 sec
cat 0: [639, 143, 109, 151] and [0.6132, 0.1372, 0.1046, 0.1449]
cat 1: [199, 1750, 279, 408] and [0.0755, 0.6639, 0.1058, 0.1548]
cat 2: [64, 123, 326, 88] and [0.1065, 0.2047, 0.5424, 0.1464]
cat 3: [273, 525, 251, 2228] and [0.0833, 0.1602, 0.0766, 0.6799]
[test epoch 47/100] | loss 0.215 | nw acc 0.687 | time 0 min 39 sec
cat 0: [177, 32, 11, 67] and [0.6167, 0.1115, 0.0383, 0.2334]
cat 1: [44, 479, 50, 84] and [0.067, 0.7291, 0.0761, 0.1279]
cat 2: [41, 39, 159, 64] and [0.1353, 0.1287, 0.5248, 0.2112]
cat 3: [32, 86, 21, 504] and [0.0498, 0.1337, 0.0327, 0.7838]
[train epoch 48/100] | loss 0.93018 | nw acc 0.652 | time 2 min 56 sec
cat 0: [643, 140, 98, 163] and [0.6159, 0.1341, 0.0939, 0.1561]
cat 1: [203, 1791, 284, 433] and [0.0749, 0.6606, 0.1048, 0.1597]
cat 2: [47, 132, 354, 100] and [0.0742, 0.2085, 0.5592, 0.158]
cat 3: [282, 478, 229, 2179] and [0.089, 0.1509, 0.0723, 0.6878]
[test epoch 48/100] | loss 0.21 | nw acc 0.698 | time 0 min 45 sec
cat 0: [180, 24, 16, 21] and [0.7469, 0.0996, 0.0664, 0.0871]
cat 1: [41, 435, 56, 66] and [0.0686, 0.7274, 0.0936, 0.1104]
cat 2: [18, 44, 122, 28] and [0.0849, 0.2075, 0.5755, 0.1321]
cat 3: [55, 133, 47, 604] and [0.0656, 0.1585, 0.056, 0.7199]
[train epoch 49/100] | loss 0.9315 | nw acc 0.649 | time 2 min 50 sec
cat 0: [645, 179, 120, 178] and [0.5749, 0.1595, 0.107, 0.1586]
cat 1: [223, 1747, 286, 397] and [0.0841, 0.6585, 0.1078, 0.1496]
cat 2: [72, 130, 350, 100] and [0.1104, 0.1994, 0.5368, 0.1534]
cat 3: [235, 485, 209, 2200] and [0.0751, 0.155, 0.0668, 0.7031]
[test epoch 49/100] | loss 0.21 | nw acc 0.696 | time 0 min 37 sec
cat 0: [218, 43, 34, 71] and [0.5956, 0.1175, 0.0929, 0.194]
cat 1: [29, 447, 40, 73] and [0.0492, 0.7589, 0.0679, 0.1239]
cat 2: [23, 67, 151, 55] and [0.0777, 0.2264, 0.5101, 0.1858]
cat 3: [24, 79, 16, 520] and [0.0376, 0.1236, 0.025, 0.8138]
[train epoch 50/100] | loss 0.92399 | nw acc 0.655 | time 2 min 51 sec
cat 0: [672, 164, 98, 144] and [0.6234, 0.1521, 0.0909, 0.1336]
cat 1: [185, 1760, 286, 415] and [0.0699, 0.6652, 0.1081, 0.1568]
cat 2: [65, 126, 346, 104] and [0.1014, 0.1966, 0.5398, 0.1622]
cat 3: [253, 491, 235, 2212] and [0.0793, 0.1539, 0.0736, 0.6932]
[test epoch 50/100] | loss 0.21 | nw acc 0.691 | time 0 min 55 sec
cat 0: [233, 48, 54, 76] and [0.5669, 0.1168, 0.1314, 0.1849]
cat 1: [26, 467, 72, 88] and [0.0398, 0.7152, 0.1103, 0.1348]
cat 2: [4, 31, 86, 14] and [0.0296, 0.2296, 0.637, 0.1037]
cat 3: [31, 90, 29, 541] and [0.0449, 0.1302, 0.042, 0.7829]
[train epoch 51/100] | loss 0.9216 | nw acc 0.652 | time 2 min 35 sec
cat 0: [647, 139, 103, 160] and [0.6168, 0.1325, 0.0982, 0.1525]
cat 1: [189, 1781, 304, 426] and [0.07, 0.6596, 0.1126, 0.1578]
cat 2: [62, 139, 353, 106] and [0.0939, 0.2106, 0.5348, 0.1606]
cat 3: [277, 482, 205, 2183] and [0.088, 0.1532, 0.0651, 0.6937]
[test epoch 51/100] | loss 0.224 | nw acc 0.671 | time 0 min 38 sec
cat 0: [267, 115, 74, 142] and [0.4465, 0.1923, 0.1237, 0.2375]
cat 1: [5, 388, 32, 41] and [0.0107, 0.8326, 0.0687, 0.088]
cat 2: [10, 47, 119, 22] and [0.0505, 0.2374, 0.601, 0.1111]
cat 3: [12, 86, 16, 514] and [0.0191, 0.1369, 0.0255, 0.8185]
[train epoch 52/100] | loss 0.9084 | nw acc 0.671 | time 2 min 38 sec
cat 0: [681, 158, 104, 166] and [0.6141, 0.1425, 0.0938, 0.1497]
cat 1: [157, 1807, 273, 388] and [0.0598, 0.6884, 0.104, 0.1478]
cat 2: [71, 114, 380, 77] and [0.1106, 0.1776, 0.5919, 0.1199]
cat 3: [266, 462, 208, 2244] and [0.0836, 0.1453, 0.0654, 0.7057]
[test epoch 52/100] | loss 0.209 | nw acc 0.71 | time 0 min 34 sec
cat 0: [257, 91, 55, 82] and [0.5299, 0.1876, 0.1134, 0.1691]
cat 1: [15, 440, 48, 59] and [0.0267, 0.7829, 0.0854, 0.105]
cat 2: [4, 36, 123, 35] and [0.0202, 0.1818, 0.6212, 0.1768]
cat 3: [18, 69, 15, 543] and [0.0279, 0.107, 0.0233, 0.8419]
[train epoch 53/100] | loss 0.91953 | nw acc 0.657 | time 2 min 38 sec
cat 0: [654, 147, 111, 172] and [0.6033, 0.1356, 0.1024, 0.1587]
cat 1: [192, 1768, 262, 376] and [0.0739, 0.6805, 0.1008, 0.1447]
cat 2: [54, 126, 361, 106] and [0.0835, 0.1947, 0.558, 0.1638]
cat 3: [275, 500, 231, 2221] and [0.0852, 0.1549, 0.0716, 0.6883]
[test epoch 53/100] | loss 0.218 | nw acc 0.689 | time 0 min 37 sec
cat 0: [234, 72, 34, 75] and [0.5639, 0.1735, 0.0819, 0.1807]
cat 1: [14, 382, 38, 43] and [0.0294, 0.8008, 0.0797, 0.0901]
cat 2: [16, 60, 146, 40] and [0.0611, 0.229, 0.5573, 0.1527]
cat 3: [30, 122, 23, 561] and [0.0408, 0.1658, 0.0312, 0.7622]
[train epoch 54/100] | loss 0.90907 | nw acc 0.658 | time 2 min 37 sec
cat 0: [666, 174, 104, 175] and [0.5952, 0.1555, 0.0929, 0.1564]
cat 1: [180, 1767, 279, 406] and [0.0684, 0.6714, 0.106, 0.1543]
cat 2: [76, 116, 387, 100] and [0.1119, 0.1708, 0.57, 0.1473]
cat 3: [253, 484, 195, 2194] and [0.0809, 0.1548, 0.0624, 0.7019]
[test epoch 54/100] | loss 0.207 | nw acc 0.705 | time 0 min 36 sec
cat 0: [219, 36, 18, 65] and [0.6479, 0.1065, 0.0533, 0.1923]
cat 1: [28, 462, 42, 70] and [0.0465, 0.7674, 0.0698, 0.1163]
cat 2: [27, 65, 151, 63] and [0.0882, 0.2124, 0.4935, 0.2059]
cat 3: [20, 73, 30, 521] and [0.0311, 0.1134, 0.0466, 0.809]
[train epoch 55/100] | loss 0.90677 | nw acc 0.656 | time 2 min 34 sec
cat 0: [686, 152, 111, 208] and [0.5929, 0.1314, 0.0959, 0.1798]
cat 1: [184, 1784, 301, 414] and [0.0686, 0.6649, 0.1122, 0.1543]
cat 2: [64, 136, 368, 94] and [0.0967, 0.2054, 0.5559, 0.142]
cat 3: [241, 469, 185, 2159] and [0.0789, 0.1536, 0.0606, 0.7069]
[test epoch 55/100] | loss 0.207 | nw acc 0.703 | time 0 min 39 sec
cat 0: [245, 57, 38, 76] and [0.5889, 0.137, 0.0913, 0.1827]
cat 1: [16, 444, 52, 59] and [0.028, 0.7776, 0.0911, 0.1033]
cat 2: [10, 49, 129, 53] and [0.0415, 0.2033, 0.5353, 0.2199]
cat 3: [23, 86, 22, 531] and [0.0347, 0.1299, 0.0332, 0.8021]
[train epoch 56/100] | loss 0.91239 | nw acc 0.664 | time 2 min 37 sec
cat 0: [646, 142, 109, 163] and [0.6094, 0.134, 0.1028, 0.1538]
cat 1: [193, 1813, 274, 375] and [0.0727, 0.6829, 0.1032, 0.1412]
cat 2: [56, 126, 367, 105] and [0.0856, 0.1927, 0.5612, 0.1606]
cat 3: [280, 460, 215, 2232] and [0.0879, 0.1443, 0.0675, 0.7003]
[test epoch 56/100] | loss 0.202 | nw acc 0.717 | time 0 min 39 sec
cat 0: [212, 27, 33, 34] and [0.6928, 0.0882, 0.1078, 0.1111]
cat 1: [17, 424, 52, 52] and [0.0312, 0.778, 0.0954, 0.0954]
cat 2: [6, 31, 117, 10] and [0.0366, 0.189, 0.7134, 0.061]
cat 3: [59, 154, 39, 623] and [0.0674, 0.176, 0.0446, 0.712]
[train epoch 57/100] | loss 0.91214 | nw acc 0.658 | time 2 min 47 sec
cat 0: [668, 144, 103, 171] and [0.6151, 0.1326, 0.0948, 0.1575]
cat 1: [197, 1822, 283, 440] and [0.0718, 0.6645, 0.1032, 0.1605]
cat 2: [57, 106, 347, 90] and [0.095, 0.1767, 0.5783, 0.15]
cat 3: [253, 469, 232, 2174] and [0.0809, 0.1499, 0.0742, 0.695]
[test epoch 57/100] | loss 0.211 | nw acc 0.704 | time 0 min 39 sec
cat 0: [218, 43, 19, 74] and [0.6158, 0.1215, 0.0537, 0.209]
cat 1: [48, 499, 62, 117] and [0.0661, 0.6873, 0.0854, 0.1612]
cat 2: [9, 36, 147, 41] and [0.0386, 0.1545, 0.6309, 0.176]
cat 3: [19, 58, 13, 487] and [0.0329, 0.1005, 0.0225, 0.844]
[train epoch 58/100] | loss 0.90209 | nw acc 0.67 | time 2 min 36 sec
cat 0: [683, 160, 103, 165] and [0.6148, 0.144, 0.0927, 0.1485]
cat 1: [171, 1801, 263, 386] and [0.0652, 0.6871, 0.1003, 0.1473]
cat 2: [63, 111, 385, 92] and [0.0968, 0.1705, 0.5914, 0.1413]
cat 3: [258, 469, 214, 2232] and [0.0813, 0.1478, 0.0674, 0.7034]
[test epoch 58/100] | loss 0.204 | nw acc 0.714 | time 0 min 39 sec
cat 0: [227, 48, 31, 57] and [0.6253, 0.1322, 0.0854, 0.157]
cat 1: [23, 435, 52, 50] and [0.0411, 0.7768, 0.0929, 0.0893]
cat 2: [6, 43, 122, 26] and [0.0305, 0.2183, 0.6193, 0.132]
cat 3: [38, 110, 36, 586] and [0.0494, 0.1429, 0.0468, 0.761]
[train epoch 59/100] | loss 0.90348 | nw acc 0.668 | time 2 min 34 sec
cat 0: [679, 142, 101, 171] and [0.6212, 0.1299, 0.0924, 0.1565]
cat 1: [190, 1822, 285, 405] and [0.0703, 0.6743, 0.1055, 0.1499]
cat 2: [69, 121, 380, 93] and [0.1041, 0.1825, 0.5732, 0.1403]
cat 3: [237, 456, 199, 2206] and [0.0765, 0.1472, 0.0642, 0.7121]
[test epoch 59/100] | loss 0.223 | nw acc 0.651 | time 0 min 40 sec
cat 0: [244, 108, 63, 96] and [0.4775, 0.2114, 0.1233, 0.1879]
cat 1: [20, 357, 51, 41] and [0.0426, 0.7612, 0.1087, 0.0874]
cat 2: [4, 46, 104, 37] and [0.0209, 0.2408, 0.5445, 0.1937]
cat 3: [26, 125, 23, 545] and [0.0362, 0.1739, 0.032, 0.758]
[train epoch 60/100] | loss 0.89219 | nw acc 0.673 | time 2 min 33 sec
cat 0: [692, 166, 100, 163] and [0.6173, 0.1481, 0.0892, 0.1454]
cat 1: [195, 1820, 293, 395] and [0.0721, 0.6733, 0.1084, 0.1461]
cat 2: [49, 120, 385, 85] and [0.0767, 0.1878, 0.6025, 0.133]
cat 3: [239, 435, 187, 2232] and [0.0773, 0.1406, 0.0605, 0.7216]
[test epoch 60/100] | loss 0.201 | nw acc 0.728 | time 0 min 38 sec
cat 0: [225, 35, 26, 53] and [0.6637, 0.1032, 0.0767, 0.1563]
cat 1: [39, 500, 60, 88] and [0.0568, 0.7278, 0.0873, 0.1281]
cat 2: [11, 35, 137, 42] and [0.0489, 0.1556, 0.6089, 0.1867]
cat 3: [19, 66, 18, 536] and [0.0297, 0.1033, 0.0282, 0.8388]
[train epoch 61/100] | loss 0.89118 | nw acc 0.674 | time 2 min 37 sec
cat 0: [689, 153, 103, 155] and [0.6264, 0.1391, 0.0936, 0.1409]
cat 1: [182, 1844, 277, 399] and [0.0674, 0.6825, 0.1025, 0.1477]
cat 2: [48, 107, 377, 99] and [0.0761, 0.1696, 0.5975, 0.1569]
cat 3: [256, 437, 208, 2222] and [0.082, 0.1399, 0.0666, 0.7115]
[test epoch 61/100] | loss 0.21 | nw acc 0.71 | time 0 min 38 sec
cat 0: [229, 24, 18, 67] and [0.6775, 0.071, 0.0533, 0.1982]
cat 1: [34, 537, 51, 141] and [0.0446, 0.7038, 0.0668, 0.1848]
cat 2: [25, 53, 164, 78] and [0.0781, 0.1656, 0.5125, 0.2437]
cat 3: [6, 22, 8, 433] and [0.0128, 0.0469, 0.0171, 0.9232]
[train epoch 62/100] | loss 0.90165 | nw acc 0.667 | time 2 min 41 sec
cat 0: [675, 129, 82, 142] and [0.6566, 0.1255, 0.0798, 0.1381]
cat 1: [202, 1839, 298, 424] and [0.0731, 0.6656, 0.1079, 0.1535]
cat 2: [58, 135, 344, 87] and [0.0929, 0.2163, 0.5513, 0.1394]
cat 3: [240, 438, 241, 2222] and [0.0764, 0.1394, 0.0767, 0.7074]
[test epoch 62/100] | loss 0.21 | nw acc 0.696 | time 0 min 39 sec
cat 0: [260, 74, 62, 117] and [0.5068, 0.1442, 0.1209, 0.2281]
cat 1: [11, 434, 33, 46] and [0.021, 0.8282, 0.063, 0.0878]
cat 2: [7, 47, 133, 46] and [0.03, 0.2017, 0.5708, 0.1974]
cat 3: [16, 81, 13, 510] and [0.0258, 0.1306, 0.021, 0.8226]
[train epoch 63/100] | loss 0.90657 | nw acc 0.667 | time 2 min 39 sec
cat 0: [686, 160, 126, 184] and [0.5934, 0.1384, 0.109, 0.1592]
cat 1: [190, 1830, 283, 412] and [0.07, 0.674, 0.1042, 0.1517]
cat 2: [48, 113, 371, 84] and [0.0779, 0.1834, 0.6023, 0.1364]
cat 3: [251, 438, 185, 2195] and [0.0818, 0.1427, 0.0603, 0.7152]
[test epoch 63/100] | loss 0.201 | nw acc 0.728 | time 0 min 37 sec
cat 0: [241, 56, 34, 50] and [0.6325, 0.147, 0.0892, 0.1312]
cat 1: [16, 442, 50, 48] and [0.0288, 0.795, 0.0899, 0.0863]
cat 2: [9, 39, 133, 39] and [0.0409, 0.1773, 0.6045, 0.1773]
cat 3: [28, 99, 24, 582] and [0.0382, 0.1351, 0.0327, 0.794]
[train epoch 64/100] | loss 0.88399 | nw acc 0.674 | time 2 min 35 sec
cat 0: [711, 177, 116, 170] and [0.6056, 0.1508, 0.0988, 0.1448]
cat 1: [155, 1821, 296, 406] and [0.0579, 0.68, 0.1105, 0.1516]
cat 2: [62, 115, 379, 79] and [0.0976, 0.1811, 0.5969, 0.1244]
cat 3: [247, 428, 174, 2220] and [0.0805, 0.1395, 0.0567, 0.7234]
[test epoch 64/100] | loss 0.199 | nw acc 0.736 | time 0 min 39 sec
cat 0: [256, 46, 45, 85] and [0.5926, 0.1065, 0.1042, 0.1968]
cat 1: [22, 530, 56, 98] and [0.0312, 0.7507, 0.0793, 0.1388]
cat 2: [5, 29, 123, 31] and [0.0266, 0.1543, 0.6543, 0.1649]
cat 3: [11, 31, 17, 505] and [0.0195, 0.055, 0.0301, 0.8954]
[train epoch 65/100] | loss 0.88523 | nw acc 0.678 | time 2 min 35 sec
cat 0: [680, 138, 105, 162] and [0.6267, 0.1272, 0.0968, 0.1493]
cat 1: [185, 1867, 292, 401] and [0.0674, 0.6801, 0.1064, 0.1461]
cat 2: [67, 119, 399, 92] and [0.099, 0.1758, 0.5894, 0.1359]
cat 3: [243, 417, 169, 2220] and [0.0797, 0.1368, 0.0554, 0.7281]
[test epoch 65/100] | loss 0.215 | nw acc 0.7 | time 0 min 40 sec
cat 0: [258, 82, 47, 115] and [0.5139, 0.1633, 0.0936, 0.2291]
cat 1: [6, 404, 27, 23] and [0.013, 0.8783, 0.0587, 0.05]
cat 2: [20, 64, 145, 44] and [0.0733, 0.2344, 0.5311, 0.1612]
cat 3: [10, 86, 22, 537] and [0.0153, 0.1313, 0.0336, 0.8198]
[train epoch 66/100] | loss 0.88583 | nw acc 0.681 | time 2 min 33 sec
cat 0: [696, 132, 98, 157] and [0.6427, 0.1219, 0.0905, 0.145]
cat 1: [176, 1855, 279, 368] and [0.0657, 0.6927, 0.1042, 0.1374]
cat 2: [61, 117, 366, 79] and [0.0979, 0.1878, 0.5875, 0.1268]
cat 3: [242, 437, 222, 2271] and [0.0763, 0.1378, 0.07, 0.716]
[test epoch 66/100] | loss 0.196 | nw acc 0.74 | time 0 min 39 sec
cat 0: [230, 35, 18, 49] and [0.6928, 0.1054, 0.0542, 0.1476]
cat 1: [26, 509, 65, 94] and [0.0375, 0.7334, 0.0937, 0.1354]
cat 2: [17, 36, 138, 32] and [0.0762, 0.1614, 0.6188, 0.1435]
cat 3: [21, 56, 20, 544] and [0.0328, 0.0874, 0.0312, 0.8487]
[train epoch 67/100] | loss 0.87372 | nw acc 0.685 | time 2 min 37 sec
cat 0: [684, 121, 94, 169] and [0.6404, 0.1133, 0.088, 0.1582]
cat 1: [163, 1859, 268, 358] and [0.0616, 0.702, 0.1012, 0.1352]
cat 2: [68, 124, 426, 102] and [0.0944, 0.1722, 0.5917, 0.1417]
cat 3: [260, 437, 177, 2246] and [0.0833, 0.1401, 0.0567, 0.7199]
[test epoch 67/100] | loss 0.21 | nw acc 0.708 | time 0 min 38 sec
cat 0: [266, 83, 51, 126] and [0.5057, 0.1578, 0.097, 0.2395]
cat 1: [9, 444, 37, 41] and [0.0169, 0.8362, 0.0697, 0.0772]
cat 2: [8, 50, 136, 39] and [0.0343, 0.2146, 0.5837, 0.1674]
cat 3: [11, 59, 17, 513] and [0.0183, 0.0983, 0.0283, 0.855]
[train epoch 68/100] | loss 0.89007 | nw acc 0.682 | time 1 min 44 sec
cat 0: [714, 155, 85, 155] and [0.6438, 0.1398, 0.0766, 0.1398]
cat 1: [166, 1824, 264, 366] and [0.0634, 0.6962, 0.1008, 0.1397]
cat 2: [56, 111, 385, 82] and [0.0883, 0.1751, 0.6073, 0.1293]
cat 3: [239, 451, 231, 2272] and [0.0749, 0.1412, 0.0723, 0.7116]
[test epoch 68/100] | loss 0.201 | nw acc 0.717 | time 0 min 18 sec
cat 0: [215, 45, 23, 42] and [0.6615, 0.1385, 0.0708, 0.1292]
cat 1: [17, 415, 42, 48] and [0.0326, 0.795, 0.0805, 0.092]
cat 2: [9, 42, 145, 27] and [0.0404, 0.1883, 0.6502, 0.1211]
cat 3: [53, 134, 31, 602] and [0.0646, 0.1634, 0.0378, 0.7341]
[train epoch 69/100] | loss 0.88676 | nw acc 0.678 | time 1 min 6 sec
cat 0: [711, 151, 100, 179] and [0.6231, 0.1323, 0.0876, 0.1569]
cat 1: [191, 1864, 291, 390] and [0.0698, 0.6813, 0.1064, 0.1425]
cat 2: [56, 112, 362, 78] and [0.0921, 0.1842, 0.5954, 0.1283]
cat 3: [217, 414, 212, 2228] and [0.0707, 0.1348, 0.069, 0.7255]
[test epoch 69/100] | loss 0.207 | nw acc 0.718 | time 0 min 14 sec
cat 0: [254, 53, 34, 97] and [0.5799, 0.121, 0.0776, 0.2215]
cat 1: [12, 466, 41, 59] and [0.0208, 0.8062, 0.0709, 0.1021]
cat 2: [21, 61, 162, 66] and [0.0677, 0.1968, 0.5226, 0.2129]
cat 3: [7, 56, 4, 497] and [0.0124, 0.0993, 0.0071, 0.8812]
