BenchMark(
  (conv1): Conv2d(1, 3, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (pool1): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (drop1): Dropout2d(p=0.2)
  (conv2): Conv2d(3, 16, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (pool2): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (drop2): Dropout2d(p=0.2)
  (conv3): Conv2d(16, 32, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (pool3): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (drop3): Dropout2d(p=0.2)
  (fc1): Linear(in_features=1568, out_features=4, bias=True)
)
[train epoch 1/100] | loss 1.3056 | nw acc 0.37 | time 3 min 32 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [135, 308, 118, 363] and [0.1461, 0.3333, 0.1277, 0.3929]
cat 2: [0, 1, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 3: [1040, 2232, 847, 2512] and [0.1568, 0.3366, 0.1277, 0.3788]
[test epoch 1/100] | loss 0.326 | nw acc 0.374 | time 1 min 20 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [294, 636, 241, 719] and [0.1556, 0.3365, 0.1275, 0.3804]
[train epoch 2/100] | loss 1.2963 | nw acc 0.371 | time 1 min 26 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [79, 180, 71, 228] and [0.1416, 0.3226, 0.1272, 0.4086]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1096, 2361, 894, 2647] and [0.1566, 0.3374, 0.1278, 0.3783]
[test epoch 2/100] | loss 0.322 | nw acc 0.387 | time 0 min 27 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [26, 74, 28, 50] and [0.1461, 0.4157, 0.1573, 0.2809]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [268, 562, 213, 669] and [0.1565, 0.3283, 0.1244, 0.3908]
[train epoch 3/100] | loss 1.2647 | nw acc 0.416 | time 2 min 1 sec
cat 0: [26, 2, 8, 8] and [0.5909, 0.0455, 0.1818, 0.1818]
cat 1: [312, 952, 398, 675] and [0.1335, 0.4074, 0.1703, 0.2888]
cat 2: [0, 2, 2, 2] and [0.0, 0.3333, 0.3333, 0.3333]
cat 3: [837, 1585, 557, 2190] and [0.1619, 0.3066, 0.1078, 0.4237]
[test epoch 3/100] | loss 0.305 | nw acc 0.458 | time 0 min 36 sec
cat 0: [31, 3, 8, 12] and [0.5741, 0.0556, 0.1481, 0.2222]
cat 1: [118, 347, 154, 205] and [0.1432, 0.4211, 0.1869, 0.2488]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [145, 286, 79, 502] and [0.1433, 0.2826, 0.0781, 0.496]
[train epoch 4/100] | loss 1.2247 | nw acc 0.45 | time 2 min 44 sec
cat 0: [174, 19, 53, 42] and [0.6042, 0.066, 0.184, 0.1458]
cat 1: [292, 1073, 385, 657] and [0.1213, 0.4458, 0.16, 0.273]
cat 2: [13, 12, 11, 8] and [0.2955, 0.2727, 0.25, 0.1818]
cat 3: [696, 1437, 516, 2168] and [0.1445, 0.2983, 0.1071, 0.4501]
[test epoch 4/100] | loss 0.299 | nw acc 0.477 | time 0 min 46 sec
cat 0: [51, 4, 19, 15] and [0.573, 0.0449, 0.2135, 0.1685]
cat 1: [110, 367, 141, 208] and [0.1332, 0.4443, 0.1707, 0.2518]
cat 2: [0, 1, 1, 0] and [0.0, 0.5, 0.5, 0.0]
cat 3: [133, 264, 80, 496] and [0.1367, 0.2713, 0.0822, 0.5098]
[train epoch 5/100] | loss 1.2076 | nw acc 0.474 | time 3 min 13 sec
cat 0: [239, 26, 70, 66] and [0.596, 0.0648, 0.1746, 0.1646]
cat 1: [304, 1130, 338, 580] and [0.1293, 0.4804, 0.1437, 0.2466]
cat 2: [21, 34, 24, 13] and [0.2283, 0.3696, 0.2609, 0.1413]
cat 3: [611, 1351, 533, 2216] and [0.1297, 0.2868, 0.1131, 0.4704]
[test epoch 5/100] | loss 0.295 | nw acc 0.495 | time 0 min 46 sec
cat 0: [80, 24, 31, 28] and [0.4908, 0.1472, 0.1902, 0.1718]
cat 1: [95, 369, 135, 190] and [0.1204, 0.4677, 0.1711, 0.2408]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [119, 243, 75, 501] and [0.1269, 0.2591, 0.08, 0.5341]
[train epoch 6/100] | loss 1.1832 | nw acc 0.481 | time 3 min 9 sec
cat 0: [262, 45, 75, 65] and [0.5861, 0.1007, 0.1678, 0.1454]
cat 1: [299, 1184, 358, 598] and [0.1226, 0.4854, 0.1468, 0.2452]
cat 2: [7, 13, 15, 7] and [0.1667, 0.3095, 0.3571, 0.1667]
cat 3: [607, 1299, 517, 2205] and [0.1312, 0.2807, 0.1117, 0.4764]
[test epoch 6/100] | loss 0.287 | nw acc 0.506 | time 0 min 46 sec
cat 0: [80, 19, 28, 21] and [0.5405, 0.1284, 0.1892, 0.1419]
cat 1: [88, 339, 108, 147] and [0.129, 0.4971, 0.1584, 0.2155]
cat 2: [0, 1, 2, 1] and [0.0, 0.25, 0.5, 0.25]
cat 3: [126, 277, 103, 550] and [0.1193, 0.2623, 0.0975, 0.5208]
[train epoch 7/100] | loss 1.1721 | nw acc 0.492 | time 3 min 11 sec
cat 0: [307, 61, 77, 79] and [0.5859, 0.1164, 0.1469, 0.1508]
cat 1: [295, 1200, 311, 580] and [0.1236, 0.5029, 0.1303, 0.2431]
cat 2: [15, 14, 28, 7] and [0.2344, 0.2188, 0.4375, 0.1094]
cat 3: [558, 1266, 549, 2209] and [0.1218, 0.2763, 0.1198, 0.4821]
[test epoch 7/100] | loss 0.288 | nw acc 0.524 | time 0 min 50 sec
cat 0: [115, 58, 45, 43] and [0.4406, 0.2222, 0.1724, 0.1648]
cat 1: [77, 348, 108, 134] and [0.1154, 0.5217, 0.1619, 0.2009]
cat 2: [0, 0, 1, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [102, 230, 87, 542] and [0.1061, 0.2393, 0.0905, 0.564]
[train epoch 8/100] | loss 1.1562 | nw acc 0.504 | time 3 min 14 sec
cat 0: [324, 56, 82, 81] and [0.5967, 0.1031, 0.151, 0.1492]
cat 1: [322, 1244, 353, 546] and [0.1306, 0.5047, 0.1432, 0.2215]
cat 2: [13, 15, 35, 10] and [0.1781, 0.2055, 0.4795, 0.137]
cat 3: [516, 1226, 495, 2238] and [0.1153, 0.274, 0.1106, 0.5001]
[test epoch 8/100] | loss 0.279 | nw acc 0.532 | time 0 min 44 sec
cat 0: [113, 28, 29, 24] and [0.5825, 0.1443, 0.1495, 0.1237]
cat 1: [96, 416, 142, 207] and [0.1115, 0.4832, 0.1649, 0.2404]
cat 2: [0, 1, 9, 4] and [0.0, 0.0714, 0.6429, 0.2857]
cat 3: [85, 191, 61, 484] and [0.1035, 0.2326, 0.0743, 0.5895]
[train epoch 9/100] | loss 1.1308 | nw acc 0.509 | time 3 min 10 sec
cat 0: [348, 66, 86, 76] and [0.6042, 0.1146, 0.1493, 0.1319]
cat 1: [314, 1202, 339, 501] and [0.1333, 0.5102, 0.1439, 0.2126]
cat 2: [5, 21, 48, 18] and [0.0543, 0.2283, 0.5217, 0.1957]
cat 3: [508, 1252, 492, 2280] and [0.1121, 0.2763, 0.1086, 0.5031]
[test epoch 9/100] | loss 0.276 | nw acc 0.543 | time 0 min 42 sec
cat 0: [125, 40, 35, 34] and [0.5342, 0.1709, 0.1496, 0.1453]
cat 1: [89, 403, 136, 172] and [0.1113, 0.5038, 0.17, 0.215]
cat 2: [0, 0, 3, 2] and [0.0, 0.0, 0.6, 0.4]
cat 3: [80, 193, 67, 511] and [0.094, 0.2268, 0.0787, 0.6005]
[train epoch 10/100] | loss 1.1186 | nw acc 0.52 | time 2 min 53 sec
cat 0: [392, 68, 85, 79] and [0.6282, 0.109, 0.1362, 0.1266]
cat 1: [274, 1266, 364, 530] and [0.1126, 0.5201, 0.1495, 0.2177]
cat 2: [19, 19, 48, 9] and [0.2, 0.2, 0.5053, 0.0947]
cat 3: [490, 1188, 468, 2257] and [0.1113, 0.2698, 0.1063, 0.5126]
[test epoch 10/100] | loss 0.27 | nw acc 0.555 | time 0 min 48 sec
cat 0: [151, 57, 39, 38] and [0.5298, 0.2, 0.1368, 0.1333]
cat 1: [69, 386, 128, 158] and [0.0931, 0.5209, 0.1727, 0.2132]
cat 2: [0, 0, 10, 4] and [0.0, 0.0, 0.7143, 0.2857]
cat 3: [74, 193, 64, 519] and [0.0871, 0.2271, 0.0753, 0.6106]
[train epoch 11/100] | loss 1.1003 | nw acc 0.528 | time 3 min 10 sec
cat 0: [430, 82, 82, 81] and [0.637, 0.1215, 0.1215, 0.12]
cat 1: [304, 1271, 381, 526] and [0.1225, 0.5121, 0.1535, 0.2119]
cat 2: [6, 16, 62, 13] and [0.0619, 0.1649, 0.6392, 0.134]
cat 3: [435, 1172, 440, 2255] and [0.1011, 0.2724, 0.1023, 0.5242]
[test epoch 11/100] | loss 0.261 | nw acc 0.574 | time 0 min 46 sec
cat 0: [149, 32, 24, 19] and [0.6652, 0.1429, 0.1071, 0.0848]
cat 1: [75, 381, 120, 128] and [0.1065, 0.5412, 0.1705, 0.1818]
cat 2: [0, 0, 5, 5] and [0.0, 0.0, 0.5, 0.5]
cat 3: [70, 223, 92, 567] and [0.0735, 0.2342, 0.0966, 0.5956]
[train epoch 12/100] | loss 1.0946 | nw acc 0.53 | time 3 min 13 sec
cat 0: [445, 79, 83, 71] and [0.6563, 0.1165, 0.1224, 0.1047]
cat 1: [276, 1247, 370, 524] and [0.1142, 0.5159, 0.1531, 0.2168]
cat 2: [13, 27, 78, 13] and [0.0992, 0.2061, 0.5954, 0.0992]
cat 3: [441, 1188, 434, 2267] and [0.1018, 0.2744, 0.1002, 0.5236]
[test epoch 12/100] | loss 0.26 | nw acc 0.576 | time 0 min 47 sec
cat 0: [160, 40, 32, 27] and [0.6178, 0.1544, 0.1236, 0.1042]
cat 1: [77, 403, 122, 154] and [0.1019, 0.5331, 0.1614, 0.2037]
cat 2: [0, 0, 9, 5] and [0.0, 0.0, 0.6429, 0.3571]
cat 3: [57, 193, 78, 533] and [0.0662, 0.2242, 0.0906, 0.619]
[train epoch 13/100] | loss 1.0759 | nw acc 0.545 | time 3 min 10 sec
cat 0: [462, 80, 75, 68] and [0.6745, 0.1168, 0.1095, 0.0993]
cat 1: [270, 1351, 381, 532] and [0.1066, 0.5331, 0.1504, 0.2099]
cat 2: [8, 16, 69, 10] and [0.0777, 0.1553, 0.6699, 0.0971]
cat 3: [435, 1094, 440, 2265] and [0.1027, 0.2584, 0.1039, 0.535]
[test epoch 13/100] | loss 0.257 | nw acc 0.579 | time 0 min 42 sec
cat 0: [154, 35, 29, 26] and [0.6311, 0.1434, 0.1189, 0.1066]
cat 1: [81, 409, 129, 157] and [0.1044, 0.5271, 0.1662, 0.2023]
cat 2: [0, 2, 18, 5] and [0.0, 0.08, 0.72, 0.2]
cat 3: [59, 190, 65, 531] and [0.0698, 0.2249, 0.0769, 0.6284]
[train epoch 14/100] | loss 1.0814 | nw acc 0.532 | time 2 min 56 sec
cat 0: [434, 81, 77, 63] and [0.6626, 0.1237, 0.1176, 0.0962]
cat 1: [288, 1253, 360, 500] and [0.12, 0.5219, 0.1499, 0.2082]
cat 2: [4, 23, 65, 9] and [0.0396, 0.2277, 0.6436, 0.0891]
cat 3: [449, 1184, 463, 2303] and [0.1021, 0.2692, 0.1053, 0.5235]
[test epoch 14/100] | loss 0.254 | nw acc 0.585 | time 0 min 49 sec
cat 0: [154, 38, 24, 19] and [0.6553, 0.1617, 0.1021, 0.0809]
cat 1: [75, 371, 113, 111] and [0.1119, 0.5537, 0.1687, 0.1657]
cat 2: [0, 0, 12, 2] and [0.0, 0.0, 0.8571, 0.1429]
cat 3: [65, 227, 92, 587] and [0.0669, 0.2338, 0.0947, 0.6045]
[train epoch 15/100] | loss 1.0651 | nw acc 0.543 | time 3 min 14 sec
cat 0: [489, 77, 76, 76] and [0.6811, 0.1072, 0.1058, 0.1058]
cat 1: [283, 1279, 362, 481] and [0.1177, 0.5318, 0.1505, 0.2]
cat 2: [7, 20, 67, 16] and [0.0636, 0.1818, 0.6091, 0.1455]
cat 3: [396, 1165, 460, 2302] and [0.0916, 0.2695, 0.1064, 0.5325]
[test epoch 15/100] | loss 0.256 | nw acc 0.582 | time 0 min 49 sec
cat 0: [171, 41, 29, 27] and [0.6381, 0.153, 0.1082, 0.1007]
cat 1: [74, 433, 135, 187] and [0.0893, 0.5223, 0.1628, 0.2256]
cat 2: [0, 1, 15, 6] and [0.0, 0.0455, 0.6818, 0.2727]
cat 3: [49, 161, 62, 499] and [0.0636, 0.2088, 0.0804, 0.6472]
[train epoch 16/100] | loss 1.0502 | nw acc 0.561 | time 3 min 11 sec
cat 0: [515, 76, 80, 64] and [0.7007, 0.1034, 0.1088, 0.0871]
cat 1: [269, 1333, 360, 477] and [0.1103, 0.5465, 0.1476, 0.1956]
cat 2: [11, 36, 106, 17] and [0.0647, 0.2118, 0.6235, 0.1]
cat 3: [380, 1096, 419, 2317] and [0.0902, 0.2602, 0.0995, 0.5501]
[test epoch 16/100] | loss 0.254 | nw acc 0.586 | time 0 min 44 sec
cat 0: [193, 45, 28, 34] and [0.6433, 0.15, 0.0933, 0.1133]
cat 1: [71, 434, 132, 204] and [0.0844, 0.5161, 0.157, 0.2426]
cat 2: [1, 4, 26, 9] and [0.025, 0.1, 0.65, 0.225]
cat 3: [29, 153, 55, 472] and [0.0409, 0.2158, 0.0776, 0.6657]
[train epoch 17/100] | loss 1.0534 | nw acc 0.553 | time 2 min 52 sec
cat 0: [503, 85, 68, 55] and [0.7075, 0.1195, 0.0956, 0.0774]
cat 1: [252, 1331, 370, 508] and [0.1024, 0.5408, 0.1503, 0.2064]
cat 2: [7, 19, 76, 12] and [0.0614, 0.1667, 0.6667, 0.1053]
cat 3: [413, 1106, 451, 2300] and [0.0967, 0.259, 0.1056, 0.5386]
[test epoch 17/100] | loss 0.255 | nw acc 0.58 | time 0 min 47 sec
cat 0: [170, 47, 28, 26] and [0.6273, 0.1734, 0.1033, 0.0959]
cat 1: [79, 418, 128, 184] and [0.0977, 0.5167, 0.1582, 0.2274]
cat 2: [1, 5, 27, 11] and [0.0227, 0.1136, 0.6136, 0.25]
cat 3: [44, 166, 58, 498] and [0.0574, 0.2167, 0.0757, 0.6501]
[train epoch 18/100] | loss 1.0582 | nw acc 0.554 | time 3 min 13 sec
cat 0: [522, 95, 75, 73] and [0.6824, 0.1242, 0.098, 0.0954]
cat 1: [247, 1299, 372, 476] and [0.1032, 0.5426, 0.1554, 0.1988]
cat 2: [14, 33, 90, 17] and [0.0909, 0.2143, 0.5844, 0.1104]
cat 3: [392, 1114, 428, 2309] and [0.0924, 0.2626, 0.1009, 0.5442]
[test epoch 18/100] | loss 0.249 | nw acc 0.603 | time 0 min 48 sec
cat 0: [182, 48, 29, 26] and [0.6386, 0.1684, 0.1018, 0.0912]
cat 1: [69, 402, 116, 142] and [0.0947, 0.5514, 0.1591, 0.1948]
cat 2: [1, 4, 30, 8] and [0.0233, 0.093, 0.6977, 0.186]
cat 3: [42, 182, 66, 543] and [0.0504, 0.2185, 0.0792, 0.6519]
[train epoch 19/100] | loss 1.0437 | nw acc 0.556 | time 3 min 11 sec
cat 0: [531, 82, 65, 54] and [0.7254, 0.112, 0.0888, 0.0738]
cat 1: [234, 1286, 366, 472] and [0.0992, 0.5454, 0.1552, 0.2002]
cat 2: [4, 21, 94, 22] and [0.0284, 0.1489, 0.6667, 0.156]
cat 3: [406, 1152, 440, 2327] and [0.0939, 0.2664, 0.1017, 0.538]
[test epoch 19/100] | loss 0.251 | nw acc 0.593 | time 0 min 46 sec
cat 0: [188, 58, 31, 34] and [0.6045, 0.1865, 0.0997, 0.1093]
cat 1: [71, 396, 120, 145] and [0.097, 0.541, 0.1639, 0.1981]
cat 2: [0, 3, 22, 7] and [0.0, 0.0938, 0.6875, 0.2188]
cat 3: [35, 179, 68, 533] and [0.0429, 0.2196, 0.0834, 0.654]
[train epoch 20/100] | loss 1.0417 | nw acc 0.556 | time 3 min 13 sec
cat 0: [514, 88, 71, 62] and [0.6993, 0.1197, 0.0966, 0.0844]
cat 1: [257, 1268, 351, 443] and [0.1108, 0.5468, 0.1514, 0.191]
cat 2: [6, 20, 100, 17] and [0.042, 0.1399, 0.6993, 0.1189]
cat 3: [398, 1165, 443, 2353] and [0.0913, 0.2673, 0.1016, 0.5398]
[test epoch 20/100] | loss 0.247 | nw acc 0.601 | time 0 min 46 sec
cat 0: [185, 48, 30, 31] and [0.6293, 0.1633, 0.102, 0.1054]
cat 1: [68, 402, 120, 136] and [0.0937, 0.5537, 0.1653, 0.1873]
cat 2: [0, 4, 23, 8] and [0.0, 0.1143, 0.6571, 0.2286]
cat 3: [41, 182, 68, 544] and [0.0491, 0.218, 0.0814, 0.6515]
[train epoch 21/100] | loss 1.0299 | nw acc 0.569 | time 2 min 53 sec
cat 0: [565, 71, 77, 62] and [0.729, 0.0916, 0.0994, 0.08]
cat 1: [234, 1342, 355, 471] and [0.0974, 0.5587, 0.1478, 0.1961]
cat 2: [14, 32, 101, 14] and [0.087, 0.1988, 0.6273, 0.087]
cat 3: [362, 1096, 432, 2328] and [0.0858, 0.2598, 0.1024, 0.5519]
[test epoch 21/100] | loss 0.245 | nw acc 0.605 | time 0 min 47 sec
cat 0: [180, 39, 23, 17] and [0.695, 0.1506, 0.0888, 0.0656]
cat 1: [61, 359, 103, 103] and [0.0974, 0.5735, 0.1645, 0.1645]
cat 2: [0, 12, 34, 11] and [0.0, 0.2105, 0.5965, 0.193]
cat 3: [53, 226, 81, 588] and [0.0559, 0.2384, 0.0854, 0.6203]
[train epoch 22/100] | loss 1.0324 | nw acc 0.567 | time 3 min 12 sec
cat 0: [542, 78, 73, 57] and [0.7227, 0.104, 0.0973, 0.076]
cat 1: [235, 1324, 339, 469] and [0.0993, 0.5594, 0.1432, 0.1981]
cat 2: [5, 31, 124, 21] and [0.0276, 0.1713, 0.6851, 0.116]
cat 3: [393, 1108, 429, 2328] and [0.0923, 0.2602, 0.1008, 0.5467]
[test epoch 22/100] | loss 0.243 | nw acc 0.611 | time 0 min 48 sec
cat 0: [187, 38, 24, 22] and [0.69, 0.1402, 0.0886, 0.0812]
cat 1: [74, 417, 120, 140] and [0.0985, 0.5553, 0.1598, 0.1864]
cat 2: [0, 2, 21, 9] and [0.0, 0.0625, 0.6562, 0.2812]
cat 3: [33, 179, 76, 548] and [0.0395, 0.2141, 0.0909, 0.6555]
[train epoch 23/100] | loss 1.0292 | nw acc 0.569 | time 3 min 13 sec
cat 0: [553, 91, 67, 53] and [0.7238, 0.1191, 0.0877, 0.0694]
cat 1: [242, 1339, 337, 474] and [0.1012, 0.5598, 0.1409, 0.1982]
cat 2: [9, 21, 110, 15] and [0.0581, 0.1355, 0.7097, 0.0968]
cat 3: [371, 1090, 451, 2333] and [0.0874, 0.2568, 0.1062, 0.5496]
[test epoch 23/100] | loss 0.25 | nw acc 0.595 | time 0 min 47 sec
cat 0: [194, 52, 27, 28] and [0.6445, 0.1728, 0.0897, 0.093]
cat 1: [68, 423, 133, 178] and [0.0848, 0.5274, 0.1658, 0.2219]
cat 2: [0, 2, 23, 11] and [0.0, 0.0556, 0.6389, 0.3056]
cat 3: [32, 159, 58, 502] and [0.0426, 0.2117, 0.0772, 0.6684]
[train epoch 24/100] | loss 1.0161 | nw acc 0.58 | time 3 min 3 sec
cat 0: [581, 72, 56, 59] and [0.7565, 0.0938, 0.0729, 0.0768]
cat 1: [236, 1368, 336, 446] and [0.0989, 0.5733, 0.1408, 0.1869]
cat 2: [8, 27, 118, 20] and [0.0462, 0.1561, 0.6821, 0.1156]
cat 3: [350, 1074, 455, 2350] and [0.0828, 0.254, 0.1076, 0.5557]
[test epoch 24/100] | loss 0.25 | nw acc 0.588 | time 0 min 43 sec
cat 0: [175, 39, 19, 23] and [0.6836, 0.1523, 0.0742, 0.0898]
cat 1: [91, 451, 142, 209] and [0.1019, 0.505, 0.159, 0.234]
cat 2: [0, 3, 22, 7] and [0.0, 0.0938, 0.6875, 0.2188]
cat 3: [28, 143, 58, 480] and [0.0395, 0.2017, 0.0818, 0.677]
[train epoch 25/100] | loss 1.0123 | nw acc 0.578 | time 2 min 51 sec
cat 0: [586, 71, 66, 61] and [0.7474, 0.0906, 0.0842, 0.0778]
cat 1: [248, 1378, 375, 469] and [0.1004, 0.5579, 0.1518, 0.1899]
cat 2: [6, 21, 109, 16] and [0.0395, 0.1382, 0.7171, 0.1053]
cat 3: [335, 1071, 415, 2329] and [0.0807, 0.2581, 0.1, 0.5612]
[test epoch 25/100] | loss 0.245 | nw acc 0.597 | time 0 min 47 sec
cat 0: [194, 52, 30, 32] and [0.6299, 0.1688, 0.0974, 0.1039]
cat 1: [68, 418, 122, 167] and [0.0877, 0.5394, 0.1574, 0.2155]
cat 2: [0, 2, 24, 10] and [0.0, 0.0556, 0.6667, 0.2778]
cat 3: [32, 164, 65, 510] and [0.0415, 0.2127, 0.0843, 0.6615]
[train epoch 26/100] | loss 1.02 | nw acc 0.576 | time 3 min 9 sec
cat 0: [567, 94, 63, 54] and [0.7288, 0.1208, 0.081, 0.0694]
cat 1: [239, 1358, 361, 465] and [0.0986, 0.5605, 0.149, 0.1919]
cat 2: [10, 24, 123, 19] and [0.0568, 0.1364, 0.6989, 0.108]
cat 3: [359, 1065, 418, 2337] and [0.0859, 0.2548, 0.1, 0.5592]
[test epoch 26/100] | loss 0.247 | nw acc 0.593 | time 0 min 43 sec
cat 0: [213, 75, 39, 41] and [0.5788, 0.2038, 0.106, 0.1114]
cat 1: [57, 397, 120, 162] and [0.0774, 0.5394, 0.163, 0.2201]
cat 2: [0, 3, 22, 9] and [0.0, 0.0882, 0.6471, 0.2647]
cat 3: [24, 161, 60, 507] and [0.0319, 0.2141, 0.0798, 0.6742]
[train epoch 27/100] | loss 1.0155 | nw acc 0.573 | time 2 min 59 sec
cat 0: [577, 86, 79, 66] and [0.7141, 0.1064, 0.0978, 0.0817]
cat 1: [226, 1365, 352, 480] and [0.0933, 0.5634, 0.1453, 0.1981]
cat 2: [7, 24, 107, 16] and [0.0455, 0.1558, 0.6948, 0.1039]
cat 3: [365, 1066, 427, 2313] and [0.0875, 0.2556, 0.1024, 0.5545]
[test epoch 27/100] | loss 0.241 | nw acc 0.608 | time 0 min 48 sec
cat 0: [184, 35, 17, 17] and [0.7273, 0.1383, 0.0672, 0.0672]
cat 1: [80, 427, 129, 164] and [0.1, 0.5337, 0.1613, 0.205]
cat 2: [0, 2, 28, 9] and [0.0, 0.0513, 0.7179, 0.2308]
cat 3: [30, 172, 67, 529] and [0.0376, 0.2155, 0.084, 0.6629]
[train epoch 28/100] | loss 1.012 | nw acc 0.575 | time 3 min 14 sec
cat 0: [588, 76, 58, 62] and [0.75, 0.0969, 0.074, 0.0791]
cat 1: [257, 1391, 375, 515] and [0.1013, 0.5481, 0.1478, 0.2029]
cat 2: [6, 25, 123, 21] and [0.0343, 0.1429, 0.7029, 0.12]
cat 3: [324, 1049, 409, 2277] and [0.0798, 0.2584, 0.1008, 0.561]
[test epoch 28/100] | loss 0.239 | nw acc 0.614 | time 0 min 48 sec
cat 0: [187, 26, 17, 17] and [0.7571, 0.1053, 0.0688, 0.0688]
cat 1: [83, 448, 138, 175] and [0.0983, 0.5308, 0.1635, 0.2073]
cat 2: [0, 3, 25, 8] and [0.0, 0.0833, 0.6944, 0.2222]
cat 3: [24, 159, 61, 519] and [0.0315, 0.2084, 0.0799, 0.6802]
[train epoch 29/100] | loss 1.0128 | nw acc 0.578 | time 3 min 7 sec
cat 0: [577, 84, 70, 57] and [0.7322, 0.1066, 0.0888, 0.0723]
cat 1: [247, 1397, 354, 479] and [0.0997, 0.564, 0.1429, 0.1934]
cat 2: [3, 30, 110, 22] and [0.0182, 0.1818, 0.6667, 0.1333]
cat 3: [348, 1030, 431, 2317] and [0.0843, 0.2496, 0.1045, 0.5616]
[test epoch 29/100] | loss 0.246 | nw acc 0.602 | time 0 min 43 sec
cat 0: [215, 58, 32, 39] and [0.625, 0.1686, 0.093, 0.1134]
cat 1: [58, 445, 129, 198] and [0.0699, 0.5361, 0.1554, 0.2386]
cat 2: [0, 2, 22, 9] and [0.0, 0.0606, 0.6667, 0.2727]
cat 3: [21, 131, 58, 473] and [0.0307, 0.1918, 0.0849, 0.6925]
[train epoch 30/100] | loss 1.0008 | nw acc 0.581 | time 2 min 54 sec
cat 0: [604, 83, 71, 65] and [0.7339, 0.1009, 0.0863, 0.079]
cat 1: [233, 1377, 358, 471] and [0.0955, 0.5646, 0.1468, 0.1931]
cat 2: [5, 27, 130, 25] and [0.0267, 0.1444, 0.6952, 0.1337]
cat 3: [333, 1054, 406, 2314] and [0.0811, 0.2566, 0.0989, 0.5634]
[test epoch 30/100] | loss 0.246 | nw acc 0.596 | time 0 min 46 sec
cat 0: [211, 88, 42, 48] and [0.5424, 0.2262, 0.108, 0.1234]
cat 1: [51, 381, 104, 136] and [0.0759, 0.567, 0.1548, 0.2024]
cat 2: [0, 6, 30, 12] and [0.0, 0.125, 0.625, 0.25]
cat 3: [32, 161, 65, 523] and [0.041, 0.2061, 0.0832, 0.6697]
[train epoch 31/100] | loss 0.99974 | nw acc 0.585 | time 3 min 11 sec
cat 0: [608, 79, 71, 57] and [0.746, 0.0969, 0.0871, 0.0699]
cat 1: [217, 1387, 376, 454] and [0.0892, 0.5698, 0.1545, 0.1865]
cat 2: [8, 25, 123, 27] and [0.0437, 0.1366, 0.6721, 0.1475]
cat 3: [342, 1050, 395, 2337] and [0.0829, 0.2546, 0.0958, 0.5667]
[test epoch 31/100] | loss 0.244 | nw acc 0.601 | time 0 min 42 sec
cat 0: [207, 48, 27, 37] and [0.6489, 0.1505, 0.0846, 0.116]
cat 1: [70, 458, 138, 209] and [0.08, 0.5234, 0.1577, 0.2389]
cat 2: [0, 1, 23, 7] and [0.0, 0.0323, 0.7419, 0.2258]
cat 3: [17, 129, 53, 466] and [0.0256, 0.194, 0.0797, 0.7008]
[train epoch 32/100] | loss 1.0012 | nw acc 0.586 | time 2 min 49 sec
cat 0: [615, 69, 61, 53] and [0.7707, 0.0865, 0.0764, 0.0664]
cat 1: [224, 1396, 362, 472] and [0.0913, 0.5689, 0.1475, 0.1923]
cat 2: [7, 31, 128, 25] and [0.0366, 0.1623, 0.6702, 0.1309]
cat 3: [329, 1045, 414, 2325] and [0.08, 0.2541, 0.1007, 0.5653]
[test epoch 32/100] | loss 0.242 | nw acc 0.599 | time 0 min 42 sec
cat 0: [216, 78, 33, 43] and [0.5838, 0.2108, 0.0892, 0.1162]
cat 1: [54, 392, 120, 149] and [0.0755, 0.5483, 0.1678, 0.2084]
cat 2: [0, 6, 27, 11] and [0.0, 0.1364, 0.6136, 0.25]
cat 3: [24, 160, 61, 516] and [0.0315, 0.2102, 0.0802, 0.6781]
[train epoch 33/100] | loss 0.99695 | nw acc 0.585 | time 2 min 49 sec
cat 0: [600, 76, 74, 67] and [0.7344, 0.093, 0.0906, 0.082]
cat 1: [217, 1407, 366, 464] and [0.0884, 0.5733, 0.1491, 0.1891]
cat 2: [8, 31, 129, 24] and [0.0417, 0.1615, 0.6719, 0.125]
cat 3: [350, 1027, 396, 2320] and [0.0855, 0.2509, 0.0968, 0.5668]
[test epoch 33/100] | loss 0.238 | nw acc 0.619 | time 0 min 44 sec
cat 0: [199, 33, 22, 22] and [0.721, 0.1196, 0.0797, 0.0797]
cat 1: [71, 453, 128, 185] and [0.0848, 0.5412, 0.1529, 0.221]
cat 2: [0, 5, 34, 10] and [0.0, 0.102, 0.6939, 0.2041]
cat 3: [24, 145, 57, 502] and [0.033, 0.1992, 0.0783, 0.6896]
[train epoch 34/100] | loss 0.99714 | nw acc 0.582 | time 2 min 56 sec
cat 0: [627, 82, 69, 62] and [0.7464, 0.0976, 0.0821, 0.0738]
cat 1: [204, 1368, 344, 477] and [0.0852, 0.5717, 0.1438, 0.1993]
cat 2: [5, 32, 133, 33] and [0.0246, 0.1576, 0.6552, 0.1626]
cat 3: [339, 1059, 419, 2303] and [0.0823, 0.257, 0.1017, 0.559]
[test epoch 34/100] | loss 0.236 | nw acc 0.631 | time 0 min 44 sec
cat 0: [220, 48, 21, 28] and [0.694, 0.1514, 0.0662, 0.0883]
cat 1: [52, 424, 115, 153] and [0.0699, 0.5699, 0.1546, 0.2056]
cat 2: [0, 9, 42, 13] and [0.0, 0.1406, 0.6562, 0.2031]
cat 3: [22, 155, 63, 525] and [0.0288, 0.2026, 0.0824, 0.6863]
[train epoch 35/100] | loss 0.99061 | nw acc 0.587 | time 2 min 56 sec
cat 0: [637, 82, 67, 52] and [0.7601, 0.0979, 0.08, 0.0621]
cat 1: [203, 1399, 361, 473] and [0.0833, 0.5743, 0.1482, 0.1942]
cat 2: [6, 27, 107, 22] and [0.037, 0.1667, 0.6605, 0.1358]
cat 3: [329, 1033, 430, 2328] and [0.0799, 0.2507, 0.1044, 0.565]
[test epoch 35/100] | loss 0.239 | nw acc 0.619 | time 0 min 41 sec
cat 0: [220, 75, 26, 35] and [0.618, 0.2107, 0.073, 0.0983]
cat 1: [40, 379, 104, 119] and [0.0623, 0.5903, 0.162, 0.1854]
cat 2: [0, 6, 37, 13] and [0.0, 0.1071, 0.6607, 0.2321]
cat 3: [34, 176, 74, 552] and [0.0407, 0.2105, 0.0885, 0.6603]
[train epoch 36/100] | loss 0.98989 | nw acc 0.586 | time 2 min 58 sec
cat 0: [614, 83, 66, 54] and [0.7515, 0.1016, 0.0808, 0.0661]
cat 1: [229, 1395, 358, 475] and [0.0932, 0.5678, 0.1457, 0.1933]
cat 2: [3, 21, 128, 21] and [0.0173, 0.1214, 0.7399, 0.1214]
cat 3: [329, 1042, 413, 2325] and [0.0801, 0.2536, 0.1005, 0.5658]
[test epoch 36/100] | loss 0.24 | nw acc 0.617 | time 0 min 42 sec
cat 0: [226, 75, 26, 39] and [0.6175, 0.2049, 0.071, 0.1066]
cat 1: [45, 370, 105, 116] and [0.0708, 0.5818, 0.1651, 0.1824]
cat 2: [0, 5, 34, 10] and [0.0, 0.102, 0.6939, 0.2041]
cat 3: [23, 186, 76, 554] and [0.0274, 0.2217, 0.0906, 0.6603]
[train epoch 37/100] | loss 0.99581 | nw acc 0.587 | time 2 min 54 sec
cat 0: [619, 103, 72, 88] and [0.7018, 0.1168, 0.0816, 0.0998]
cat 1: [214, 1416, 376, 459] and [0.0868, 0.5744, 0.1525, 0.1862]
cat 2: [5, 24, 131, 22] and [0.0275, 0.1319, 0.7198, 0.1209]
cat 3: [337, 998, 386, 2306] and [0.0837, 0.2478, 0.0959, 0.5726]
[test epoch 37/100] | loss 0.239 | nw acc 0.607 | time 0 min 44 sec
cat 0: [213, 56, 23, 30] and [0.6615, 0.1739, 0.0714, 0.0932]
cat 1: [59, 426, 128, 185] and [0.0739, 0.5338, 0.1604, 0.2318]
cat 2: [0, 4, 32, 9] and [0.0, 0.0889, 0.7111, 0.2]
cat 3: [22, 150, 58, 495] and [0.0303, 0.2069, 0.08, 0.6828]
[train epoch 38/100] | loss 0.99144 | nw acc 0.59 | time 2 min 49 sec
cat 0: [609, 67, 66, 46] and [0.7728, 0.085, 0.0838, 0.0584]
cat 1: [254, 1513, 408, 549] and [0.0932, 0.5554, 0.1498, 0.2015]
cat 2: [6, 36, 115, 23] and [0.0333, 0.2, 0.6389, 0.1278]
cat 3: [306, 925, 376, 2257] and [0.0792, 0.2394, 0.0973, 0.5841]
[test epoch 38/100] | loss 0.238 | nw acc 0.615 | time 0 min 43 sec
cat 0: [213, 52, 21, 24] and [0.6871, 0.1677, 0.0677, 0.0774]
cat 1: [58, 411, 132, 152] and [0.077, 0.5458, 0.1753, 0.2019]
cat 2: [0, 1, 20, 6] and [0.0, 0.037, 0.7407, 0.2222]
cat 3: [23, 172, 68, 537] and [0.0288, 0.215, 0.085, 0.6713]
[train epoch 39/100] | loss 0.99158 | nw acc 0.585 | time 3 min 0 sec
cat 0: [598, 81, 69, 53] and [0.7466, 0.1011, 0.0861, 0.0662]
cat 1: [245, 1500, 422, 560] and [0.0898, 0.5501, 0.1547, 0.2054]
cat 2: [5, 28, 113, 20] and [0.0301, 0.1687, 0.6807, 0.1205]
cat 3: [327, 932, 361, 2242] and [0.0847, 0.2413, 0.0935, 0.5805]
[test epoch 39/100] | loss 0.235 | nw acc 0.623 | time 0 min 49 sec
cat 0: [203, 35, 16, 22] and [0.7355, 0.1268, 0.058, 0.0797]
cat 1: [71, 429, 126, 164] and [0.0899, 0.543, 0.1595, 0.2076]
cat 2: [0, 9, 41, 10] and [0.0, 0.15, 0.6833, 0.1667]
cat 3: [20, 163, 58, 523] and [0.0262, 0.2134, 0.0759, 0.6846]
[train epoch 40/100] | loss 0.98606 | nw acc 0.588 | time 3 min 10 sec
cat 0: [622, 77, 55, 54] and [0.7698, 0.0953, 0.0681, 0.0668]
cat 1: [226, 1410, 393, 467] and [0.0905, 0.5649, 0.1575, 0.1871]
cat 2: [6, 29, 119, 23] and [0.0339, 0.1638, 0.6723, 0.1299]
cat 3: [321, 1025, 398, 2331] and [0.0788, 0.2515, 0.0977, 0.572]
[test epoch 40/100] | loss 0.236 | nw acc 0.621 | time 0 min 45 sec
cat 0: [216, 62, 22, 31] and [0.6526, 0.1873, 0.0665, 0.0937]
cat 1: [47, 392, 111, 129] and [0.0692, 0.5773, 0.1635, 0.19]
cat 2: [0, 3, 34, 9] and [0.0, 0.0652, 0.7391, 0.1957]
cat 3: [31, 179, 74, 550] and [0.0372, 0.2146, 0.0887, 0.6595]
[train epoch 41/100] | loss 0.9895 | nw acc 0.59 | time 2 min 53 sec
cat 0: [657, 91, 62, 50] and [0.764, 0.1058, 0.0721, 0.0581]
cat 1: [191, 1398, 392, 478] and [0.0777, 0.5685, 0.1594, 0.1944]
cat 2: [2, 27, 116, 28] and [0.0116, 0.1561, 0.6705, 0.1618]
cat 3: [325, 1025, 395, 2319] and [0.08, 0.2522, 0.0972, 0.5706]
[test epoch 41/100] | loss 0.242 | nw acc 0.596 | time 0 min 50 sec
cat 0: [226, 95, 41, 53] and [0.5446, 0.2289, 0.0988, 0.1277]
cat 1: [44, 379, 109, 150] and [0.0645, 0.5557, 0.1598, 0.2199]
cat 2: [0, 1, 30, 6] and [0.0, 0.027, 0.8108, 0.1622]
cat 3: [24, 161, 61, 510] and [0.0317, 0.213, 0.0807, 0.6746]
[train epoch 42/100] | loss 0.98191 | nw acc 0.594 | time 3 min 11 sec
cat 0: [639, 81, 64, 58] and [0.7589, 0.0962, 0.076, 0.0689]
cat 1: [201, 1425, 360, 466] and [0.082, 0.5812, 0.1468, 0.19]
cat 2: [5, 29, 133, 24] and [0.0262, 0.1518, 0.6963, 0.1257]
cat 3: [330, 1006, 408, 2327] and [0.0811, 0.2471, 0.1002, 0.5716]
[test epoch 42/100] | loss 0.236 | nw acc 0.624 | time 0 min 46 sec
cat 0: [223, 58, 20, 37] and [0.6598, 0.1716, 0.0592, 0.1095]
cat 1: [47, 413, 115, 153] and [0.0646, 0.5673, 0.158, 0.2102]
cat 2: [0, 6, 45, 12] and [0.0, 0.0952, 0.7143, 0.1905]
cat 3: [24, 159, 61, 517] and [0.0315, 0.2089, 0.0802, 0.6794]
[train epoch 43/100] | loss 0.96867 | nw acc 0.602 | time 2 min 58 sec
cat 0: [646, 82, 66, 55] and [0.7609, 0.0966, 0.0777, 0.0648]
cat 1: [218, 1495, 373, 496] and [0.0844, 0.579, 0.1445, 0.1921]
cat 2: [7, 31, 133, 13] and [0.038, 0.1685, 0.7228, 0.0707]
cat 3: [304, 933, 393, 2311] and [0.0771, 0.2367, 0.0997, 0.5864]
[test epoch 43/100] | loss 0.237 | nw acc 0.614 | time 0 min 43 sec
cat 0: [210, 45, 18, 29] and [0.6954, 0.149, 0.0596, 0.096]
cat 1: [67, 453, 141, 197] and [0.0781, 0.528, 0.1643, 0.2296]
cat 2: [0, 0, 28, 6] and [0.0, 0.0, 0.8235, 0.1765]
cat 3: [17, 138, 54, 487] and [0.0244, 0.1983, 0.0776, 0.6997]
[train epoch 44/100] | loss 0.96805 | nw acc 0.599 | time 2 min 59 sec
cat 0: [651, 75, 61, 51] and [0.7768, 0.0895, 0.0728, 0.0609]
cat 1: [234, 1495, 398, 510] and [0.0887, 0.5669, 0.1509, 0.1934]
cat 2: [2, 15, 119, 20] and [0.0128, 0.0962, 0.7628, 0.1282]
cat 3: [288, 956, 387, 2294] and [0.0734, 0.2436, 0.0986, 0.5845]
[test epoch 44/100] | loss 0.237 | nw acc 0.62 | time 0 min 31 sec
cat 0: [209, 47, 17, 28] and [0.6944, 0.1561, 0.0565, 0.093]
cat 1: [64, 432, 125, 175] and [0.0804, 0.5427, 0.157, 0.2198]
cat 2: [0, 8, 42, 9] and [0.0, 0.1356, 0.7119, 0.1525]
cat 3: [21, 149, 57, 507] and [0.0286, 0.203, 0.0777, 0.6907]
[train epoch 45/100] | loss 0.96096 | nw acc 0.605 | time 2 min 59 sec
cat 0: [654, 77, 64, 56] and [0.7685, 0.0905, 0.0752, 0.0658]
cat 1: [183, 1448, 353, 434] and [0.0757, 0.5988, 0.146, 0.1795]
cat 2: [5, 28, 147, 29] and [0.0239, 0.134, 0.7033, 0.1388]
cat 3: [333, 988, 401, 2356] and [0.0817, 0.2423, 0.0983, 0.5777]
[test epoch 45/100] | loss 0.234 | nw acc 0.622 | time 0 min 45 sec
cat 0: [230, 66, 28, 39] and [0.6336, 0.1818, 0.0771, 0.1074]
cat 1: [39, 391, 113, 125] and [0.0584, 0.5853, 0.1692, 0.1871]
cat 2: [0, 4, 29, 10] and [0.0, 0.093, 0.6744, 0.2326]
cat 3: [25, 175, 71, 545] and [0.0306, 0.2145, 0.087, 0.6679]
[train epoch 46/100] | loss 0.95858 | nw acc 0.606 | time 2 min 53 sec
cat 0: [665, 70, 55, 55] and [0.787, 0.0828, 0.0651, 0.0651]
cat 1: [195, 1441, 381, 450] and [0.079, 0.5841, 0.1544, 0.1824]
cat 2: [7, 32, 152, 16] and [0.0338, 0.1546, 0.7343, 0.0773]
cat 3: [308, 998, 377, 2354] and [0.0763, 0.2472, 0.0934, 0.5831]
[test epoch 46/100] | loss 0.234 | nw acc 0.623 | time 0 min 48 sec
cat 0: [214, 37, 18, 27] and [0.723, 0.125, 0.0608, 0.0912]
cat 1: [63, 454, 126, 195] and [0.0752, 0.5418, 0.1504, 0.2327]
cat 2: [0, 7, 44, 12] and [0.0, 0.1111, 0.6984, 0.1905]
cat 3: [17, 138, 53, 485] and [0.0245, 0.1991, 0.0765, 0.6999]
[train epoch 47/100] | loss 0.96969 | nw acc 0.607 | time 3 min 17 sec
cat 0: [652, 73, 57, 50] and [0.7837, 0.0877, 0.0685, 0.0601]
cat 1: [209, 1486, 365, 458] and [0.083, 0.5902, 0.145, 0.1819]
cat 2: [12, 33, 146, 29] and [0.0545, 0.15, 0.6636, 0.1318]
cat 3: [302, 949, 397, 2338] and [0.0758, 0.2381, 0.0996, 0.5866]
[test epoch 47/100] | loss 0.235 | nw acc 0.627 | time 0 min 47 sec
cat 0: [219, 45, 18, 29] and [0.7042, 0.1447, 0.0579, 0.0932]
cat 1: [52, 446, 130, 178] and [0.0645, 0.5533, 0.1613, 0.2208]
cat 2: [0, 4, 36, 10] and [0.0, 0.08, 0.72, 0.2]
cat 3: [23, 141, 57, 502] and [0.0318, 0.195, 0.0788, 0.6943]
[train epoch 48/100] | loss 0.9706 | nw acc 0.596 | time 3 min 31 sec
cat 0: [669, 86, 57, 63] and [0.7646, 0.0983, 0.0651, 0.072]
cat 1: [194, 1422, 364, 489] and [0.0786, 0.5759, 0.1474, 0.1981]
cat 2: [6, 28, 152, 24] and [0.0286, 0.1333, 0.7238, 0.1143]
cat 3: [306, 1005, 392, 2299] and [0.0765, 0.2511, 0.098, 0.5745]
[test epoch 48/100] | loss 0.236 | nw acc 0.62 | time 0 min 41 sec
cat 0: [220, 54, 23, 38] and [0.6567, 0.1612, 0.0687, 0.1134]
cat 1: [52, 443, 133, 175] and [0.0648, 0.5517, 0.1656, 0.2179]
cat 2: [0, 2, 30, 9] and [0.0, 0.0488, 0.7317, 0.2195]
cat 3: [22, 137, 55, 497] and [0.0309, 0.1927, 0.0774, 0.699]
[train epoch 49/100] | loss 0.9665 | nw acc 0.597 | time 3 min 3 sec
cat 0: [656, 93, 50, 74] and [0.7514, 0.1065, 0.0573, 0.0848]
cat 1: [196, 1432, 372, 472] and [0.0793, 0.5793, 0.1505, 0.1909]
cat 2: [11, 22, 155, 23] and [0.0521, 0.1043, 0.7346, 0.109]
cat 3: [312, 994, 388, 2306] and [0.078, 0.2485, 0.097, 0.5765]
[test epoch 49/100] | loss 0.235 | nw acc 0.615 | time 0 min 42 sec
cat 0: [217, 45, 18, 33] and [0.6933, 0.1438, 0.0575, 0.1054]
cat 1: [58, 448, 134, 191] and [0.0698, 0.5391, 0.1613, 0.2298]
cat 2: [0, 3, 30, 10] and [0.0, 0.0698, 0.6977, 0.2326]
cat 3: [19, 140, 59, 485] and [0.027, 0.1991, 0.0839, 0.6899]
[train epoch 50/100] | loss 0.96694 | nw acc 0.599 | time 2 min 57 sec
cat 0: [668, 85, 67, 57] and [0.7617, 0.0969, 0.0764, 0.065]
cat 1: [173, 1433, 359, 465] and [0.0712, 0.5897, 0.1477, 0.1914]
cat 2: [7, 30, 130, 24] and [0.0366, 0.1571, 0.6806, 0.1257]
cat 3: [327, 993, 409, 2329] and [0.0806, 0.2447, 0.1008, 0.5739]
[test epoch 50/100] | loss 0.236 | nw acc 0.611 | time 0 min 45 sec
cat 0: [228, 64, 22, 41] and [0.6423, 0.1803, 0.062, 0.1155]
cat 1: [47, 428, 135, 180] and [0.0595, 0.5418, 0.1709, 0.2278]
cat 2: [0, 2, 26, 7] and [0.0, 0.0571, 0.7429, 0.2]
cat 3: [19, 142, 58, 491] and [0.0268, 0.2, 0.0817, 0.6915]
[train epoch 51/100] | loss 0.95739 | nw acc 0.605 | time 3 min 3 sec
cat 0: [643, 64, 69, 44] and [0.7841, 0.078, 0.0841, 0.0537]
cat 1: [179, 1432, 339, 432] and [0.0751, 0.6012, 0.1423, 0.1814]
cat 2: [9, 24, 157, 25] and [0.0419, 0.1116, 0.7302, 0.1163]
cat 3: [344, 1021, 400, 2374] and [0.0831, 0.2467, 0.0966, 0.5736]
[test epoch 51/100] | loss 0.231 | nw acc 0.632 | time 0 min 43 sec
cat 0: [216, 49, 20, 30] and [0.6857, 0.1556, 0.0635, 0.0952]
cat 1: [53, 429, 117, 156] and [0.0702, 0.5682, 0.155, 0.2066]
cat 2: [0, 3, 46, 10] and [0.0, 0.0508, 0.7797, 0.1695]
cat 3: [25, 155, 58, 523] and [0.0329, 0.2037, 0.0762, 0.6873]
[train epoch 52/100] | loss 0.96177 | nw acc 0.597 | time 2 min 58 sec
cat 0: [705, 84, 66, 51] and [0.7781, 0.0927, 0.0728, 0.0563]
cat 1: [208, 1424, 380, 545] and [0.0813, 0.5569, 0.1486, 0.2131]
cat 2: [10, 23, 163, 23] and [0.0457, 0.105, 0.7443, 0.105]
cat 3: [252, 1010, 356, 2256] and [0.065, 0.2607, 0.0919, 0.5823]
[test epoch 52/100] | loss 0.229 | nw acc 0.63 | time 0 min 48 sec
cat 0: [220, 53, 19, 30] and [0.6832, 0.1646, 0.059, 0.0932]
cat 1: [50, 407, 112, 144] and [0.0701, 0.5708, 0.1571, 0.202]
cat 2: [0, 4, 46, 8] and [0.0, 0.069, 0.7931, 0.1379]
cat 3: [24, 172, 64, 537] and [0.0301, 0.2158, 0.0803, 0.6738]
[train epoch 53/100] | loss 0.96623 | nw acc 0.603 | time 3 min 11 sec
cat 0: [679, 84, 57, 57] and [0.7742, 0.0958, 0.065, 0.065]
cat 1: [211, 1455, 355, 499] and [0.0837, 0.5774, 0.1409, 0.198]
cat 2: [1, 25, 161, 21] and [0.0048, 0.1202, 0.774, 0.101]
cat 3: [284, 977, 392, 2298] and [0.0719, 0.2473, 0.0992, 0.5816]
[test epoch 53/100] | loss 0.233 | nw acc 0.626 | time 0 min 47 sec
cat 0: [227, 61, 23, 40] and [0.6467, 0.1738, 0.0655, 0.114]
cat 1: [47, 424, 118, 161] and [0.0627, 0.5653, 0.1573, 0.2147]
cat 2: [0, 3, 42, 9] and [0.0, 0.0556, 0.7778, 0.1667]
cat 3: [20, 148, 58, 509] and [0.0272, 0.2014, 0.0789, 0.6925]
[train epoch 54/100] | loss 0.95574 | nw acc 0.611 | time 3 min 0 sec
cat 0: [671, 83, 67, 57] and [0.7642, 0.0945, 0.0763, 0.0649]
cat 1: [174, 1433, 313, 431] and [0.074, 0.6095, 0.1331, 0.1833]
cat 2: [5, 36, 183, 21] and [0.0204, 0.1469, 0.7469, 0.0857]
cat 3: [325, 989, 402, 2366] and [0.0796, 0.2423, 0.0985, 0.5796]
[test epoch 54/100] | loss 0.231 | nw acc 0.63 | time 0 min 46 sec
cat 0: [214, 48, 17, 27] and [0.6993, 0.1569, 0.0556, 0.0882]
cat 1: [59, 430, 120, 158] and [0.0769, 0.5606, 0.1565, 0.206]
cat 2: [0, 2, 40, 8] and [0.0, 0.04, 0.8, 0.16]
cat 3: [21, 156, 64, 526] and [0.0274, 0.2034, 0.0834, 0.6858]
[train epoch 55/100] | loss 0.96089 | nw acc 0.608 | time 3 min 2 sec
cat 0: [647, 69, 66, 46] and [0.7814, 0.0833, 0.0797, 0.0556]
cat 1: [188, 1446, 346, 429] and [0.078, 0.6002, 0.1436, 0.1781]
cat 2: [7, 36, 167, 27] and [0.0295, 0.1519, 0.7046, 0.1139]
cat 3: [333, 990, 386, 2373] and [0.0816, 0.2425, 0.0946, 0.5813]
[test epoch 55/100] | loss 0.235 | nw acc 0.622 | time 0 min 44 sec
cat 0: [238, 80, 26, 45] and [0.6118, 0.2057, 0.0668, 0.1157]
cat 1: [36, 396, 117, 141] and [0.0522, 0.5739, 0.1696, 0.2043]
cat 2: [0, 4, 36, 9] and [0.0, 0.0816, 0.7347, 0.1837]
cat 3: [20, 156, 62, 524] and [0.0262, 0.2047, 0.0814, 0.6877]
[train epoch 56/100] | loss 0.95386 | nw acc 0.605 | time 3 min 15 sec
cat 0: [677, 89, 60, 54] and [0.7693, 0.1011, 0.0682, 0.0614]
cat 1: [174, 1376, 332, 416] and [0.0757, 0.5988, 0.1445, 0.181]
cat 2: [7, 34, 169, 21] and [0.0303, 0.1472, 0.7316, 0.0909]
cat 3: [317, 1042, 404, 2384] and [0.0764, 0.2513, 0.0974, 0.5749]
[test epoch 56/100] | loss 0.233 | nw acc 0.629 | time 0 min 42 sec
cat 0: [217, 38, 14, 25] and [0.7381, 0.1293, 0.0476, 0.085]
cat 1: [58, 469, 129, 205] and [0.0674, 0.5447, 0.1498, 0.2381]
cat 2: [0, 10, 48, 16] and [0.0, 0.1351, 0.6486, 0.2162]
cat 3: [19, 119, 50, 473] and [0.0287, 0.18, 0.0756, 0.7156]
