MaunaNet4Drop(
  (conv1): Conv2d(1, 3, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn1): BatchNorm2d(3, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (drop1): Dropout2d(p=0.2)
  (pool1): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv2): Conv2d(3, 64, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (drop2): Dropout2d(p=0.2)
  (pool2): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv3): Conv2d(64, 128, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn3): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (drop3): Dropout2d(p=0.2)
  (pool3): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv4): Conv2d(128, 256, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn4): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (drop4): Dropout2d(p=0.2)
  (pool4): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (avgpool): AvgPool2d(kernel_size=2, stride=2, padding=0)
  (fc1): Linear(in_features=256, out_features=4, bias=True)
)
[train epoch 1/100] | loss 1.1853 | nw acc 0.444 | time 1 min 39 sec
cat 0: [173, 50, 29, 54] and [0.5654, 0.1634, 0.0948, 0.1765]
cat 1: [650, 1638, 634, 1237] and [0.1563, 0.3938, 0.1524, 0.2974]
cat 2: [10, 36, 32, 47] and [0.08, 0.288, 0.256, 0.376]
cat 3: [342, 817, 270, 1537] and [0.1153, 0.2755, 0.091, 0.5182]
[test epoch 1/100] | loss 0.286 | nw acc 0.404 | time 0 min 32 sec
cat 0: [133, 52, 14, 103] and [0.4404, 0.1722, 0.0464, 0.3411]
cat 1: [160, 572, 225, 545] and [0.1065, 0.3808, 0.1498, 0.3628]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1, 12, 2, 71] and [0.0116, 0.1395, 0.0233, 0.8256]
[train epoch 2/100] | loss 1.0914 | nw acc 0.511 | time 2 min 22 sec
cat 0: [489, 100, 59, 105] and [0.6494, 0.1328, 0.0784, 0.1394]
cat 1: [447, 1657, 585, 1067] and [0.119, 0.4412, 0.1558, 0.2841]
cat 2: [25, 65, 78, 39] and [0.1208, 0.314, 0.3768, 0.1884]
cat 3: [214, 719, 243, 1664] and [0.0754, 0.2532, 0.0856, 0.5859]
[test epoch 2/100] | loss 0.269 | nw acc 0.495 | time 0 min 36 sec
cat 0: [109, 15, 2, 43] and [0.645, 0.0888, 0.0118, 0.2544]
cat 1: [169, 553, 198, 384] and [0.1296, 0.4241, 0.1518, 0.2945]
cat 2: [0, 0, 2, 5] and [0.0, 0.0, 0.2857, 0.7143]
cat 3: [16, 68, 39, 287] and [0.039, 0.1659, 0.0951, 0.7]
[train epoch 3/100] | loss 1.0278 | nw acc 0.568 | time 2 min 46 sec
cat 0: [704, 123, 72, 133] and [0.6822, 0.1192, 0.0698, 0.1289]
cat 1: [269, 1510, 390, 746] and [0.0923, 0.518, 0.1338, 0.2559]
cat 2: [32, 135, 200, 82] and [0.0713, 0.3007, 0.4454, 0.1826]
cat 3: [170, 773, 303, 1914] and [0.0538, 0.2446, 0.0959, 0.6057]
[test epoch 3/100] | loss 0.285 | nw acc 0.504 | time 0 min 44 sec
cat 0: [259, 144, 91, 84] and [0.4481, 0.2491, 0.1574, 0.1453]
cat 1: [2, 83, 23, 30] and [0.0145, 0.6014, 0.1667, 0.2174]
cat 2: [0, 9, 32, 12] and [0.0, 0.1698, 0.6038, 0.2264]
cat 3: [33, 400, 95, 593] and [0.0294, 0.3568, 0.0847, 0.529]
[train epoch 4/100] | loss 0.97046 | nw acc 0.61 | time 2 min 53 sec
cat 0: [778, 133, 77, 115] and [0.7053, 0.1206, 0.0698, 0.1043]
cat 1: [184, 1464, 333, 543] and [0.0729, 0.58, 0.1319, 0.2151]
cat 2: [25, 108, 268, 81] and [0.0519, 0.2241, 0.556, 0.168]
cat 3: [188, 836, 287, 2136] and [0.0545, 0.2425, 0.0833, 0.6197]
[test epoch 4/100] | loss 0.225 | nw acc 0.666 | time 0 min 44 sec
cat 0: [250, 44, 16, 43] and [0.7082, 0.1246, 0.0453, 0.1218]
cat 1: [28, 401, 72, 145] and [0.0433, 0.6207, 0.1115, 0.2245]
cat 2: [3, 28, 123, 27] and [0.0166, 0.1547, 0.6796, 0.1492]
cat 3: [13, 163, 30, 504] and [0.0183, 0.2296, 0.0423, 0.7099]
[train epoch 5/100] | loss 0.92919 | nw acc 0.636 | time 2 min 51 sec
cat 0: [803, 95, 66, 131] and [0.7333, 0.0868, 0.0603, 0.1196]
cat 1: [158, 1520, 305, 467] and [0.0645, 0.6204, 0.1245, 0.1906]
cat 2: [36, 135, 319, 76] and [0.0636, 0.2385, 0.5636, 0.1343]
cat 3: [178, 791, 275, 2201] and [0.0517, 0.2296, 0.0798, 0.6389]
[test epoch 5/100] | loss 0.233 | nw acc 0.651 | time 0 min 44 sec
cat 0: [240, 45, 27, 99] and [0.5839, 0.1095, 0.0657, 0.2409]
cat 1: [48, 513, 112, 196] and [0.0552, 0.5903, 0.1289, 0.2255]
cat 2: [1, 12, 86, 14] and [0.0088, 0.1062, 0.7611, 0.1239]
cat 3: [5, 66, 16, 410] and [0.0101, 0.1328, 0.0322, 0.8249]
[train epoch 6/100] | loss 0.90231 | nw acc 0.656 | time 2 min 52 sec
cat 0: [844, 121, 81, 120] and [0.7238, 0.1038, 0.0695, 0.1029]
cat 1: [165, 1563, 289, 441] and [0.0671, 0.6359, 0.1176, 0.1794]
cat 2: [25, 117, 361, 84] and [0.0426, 0.1993, 0.615, 0.1431]
cat 3: [141, 740, 234, 2230] and [0.0422, 0.2212, 0.07, 0.6667]
[test epoch 6/100] | loss 0.246 | nw acc 0.592 | time 0 min 41 sec
cat 0: [258, 91, 62, 72] and [0.5342, 0.1884, 0.1284, 0.1491]
cat 1: [3, 224, 32, 5] and [0.0114, 0.8485, 0.1212, 0.0189]
cat 2: [0, 1, 14, 1] and [0.0, 0.0625, 0.875, 0.0625]
cat 3: [33, 320, 133, 641] and [0.0293, 0.2839, 0.118, 0.5688]
[train epoch 7/100] | loss 0.86856 | nw acc 0.688 | time 2 min 53 sec
cat 0: [884, 113, 67, 97] and [0.7614, 0.0973, 0.0577, 0.0835]
cat 1: [137, 1672, 264, 441] and [0.0545, 0.6651, 0.105, 0.1754]
cat 2: [19, 116, 417, 74] and [0.0304, 0.1853, 0.6661, 0.1182]
cat 3: [135, 640, 217, 2263] and [0.0415, 0.1966, 0.0667, 0.6952]
[test epoch 7/100] | loss 0.254 | nw acc 0.574 | time 0 min 44 sec
cat 0: [280, 180, 79, 180] and [0.3894, 0.2503, 0.1099, 0.2503]
cat 1: [1, 200, 15, 10] and [0.0044, 0.885, 0.0664, 0.0442]
cat 2: [7, 40, 108, 14] and [0.0414, 0.2367, 0.6391, 0.0828]
cat 3: [6, 216, 39, 515] and [0.0077, 0.2784, 0.0503, 0.6637]
[train epoch 8/100] | loss 0.8323 | nw acc 0.711 | time 2 min 49 sec
cat 0: [907, 82, 67, 91] and [0.7908, 0.0715, 0.0584, 0.0793]
cat 1: [114, 1719, 229, 389] and [0.0465, 0.7013, 0.0934, 0.1587]
cat 2: [23, 108, 474, 80] and [0.0336, 0.1577, 0.692, 0.1168]
cat 3: [131, 632, 195, 2315] and [0.04, 0.1931, 0.0596, 0.7073]
[test epoch 8/100] | loss 0.208 | nw acc 0.729 | time 0 min 44 sec
cat 0: [236, 7, 7, 30] and [0.8429, 0.025, 0.025, 0.1071]
cat 1: [43, 501, 88, 124] and [0.0569, 0.6627, 0.1164, 0.164]
cat 2: [1, 24, 136, 38] and [0.005, 0.1206, 0.6834, 0.191]
cat 3: [14, 104, 10, 527] and [0.0214, 0.1588, 0.0153, 0.8046]
[train epoch 9/100] | loss 0.82276 | nw acc 0.72 | time 2 min 51 sec
cat 0: [928, 96, 69, 120] and [0.765, 0.0791, 0.0569, 0.0989]
cat 1: [122, 1802, 270, 371] and [0.0476, 0.7025, 0.1053, 0.1446]
cat 2: [17, 101, 456, 84] and [0.0258, 0.1535, 0.693, 0.1277]
cat 3: [108, 542, 170, 2300] and [0.0346, 0.1737, 0.0545, 0.7372]
[test epoch 9/100] | loss 0.234 | nw acc 0.659 | time 0 min 41 sec
cat 0: [274, 60, 46, 145] and [0.5219, 0.1143, 0.0876, 0.2762]
cat 1: [15, 535, 62, 184] and [0.0188, 0.6721, 0.0779, 0.2312]
cat 2: [0, 17, 128, 61] and [0.0, 0.0825, 0.6214, 0.2961]
cat 3: [5, 24, 5, 329] and [0.0138, 0.0661, 0.0138, 0.9063]
[train epoch 10/100] | loss 0.79849 | nw acc 0.741 | time 2 min 54 sec
cat 0: [933, 71, 42, 77] and [0.8308, 0.0632, 0.0374, 0.0686]
cat 1: [107, 1881, 230, 377] and [0.0412, 0.7249, 0.0886, 0.1453]
cat 2: [11, 96, 478, 73] and [0.0167, 0.1459, 0.7264, 0.1109]
cat 3: [124, 493, 215, 2348] and [0.039, 0.155, 0.0676, 0.7384]
[test epoch 10/100] | loss 0.173 | nw acc 0.802 | time 0 min 42 sec
cat 0: [276, 19, 16, 40] and [0.7863, 0.0541, 0.0456, 0.114]
cat 1: [8, 514, 53, 60] and [0.0126, 0.8094, 0.0835, 0.0945]
cat 2: [1, 10, 144, 13] and [0.006, 0.0595, 0.8571, 0.0774]
cat 3: [9, 93, 28, 606] and [0.0122, 0.1264, 0.038, 0.8234]
[train epoch 11/100] | loss 0.77697 | nw acc 0.746 | time 2 min 48 sec
cat 0: [923, 65, 58, 89] and [0.8132, 0.0573, 0.0511, 0.0784]
cat 1: [103, 1932, 265, 376] and [0.0385, 0.722, 0.099, 0.1405]
cat 2: [29, 99, 494, 81] and [0.0413, 0.1408, 0.7027, 0.1152]
cat 3: [120, 445, 148, 2329] and [0.0394, 0.1463, 0.0487, 0.7656]
[test epoch 11/100] | loss 0.178 | nw acc 0.79 | time 0 min 47 sec
cat 0: [271, 26, 15, 61] and [0.7265, 0.0697, 0.0402, 0.1635]
cat 1: [15, 538, 30, 94] and [0.0222, 0.7947, 0.0443, 0.1388]
cat 2: [4, 26, 188, 44] and [0.0153, 0.0992, 0.7176, 0.1679]
cat 3: [4, 46, 8, 520] and [0.0069, 0.0796, 0.0138, 0.8997]
[train epoch 12/100] | loss 0.74437 | nw acc 0.772 | time 3 min 6 sec
cat 0: [954, 55, 57, 67] and [0.842, 0.0485, 0.0503, 0.0591]
cat 1: [97, 1997, 230, 327] and [0.0366, 0.7533, 0.0868, 0.1233]
cat 2: [15, 75, 517, 72] and [0.0221, 0.1105, 0.7614, 0.106]
cat 3: [109, 414, 161, 2409] and [0.0352, 0.1339, 0.0521, 0.7789]
[test epoch 12/100] | loss 0.171 | nw acc 0.806 | time 0 min 47 sec
cat 0: [264, 8, 6, 15] and [0.901, 0.0273, 0.0205, 0.0512]
cat 1: [16, 544, 59, 96] and [0.0224, 0.7608, 0.0825, 0.1343]
cat 2: [0, 1, 144, 12] and [0.0, 0.0064, 0.9172, 0.0764]
cat 3: [14, 83, 32, 596] and [0.0193, 0.1145, 0.0441, 0.8221]
[train epoch 13/100] | loss 0.70813 | nw acc 0.793 | time 3 min 10 sec
cat 0: [980, 55, 48, 71] and [0.8492, 0.0477, 0.0416, 0.0615]
cat 1: [81, 2089, 211, 326] and [0.0299, 0.7717, 0.0779, 0.1204]
cat 2: [14, 71, 550, 59] and [0.0202, 0.1023, 0.7925, 0.085]
cat 3: [100, 326, 156, 2419] and [0.0333, 0.1086, 0.052, 0.8061]
[test epoch 13/100] | loss 0.168 | nw acc 0.813 | time 0 min 42 sec
cat 0: [272, 22, 19, 53] and [0.7432, 0.0601, 0.0519, 0.1448]
cat 1: [11, 538, 55, 36] and [0.0172, 0.8406, 0.0859, 0.0563]
cat 2: [1, 11, 133, 12] and [0.0064, 0.0701, 0.8471, 0.0764]
cat 3: [10, 65, 34, 618] and [0.0138, 0.0894, 0.0468, 0.8501]
[train epoch 14/100] | loss 0.71087 | nw acc 0.787 | time 2 min 52 sec
cat 0: [961, 54, 49, 69] and [0.8482, 0.0477, 0.0432, 0.0609]
cat 1: [93, 2060, 211, 317] and [0.0347, 0.7684, 0.0787, 0.1182]
cat 2: [23, 88, 553, 71] and [0.0313, 0.1197, 0.7524, 0.0966]
cat 3: [98, 339, 152, 2418] and [0.0326, 0.1127, 0.0505, 0.8041]
[test epoch 14/100] | loss 0.183 | nw acc 0.765 | time 0 min 45 sec
cat 0: [284, 67, 68, 118] and [0.5289, 0.1248, 0.1266, 0.2197]
cat 1: [5, 532, 53, 38] and [0.008, 0.8471, 0.0844, 0.0605]
cat 2: [0, 1, 94, 4] and [0.0, 0.0101, 0.9495, 0.0404]
cat 3: [5, 36, 26, 559] and [0.008, 0.0575, 0.0415, 0.893]
[train epoch 15/100] | loss 0.7017 | nw acc 0.8 | time 2 min 50 sec
cat 0: [996, 48, 42, 60] and [0.8691, 0.0419, 0.0366, 0.0524]
cat 1: [77, 2078, 220, 288] and [0.0289, 0.7803, 0.0826, 0.1081]
cat 2: [20, 83, 552, 62] and [0.0279, 0.1158, 0.7699, 0.0865]
cat 3: [82, 332, 151, 2465] and [0.0271, 0.1096, 0.0498, 0.8135]
[test epoch 15/100] | loss 0.156 | nw acc 0.847 | time 0 min 43 sec
cat 0: [280, 24, 8, 48] and [0.7778, 0.0667, 0.0222, 0.1333]
cat 1: [5, 538, 27, 24] and [0.0084, 0.9057, 0.0455, 0.0404]
cat 2: [4, 33, 194, 33] and [0.0152, 0.125, 0.7348, 0.125]
cat 3: [5, 41, 12, 614] and [0.0074, 0.061, 0.0179, 0.9137]
[train epoch 16/100] | loss 0.67468 | nw acc 0.819 | time 2 min 53 sec
cat 0: [1010, 43, 29, 65] and [0.8806, 0.0375, 0.0253, 0.0567]
cat 1: [71, 2135, 192, 284] and [0.0265, 0.796, 0.0716, 0.1059]
cat 2: [9, 73, 621, 52] and [0.0119, 0.0967, 0.8225, 0.0689]
cat 3: [85, 290, 123, 2474] and [0.0286, 0.0976, 0.0414, 0.8324]
[test epoch 16/100] | loss 0.178 | nw acc 0.78 | time 0 min 43 sec
cat 0: [280, 20, 5, 40] and [0.8116, 0.058, 0.0145, 0.1159]
cat 1: [1, 438, 8, 19] and [0.0021, 0.9399, 0.0172, 0.0408]
cat 2: [7, 131, 222, 102] and [0.0152, 0.2835, 0.4805, 0.2208]
cat 3: [6, 47, 6, 558] and [0.0097, 0.0762, 0.0097, 0.9044]
[train epoch 17/100] | loss 0.65282 | nw acc 0.832 | time 2 min 49 sec
cat 0: [1024, 42, 33, 53] and [0.8889, 0.0365, 0.0286, 0.046]
cat 1: [65, 2170, 198, 253] and [0.0242, 0.8079, 0.0737, 0.0942]
cat 2: [12, 79, 622, 50] and [0.0157, 0.1035, 0.8152, 0.0655]
cat 3: [74, 250, 112, 2519] and [0.025, 0.0846, 0.0379, 0.8525]
[test epoch 17/100] | loss 0.161 | nw acc 0.843 | time 0 min 43 sec
cat 0: [263, 9, 1, 31] and [0.8651, 0.0296, 0.0033, 0.102]
cat 1: [15, 577, 38, 56] and [0.0219, 0.8411, 0.0554, 0.0816]
cat 2: [12, 18, 189, 42] and [0.046, 0.069, 0.7241, 0.1609]
cat 3: [4, 32, 13, 590] and [0.0063, 0.0501, 0.0203, 0.9233]
[train epoch 18/100] | loss 0.63122 | nw acc 0.835 | time 2 min 51 sec
cat 0: [1024, 34, 27, 63] and [0.892, 0.0296, 0.0235, 0.0549]
cat 1: [77, 2195, 193, 253] and [0.0283, 0.8076, 0.071, 0.0931]
cat 2: [8, 57, 646, 66] and [0.0103, 0.0734, 0.8314, 0.0849]
cat 3: [66, 255, 99, 2493] and [0.0227, 0.0875, 0.034, 0.8558]
[test epoch 18/100] | loss 0.154 | nw acc 0.859 | time 0 min 44 sec
cat 0: [284, 33, 16, 63] and [0.7172, 0.0833, 0.0404, 0.1591]
cat 1: [2, 531, 11, 10] and [0.0036, 0.9585, 0.0199, 0.0181]
cat 2: [1, 30, 199, 11] and [0.0041, 0.1245, 0.8257, 0.0456]
cat 3: [7, 42, 15, 635] and [0.01, 0.0601, 0.0215, 0.9084]
[train epoch 19/100] | loss 0.6225 | nw acc 0.844 | time 2 min 53 sec
cat 0: [1016, 38, 32, 42] and [0.9007, 0.0337, 0.0284, 0.0372]
cat 1: [75, 2197, 180, 233] and [0.0279, 0.8182, 0.067, 0.0868]
cat 2: [8, 63, 659, 46] and [0.0103, 0.0812, 0.8492, 0.0593]
cat 3: [76, 243, 94, 2554] and [0.0256, 0.0819, 0.0317, 0.8608]
[test epoch 19/100] | loss 0.16 | nw acc 0.844 | time 0 min 44 sec
cat 0: [280, 8, 6, 45] and [0.826, 0.0236, 0.0177, 0.1327]
cat 1: [11, 600, 22, 60] and [0.0159, 0.8658, 0.0317, 0.0866]
cat 2: [0, 23, 210, 84] and [0.0, 0.0726, 0.6625, 0.265]
cat 3: [3, 5, 3, 530] and [0.0055, 0.0092, 0.0055, 0.9797]
[train epoch 20/100] | loss 0.61165 | nw acc 0.853 | time 2 min 50 sec
cat 0: [1022, 30, 29, 51] and [0.9028, 0.0265, 0.0256, 0.0451]
cat 1: [52, 2234, 173, 204] and [0.0195, 0.8389, 0.065, 0.0766]
cat 2: [23, 58, 668, 46] and [0.0289, 0.073, 0.8403, 0.0579]
cat 3: [78, 219, 95, 2574] and [0.0263, 0.0738, 0.032, 0.8678]
[test epoch 20/100] | loss 0.139 | nw acc 0.888 | time 0 min 41 sec
cat 0: [268, 4, 1, 14] and [0.9338, 0.0139, 0.0035, 0.0488]
cat 1: [14, 613, 31, 57] and [0.0196, 0.8573, 0.0434, 0.0797]
cat 2: [4, 9, 203, 27] and [0.0165, 0.037, 0.8354, 0.1111]
cat 3: [8, 10, 6, 621] and [0.0124, 0.0155, 0.0093, 0.9628]
[train epoch 21/100] | loss 0.61669 | nw acc 0.85 | time 2 min 50 sec
cat 0: [1025, 43, 24, 51] and [0.8968, 0.0376, 0.021, 0.0446]
cat 1: [63, 2213, 157, 213] and [0.0238, 0.8364, 0.0593, 0.0805]
cat 2: [15, 62, 683, 58] and [0.0183, 0.0758, 0.835, 0.0709]
cat 3: [72, 223, 101, 2553] and [0.0244, 0.0756, 0.0342, 0.8657]
[test epoch 21/100] | loss 0.143 | nw acc 0.864 | time 0 min 43 sec
cat 0: [269, 6, 5, 8] and [0.934, 0.0208, 0.0174, 0.0278]
cat 1: [15, 594, 74, 33] and [0.0209, 0.8296, 0.1034, 0.0461]
cat 2: [0, 2, 122, 5] and [0.0, 0.0155, 0.9457, 0.0388]
cat 3: [10, 34, 40, 673] and [0.0132, 0.0449, 0.0528, 0.889]
[train epoch 22/100] | loss 0.60148 | nw acc 0.86 | time 2 min 52 sec
cat 0: [1041, 30, 18, 35] and [0.9262, 0.0267, 0.016, 0.0311]
cat 1: [62, 2257, 178, 205] and [0.0229, 0.8353, 0.0659, 0.0759]
cat 2: [5, 58, 681, 64] and [0.0062, 0.0718, 0.8428, 0.0792]
cat 3: [67, 196, 88, 2571] and [0.0229, 0.0671, 0.0301, 0.8799]
[test epoch 22/100] | loss 0.265 | nw acc 0.562 | time 0 min 42 sec
cat 0: [280, 197, 166, 150] and [0.3531, 0.2484, 0.2093, 0.1892]
cat 1: [0, 219, 17, 0] and [0.0, 0.928, 0.072, 0.0]
cat 2: [0, 0, 11, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [14, 220, 47, 569] and [0.0165, 0.2588, 0.0553, 0.6694]
[train epoch 23/100] | loss 0.58933 | nw acc 0.863 | time 2 min 51 sec
cat 0: [1027, 38, 16, 33] and [0.9219, 0.0341, 0.0144, 0.0296]
cat 1: [72, 2255, 161, 204] and [0.0267, 0.8377, 0.0598, 0.0758]
cat 2: [12, 41, 695, 44] and [0.0152, 0.0518, 0.8775, 0.0556]
cat 3: [64, 207, 93, 2594] and [0.0216, 0.07, 0.0314, 0.8769]
[test epoch 23/100] | loss 0.139 | nw acc 0.881 | time 0 min 44 sec
cat 0: [277, 14, 2, 32] and [0.8523, 0.0431, 0.0062, 0.0985]
cat 1: [6, 567, 26, 18] and [0.0097, 0.919, 0.0421, 0.0292]
cat 2: [5, 24, 205, 26] and [0.0192, 0.0923, 0.7885, 0.1]
cat 3: [6, 31, 8, 643] and [0.0087, 0.0451, 0.0116, 0.9346]
[train epoch 24/100] | loss 0.57608 | nw acc 0.871 | time 2 min 53 sec
cat 0: [1039, 24, 15, 60] and [0.913, 0.0211, 0.0132, 0.0527]
cat 1: [43, 2284, 150, 190] and [0.0161, 0.8564, 0.0562, 0.0712]
cat 2: [13, 47, 720, 34] and [0.016, 0.0577, 0.8845, 0.0418]
cat 3: [80, 186, 80, 2591] and [0.0272, 0.0633, 0.0272, 0.8822]
[test epoch 24/100] | loss 0.145 | nw acc 0.87 | time 0 min 43 sec
cat 0: [280, 12, 1, 30] and [0.8669, 0.0372, 0.0031, 0.0929]
cat 1: [8, 592, 19, 43] and [0.0121, 0.8943, 0.0287, 0.065]
cat 2: [4, 23, 217, 65] and [0.0129, 0.0744, 0.7023, 0.2104]
cat 3: [2, 9, 4, 581] and [0.0034, 0.0151, 0.0067, 0.9748]
[train epoch 25/100] | loss 0.5591 | nw acc 0.882 | time 2 min 51 sec
cat 0: [1051, 32, 19, 32] and [0.9268, 0.0282, 0.0168, 0.0282]
cat 1: [60, 2290, 130, 157] and [0.0228, 0.8684, 0.0493, 0.0595]
cat 2: [10, 57, 735, 44] and [0.0118, 0.0674, 0.8688, 0.052]
cat 3: [54, 162, 81, 2642] and [0.0184, 0.0551, 0.0276, 0.8989]
[test epoch 25/100] | loss 0.133 | nw acc 0.894 | time 0 min 43 sec
cat 0: [284, 24, 6, 25] and [0.8378, 0.0708, 0.0177, 0.0737]
cat 1: [3, 536, 4, 6] and [0.0055, 0.9763, 0.0073, 0.0109]
cat 2: [2, 32, 223, 14] and [0.0074, 0.1181, 0.8229, 0.0517]
cat 3: [5, 44, 8, 674] and [0.0068, 0.0602, 0.0109, 0.922]
[train epoch 26/100] | loss 0.56828 | nw acc 0.877 | time 2 min 53 sec
cat 0: [1036, 28, 14, 31] and [0.9342, 0.0252, 0.0126, 0.028]
cat 1: [69, 2280, 145, 164] and [0.026, 0.8578, 0.0546, 0.0617]
cat 2: [7, 44, 723, 40] and [0.0086, 0.0541, 0.8882, 0.0491]
cat 3: [63, 189, 83, 2640] and [0.0212, 0.0635, 0.0279, 0.8874]
[test epoch 26/100] | loss 0.167 | nw acc 0.81 | time 0 min 46 sec
cat 0: [275, 3, 4, 42] and [0.8488, 0.0093, 0.0123, 0.1296]
cat 1: [16, 619, 36, 115] and [0.0204, 0.7875, 0.0458, 0.1463]
cat 2: [2, 12, 201, 101] and [0.0063, 0.038, 0.6361, 0.3196]
cat 3: [1, 2, 0, 461] and [0.0022, 0.0043, 0.0, 0.9935]
[train epoch 27/100] | loss 0.55376 | nw acc 0.887 | time 3 min 8 sec
cat 0: [1064, 32, 14, 35] and [0.9293, 0.0279, 0.0122, 0.0306]
cat 1: [49, 2286, 123, 172] and [0.0186, 0.8692, 0.0468, 0.0654]
cat 2: [6, 41, 762, 27] and [0.0072, 0.049, 0.9115, 0.0323]
cat 3: [56, 182, 66, 2641] and [0.019, 0.0618, 0.0224, 0.8968]
[test epoch 27/100] | loss 0.132 | nw acc 0.901 | time 0 min 48 sec
cat 0: [283, 15, 3, 27] and [0.8628, 0.0457, 0.0091, 0.0823]
cat 1: [5, 588, 13, 20] and [0.008, 0.9393, 0.0208, 0.0319]
cat 2: [3, 13, 220, 33] and [0.0112, 0.0483, 0.8178, 0.1227]
cat 3: [3, 20, 5, 639] and [0.0045, 0.03, 0.0075, 0.958]
[train epoch 28/100] | loss 0.55045 | nw acc 0.891 | time 3 min 4 sec
cat 0: [1040, 23, 14, 29] and [0.9403, 0.0208, 0.0127, 0.0262]
cat 1: [42, 2301, 110, 145] and [0.0162, 0.8857, 0.0423, 0.0558]
cat 2: [14, 57, 768, 22] and [0.0163, 0.0662, 0.892, 0.0256]
cat 3: [79, 160, 73, 2679] and [0.0264, 0.0535, 0.0244, 0.8957]
[test epoch 28/100] | loss 0.128 | nw acc 0.907 | time 0 min 43 sec
cat 0: [281, 9, 3, 21] and [0.8949, 0.0287, 0.0096, 0.0669]
cat 1: [4, 577, 11, 13] and [0.0066, 0.9537, 0.0182, 0.0215]
cat 2: [2, 22, 221, 23] and [0.0075, 0.0821, 0.8246, 0.0858]
cat 3: [7, 28, 6, 662] and [0.01, 0.0398, 0.0085, 0.9417]
[train epoch 29/100] | loss 0.53383 | nw acc 0.9 | time 2 min 57 sec
cat 0: [1062, 24, 8, 25] and [0.9491, 0.0214, 0.0071, 0.0223]
cat 1: [55, 2330, 115, 138] and [0.0208, 0.8832, 0.0436, 0.0523]
cat 2: [7, 40, 785, 31] and [0.0081, 0.0463, 0.9096, 0.0359]
cat 3: [51, 147, 57, 2681] and [0.0174, 0.0501, 0.0194, 0.9131]
[test epoch 29/100] | loss 0.139 | nw acc 0.878 | time 0 min 46 sec
cat 0: [277, 4, 2, 27] and [0.8935, 0.0129, 0.0065, 0.0871]
cat 1: [12, 622, 32, 79] and [0.0161, 0.8349, 0.043, 0.106]
cat 2: [4, 4, 207, 34] and [0.0161, 0.0161, 0.8313, 0.1365]
cat 3: [1, 6, 0, 579] and [0.0017, 0.0102, 0.0, 0.9881]
[train epoch 30/100] | loss 0.5203 | nw acc 0.907 | time 3 min 7 sec
cat 0: [1072, 27, 14, 28] and [0.9395, 0.0237, 0.0123, 0.0245]
cat 1: [48, 2358, 108, 149] and [0.018, 0.8855, 0.0406, 0.056]
cat 2: [10, 35, 800, 17] and [0.0116, 0.0406, 0.9281, 0.0197]
cat 3: [45, 121, 43, 2681] and [0.0156, 0.0419, 0.0149, 0.9277]
[test epoch 30/100] | loss 0.147 | nw acc 0.846 | time 0 min 43 sec
cat 0: [288, 57, 37, 55] and [0.659, 0.1304, 0.0847, 0.1259]
cat 1: [0, 530, 31, 5] and [0.0, 0.9364, 0.0548, 0.0088]
cat 2: [0, 4, 149, 1] and [0.0, 0.026, 0.9675, 0.0065]
cat 3: [6, 45, 24, 658] and [0.0082, 0.0614, 0.0327, 0.8977]
[train epoch 31/100] | loss 0.52892 | nw acc 0.903 | time 3 min 14 sec
cat 0: [1074, 27, 13, 25] and [0.9429, 0.0237, 0.0114, 0.0219]
cat 1: [42, 2336, 120, 133] and [0.016, 0.8879, 0.0456, 0.0506]
cat 2: [12, 34, 783, 29] and [0.014, 0.0396, 0.9126, 0.0338]
cat 3: [47, 144, 49, 2688] and [0.0161, 0.0492, 0.0167, 0.918]
[test epoch 31/100] | loss 0.135 | nw acc 0.892 | time 0 min 46 sec
cat 0: [272, 2, 1, 20] and [0.922, 0.0068, 0.0034, 0.0678]
cat 1: [13, 608, 21, 51] and [0.0188, 0.8773, 0.0303, 0.0736]
cat 2: [4, 10, 217, 32] and [0.0152, 0.038, 0.8251, 0.1217]
cat 3: [5, 16, 2, 616] and [0.0078, 0.025, 0.0031, 0.964]
[train epoch 32/100] | loss 0.52737 | nw acc 0.899 | time 3 min 11 sec
cat 0: [1061, 32, 11, 36] and [0.9307, 0.0281, 0.0096, 0.0316]
cat 1: [52, 2312, 101, 126] and [0.0201, 0.8923, 0.039, 0.0486]
cat 2: [12, 54, 789, 31] and [0.0135, 0.0609, 0.8905, 0.035]
cat 3: [50, 143, 64, 2682] and [0.017, 0.0487, 0.0218, 0.9126]
[test epoch 32/100] | loss 0.121 | nw acc 0.918 | time 0 min 43 sec
cat 0: [284, 16, 4, 11] and [0.9016, 0.0508, 0.0127, 0.0349]
cat 1: [3, 591, 29, 11] and [0.0047, 0.9322, 0.0457, 0.0174]
cat 2: [2, 5, 196, 6] and [0.0096, 0.0239, 0.9378, 0.0287]
cat 3: [5, 24, 12, 691] and [0.0068, 0.0328, 0.0164, 0.944]
[train epoch 33/100] | loss 0.51054 | nw acc 0.913 | time 2 min 54 sec
cat 0: [1067, 19, 6, 33] and [0.9484, 0.0169, 0.0053, 0.0293]
cat 1: [45, 2358, 88, 110] and [0.0173, 0.9066, 0.0338, 0.0423]
cat 2: [11, 31, 822, 29] and [0.0123, 0.0347, 0.9205, 0.0325]
cat 3: [52, 133, 49, 2703] and [0.0177, 0.0453, 0.0167, 0.9203]
[test epoch 33/100] | loss 0.139 | nw acc 0.88 | time 0 min 44 sec
cat 0: [277, 0, 1, 10] and [0.9618, 0.0, 0.0035, 0.0347]
cat 1: [10, 631, 31, 126] and [0.0125, 0.7907, 0.0388, 0.1579]
cat 2: [4, 2, 207, 9] and [0.018, 0.009, 0.9324, 0.0405]
cat 3: [3, 3, 2, 574] and [0.0052, 0.0052, 0.0034, 0.9863]
[train epoch 34/100] | loss 0.51666 | nw acc 0.907 | time 2 min 51 sec
cat 0: [1085, 48, 21, 40] and [0.9087, 0.0402, 0.0176, 0.0335]
cat 1: [38, 2325, 92, 106] and [0.0148, 0.9078, 0.0359, 0.0414]
cat 2: [7, 32, 794, 24] and [0.0082, 0.0373, 0.9265, 0.028]
cat 3: [45, 136, 58, 2705] and [0.0153, 0.0462, 0.0197, 0.9188]
[test epoch 34/100] | loss 0.134 | nw acc 0.895 | time 0 min 47 sec
cat 0: [285, 10, 3, 48] and [0.8237, 0.0289, 0.0087, 0.1387]
cat 1: [6, 609, 13, 44] and [0.0089, 0.9062, 0.0193, 0.0655]
cat 2: [2, 12, 223, 26] and [0.0076, 0.0456, 0.8479, 0.0989]
cat 3: [1, 5, 2, 601] and [0.0016, 0.0082, 0.0033, 0.9869]
[train epoch 35/100] | loss 0.50258 | nw acc 0.916 | time 3 min 12 sec
cat 0: [1061, 26, 10, 26] and [0.9448, 0.0232, 0.0089, 0.0232]
cat 1: [56, 2369, 84, 103] and [0.0214, 0.907, 0.0322, 0.0394]
cat 2: [6, 22, 821, 21] and [0.0069, 0.0253, 0.9437, 0.0241]
cat 3: [52, 124, 50, 2725] and [0.0176, 0.042, 0.0169, 0.9234]
[test epoch 35/100] | loss 0.115 | nw acc 0.936 | time 0 min 43 sec
cat 0: [283, 7, 1, 10] and [0.9402, 0.0233, 0.0033, 0.0332]
cat 1: [4, 597, 6, 9] and [0.0065, 0.9692, 0.0097, 0.0146]
cat 2: [3, 11, 224, 7] and [0.0122, 0.0449, 0.9143, 0.0286]
cat 3: [4, 21, 10, 693] and [0.0055, 0.0288, 0.0137, 0.9519]
[train epoch 36/100] | loss 0.48868 | nw acc 0.926 | time 2 min 48 sec
cat 0: [1095, 31, 5, 28] and [0.9448, 0.0267, 0.0043, 0.0242]
cat 1: [49, 2373, 60, 94] and [0.019, 0.9212, 0.0233, 0.0365]
cat 2: [4, 24, 852, 20] and [0.0044, 0.0267, 0.9467, 0.0222]
cat 3: [27, 113, 48, 2733] and [0.0092, 0.0387, 0.0164, 0.9356]
[test epoch 36/100] | loss 0.134 | nw acc 0.894 | time 0 min 43 sec
cat 0: [280, 2, 0, 16] and [0.9396, 0.0067, 0.0, 0.0537]
cat 1: [6, 612, 15, 54] and [0.0087, 0.8908, 0.0218, 0.0786]
cat 2: [5, 16, 224, 48] and [0.0171, 0.0546, 0.7645, 0.1638]
cat 3: [3, 6, 2, 601] and [0.0049, 0.0098, 0.0033, 0.982]
[train epoch 37/100] | loss 0.48821 | nw acc 0.921 | time 2 min 55 sec
cat 0: [1088, 16, 6, 27] and [0.9569, 0.0141, 0.0053, 0.0237]
cat 1: [31, 2387, 90, 102] and [0.0119, 0.9146, 0.0345, 0.0391]
cat 2: [7, 27, 815, 22] and [0.008, 0.031, 0.9357, 0.0253]
cat 3: [49, 111, 54, 2724] and [0.0167, 0.0378, 0.0184, 0.9272]
[test epoch 37/100] | loss 0.114 | nw acc 0.937 | time 0 min 43 sec
cat 0: [282, 4, 1, 5] and [0.9658, 0.0137, 0.0034, 0.0171]
cat 1: [6, 615, 19, 25] and [0.009, 0.9248, 0.0286, 0.0376]
cat 2: [3, 6, 214, 1] and [0.0134, 0.0268, 0.9554, 0.0045]
cat 3: [3, 11, 7, 688] and [0.0042, 0.0155, 0.0099, 0.9704]
[train epoch 38/100] | loss 0.4866 | nw acc 0.921 | time 2 min 53 sec
cat 0: [1072, 17, 8, 16] and [0.9632, 0.0153, 0.0072, 0.0144]
cat 1: [47, 2360, 87, 89] and [0.0182, 0.9137, 0.0337, 0.0345]
cat 2: [11, 35, 831, 18] and [0.0123, 0.0391, 0.9285, 0.0201]
cat 3: [45, 129, 39, 2752] and [0.0152, 0.0435, 0.0132, 0.9282]
[test epoch 38/100] | loss 0.123 | nw acc 0.917 | time 0 min 43 sec
cat 0: [284, 7, 3, 21] and [0.9016, 0.0222, 0.0095, 0.0667]
cat 1: [7, 608, 14, 35] and [0.0105, 0.9157, 0.0211, 0.0527]
cat 2: [2, 8, 221, 16] and [0.0081, 0.0324, 0.8947, 0.0648]
cat 3: [1, 13, 3, 647] and [0.0015, 0.0196, 0.0045, 0.9744]
[train epoch 39/100] | loss 0.48956 | nw acc 0.92 | time 2 min 51 sec
cat 0: [1093, 16, 7, 18] and [0.9638, 0.0141, 0.0062, 0.0159]
cat 1: [40, 2365, 75, 112] and [0.0154, 0.9124, 0.0289, 0.0432]
cat 2: [6, 32, 832, 29] and [0.0067, 0.0356, 0.9255, 0.0323]
cat 3: [36, 128, 51, 2716] and [0.0123, 0.0437, 0.0174, 0.9266]
[test epoch 39/100] | loss 0.124 | nw acc 0.917 | time 0 min 47 sec
cat 0: [285, 4, 0, 16] and [0.9344, 0.0131, 0.0, 0.0525]
cat 1: [5, 609, 12, 30] and [0.0076, 0.9284, 0.0183, 0.0457]
cat 2: [4, 20, 228, 34] and [0.014, 0.0699, 0.7972, 0.1189]
cat 3: [0, 3, 1, 639] and [0.0, 0.0047, 0.0016, 0.9938]
[train epoch 40/100] | loss 0.49677 | nw acc 0.919 | time 3 min 7 sec
cat 0: [1090, 19, 20, 27] and [0.9429, 0.0164, 0.0173, 0.0234]
cat 1: [35, 2387, 67, 102] and [0.0135, 0.9213, 0.0259, 0.0394]
cat 2: [7, 41, 822, 47] and [0.0076, 0.0447, 0.8964, 0.0513]
cat 3: [43, 94, 56, 2699] and [0.0149, 0.0325, 0.0194, 0.9333]
[test epoch 40/100] | loss 0.123 | nw acc 0.917 | time 0 min 43 sec
cat 0: [284, 9, 0, 13] and [0.9281, 0.0294, 0.0, 0.0425]
cat 1: [4, 582, 7, 19] and [0.0065, 0.951, 0.0114, 0.031]
cat 2: [3, 27, 231, 23] and [0.0106, 0.0951, 0.8134, 0.081]
cat 3: [3, 18, 3, 664] and [0.0044, 0.0262, 0.0044, 0.9651]
[train epoch 41/100] | loss 0.47867 | nw acc 0.93 | time 2 min 50 sec
cat 0: [1090, 21, 6, 18] and [0.9604, 0.0185, 0.0053, 0.0159]
cat 1: [34, 2396, 69, 102] and [0.0131, 0.9212, 0.0265, 0.0392]
cat 2: [7, 23, 855, 13] and [0.0078, 0.0256, 0.9521, 0.0145]
cat 3: [44, 101, 35, 2742] and [0.0151, 0.0346, 0.012, 0.9384]
[test epoch 41/100] | loss 0.132 | nw acc 0.897 | time 0 min 50 sec
cat 0: [284, 11, 1, 35] and [0.858, 0.0332, 0.003, 0.1057]
cat 1: [3, 579, 1, 26] and [0.0049, 0.9507, 0.0016, 0.0427]
cat 2: [3, 38, 238, 37] and [0.0095, 0.1203, 0.7532, 0.1171]
cat 3: [4, 8, 1, 621] and [0.0063, 0.0126, 0.0016, 0.9795]
[train epoch 42/100] | loss 0.47243 | nw acc 0.933 | time 3 min 11 sec
cat 0: [1084, 13, 8, 20] and [0.9636, 0.0116, 0.0071, 0.0178]
cat 1: [37, 2400, 61, 63] and [0.0144, 0.9371, 0.0238, 0.0246]
cat 2: [7, 29, 854, 22] and [0.0077, 0.0318, 0.9364, 0.0241]
cat 3: [47, 99, 42, 2770] and [0.0159, 0.0335, 0.0142, 0.9364]
[test epoch 42/100] | loss 0.121 | nw acc 0.918 | time 0 min 43 sec
cat 0: [280, 10, 0, 14] and [0.9211, 0.0329, 0.0, 0.0461]
cat 1: [7, 595, 16, 20] and [0.011, 0.9326, 0.0251, 0.0313]
cat 2: [4, 11, 221, 19] and [0.0157, 0.0431, 0.8667, 0.0745]
cat 3: [3, 20, 4, 666] and [0.0043, 0.0289, 0.0058, 0.961]
[train epoch 43/100] | loss 0.46955 | nw acc 0.935 | time 2 min 55 sec
cat 0: [1108, 25, 5, 27] and [0.9511, 0.0215, 0.0043, 0.0232]
cat 1: [29, 2410, 69, 82] and [0.0112, 0.9305, 0.0266, 0.0317]
cat 2: [9, 28, 847, 12] and [0.01, 0.0312, 0.9453, 0.0134]
cat 3: [29, 78, 44, 2754] and [0.01, 0.0269, 0.0151, 0.948]
[test epoch 43/100] | loss 0.116 | nw acc 0.929 | time 0 min 36 sec
cat 0: [282, 4, 0, 7] and [0.9625, 0.0137, 0.0, 0.0239]
cat 1: [5, 604, 5, 20] and [0.0079, 0.9527, 0.0079, 0.0315]
cat 2: [4, 21, 234, 28] and [0.0139, 0.0732, 0.8153, 0.0976]
cat 3: [3, 7, 2, 664] and [0.0044, 0.0104, 0.003, 0.9822]
[train epoch 44/100] | loss 0.4766 | nw acc 0.931 | time 3 min 1 sec
cat 0: [1110, 17, 9, 20] and [0.9602, 0.0147, 0.0078, 0.0173]
cat 1: [25, 2382, 66, 92] and [0.0097, 0.9287, 0.0257, 0.0359]
cat 2: [7, 34, 864, 25] and [0.0075, 0.0366, 0.929, 0.0269]
cat 3: [33, 108, 26, 2738] and [0.0114, 0.0372, 0.009, 0.9425]
[test epoch 44/100] | loss 0.119 | nw acc 0.928 | time 0 min 40 sec
cat 0: [284, 1, 0, 14] and [0.9498, 0.0033, 0.0, 0.0468]
cat 1: [5, 629, 17, 56] and [0.0071, 0.8897, 0.024, 0.0792]
cat 2: [2, 3, 222, 2] and [0.0087, 0.0131, 0.9694, 0.0087]
cat 3: [3, 3, 2, 647] and [0.0046, 0.0046, 0.0031, 0.9878]
[train epoch 45/100] | loss 0.48979 | nw acc 0.92 | time 3 min 17 sec
cat 0: [1088, 34, 8, 19] and [0.9469, 0.0296, 0.007, 0.0165]
cat 1: [34, 2345, 62, 101] and [0.0134, 0.9225, 0.0244, 0.0397]
cat 2: [11, 44, 842, 24] and [0.0119, 0.0478, 0.9142, 0.0261]
cat 3: [42, 118, 53, 2731] and [0.0143, 0.0401, 0.018, 0.9276]
[test epoch 45/100] | loss 0.117 | nw acc 0.927 | time 0 min 42 sec
cat 0: [284, 4, 1, 19] and [0.9221, 0.013, 0.0032, 0.0617]
cat 1: [6, 622, 14, 41] and [0.0088, 0.9107, 0.0205, 0.06]
cat 2: [2, 2, 223, 8] and [0.0085, 0.0085, 0.9489, 0.034]
cat 3: [2, 8, 3, 651] and [0.003, 0.012, 0.0045, 0.9804]
[train epoch 46/100] | loss 0.46458 | nw acc 0.935 | time 3 min 3 sec
cat 0: [1101, 12, 7, 17] and [0.9683, 0.0106, 0.0062, 0.015]
cat 1: [28, 2399, 57, 75] and [0.0109, 0.9375, 0.0223, 0.0293]
cat 2: [8, 41, 856, 20] and [0.0086, 0.0443, 0.9254, 0.0216]
cat 3: [38, 89, 45, 2763] and [0.0129, 0.0303, 0.0153, 0.9414]
[test epoch 46/100] | loss 0.112 | nw acc 0.939 | time 0 min 49 sec
cat 0: [283, 2, 1, 16] and [0.9371, 0.0066, 0.0033, 0.053]
cat 1: [4, 610, 7, 13] and [0.0063, 0.9621, 0.011, 0.0205]
cat 2: [3, 11, 230, 11] and [0.0118, 0.0431, 0.902, 0.0431]
cat 3: [4, 13, 3, 679] and [0.0057, 0.0186, 0.0043, 0.9714]
[train epoch 47/100] | loss 0.45749 | nw acc 0.942 | time 3 min 8 sec
cat 0: [1103, 8, 5, 14] and [0.9761, 0.0071, 0.0044, 0.0124]
cat 1: [28, 2433, 48, 74] and [0.0108, 0.9419, 0.0186, 0.0286]
cat 2: [8, 25, 871, 22] and [0.0086, 0.027, 0.9406, 0.0238]
cat 3: [36, 75, 41, 2765] and [0.0123, 0.0257, 0.0141, 0.9479]
[test epoch 47/100] | loss 0.115 | nw acc 0.935 | time 0 min 44 sec
cat 0: [284, 2, 2, 23] and [0.9132, 0.0064, 0.0064, 0.074]
cat 1: [7, 626, 9, 33] and [0.0104, 0.9274, 0.0133, 0.0489]
cat 2: [2, 4, 228, 6] and [0.0083, 0.0167, 0.95, 0.025]
cat 3: [1, 4, 2, 657] and [0.0015, 0.006, 0.003, 0.9895]
[train epoch 48/100] | loss 0.46449 | nw acc 0.936 | time 3 min 28 sec
cat 0: [1099, 16, 4, 14] and [0.97, 0.0141, 0.0035, 0.0124]
cat 1: [42, 2409, 62, 100] and [0.0161, 0.9219, 0.0237, 0.0383]
cat 2: [3, 27, 869, 12] and [0.0033, 0.0296, 0.9539, 0.0132]
cat 3: [31, 89, 30, 2749] and [0.0107, 0.0307, 0.0103, 0.9483]
[test epoch 48/100] | loss 0.118 | nw acc 0.925 | time 0 min 40 sec
cat 0: [284, 9, 2, 21] and [0.8987, 0.0285, 0.0063, 0.0665]
cat 1: [7, 609, 7, 33] and [0.0107, 0.9284, 0.0107, 0.0503]
cat 2: [2, 10, 230, 12] and [0.0079, 0.0394, 0.9055, 0.0472]
cat 3: [1, 8, 2, 653] and [0.0015, 0.012, 0.003, 0.9834]
[train epoch 49/100] | loss 0.45652 | nw acc 0.942 | time 2 min 54 sec
cat 0: [1104, 11, 6, 23] and [0.965, 0.0096, 0.0052, 0.0201]
cat 1: [24, 2427, 48, 66] and [0.0094, 0.9462, 0.0187, 0.0257]
cat 2: [8, 26, 876, 17] and [0.0086, 0.028, 0.945, 0.0183]
cat 3: [39, 77, 35, 2769] and [0.0134, 0.0264, 0.012, 0.9483]
[test epoch 49/100] | loss 0.109 | nw acc 0.948 | time 0 min 41 sec
cat 0: [285, 6, 0, 6] and [0.9596, 0.0202, 0.0, 0.0202]
cat 1: [3, 602, 1, 11] and [0.0049, 0.9757, 0.0016, 0.0178]
cat 2: [3, 11, 238, 6] and [0.0116, 0.0426, 0.9225, 0.0233]
cat 3: [3, 17, 2, 696] and [0.0042, 0.0237, 0.0028, 0.9694]
[train epoch 50/100] | loss 0.46213 | nw acc 0.937 | time 2 min 56 sec
cat 0: [1103, 16, 9, 23] and [0.9583, 0.0139, 0.0078, 0.02]
cat 1: [38, 2413, 60, 77] and [0.0147, 0.9324, 0.0232, 0.0298]
cat 2: [9, 27, 860, 13] and [0.0099, 0.0297, 0.9461, 0.0143]
cat 3: [25, 85, 36, 2762] and [0.0086, 0.0292, 0.0124, 0.9498]
[test epoch 50/100] | loss 0.117 | nw acc 0.934 | time 0 min 46 sec
cat 0: [282, 1, 0, 7] and [0.9724, 0.0034, 0.0, 0.0241]
cat 1: [5, 605, 2, 16] and [0.008, 0.9634, 0.0032, 0.0255]
cat 2: [5, 21, 237, 27] and [0.0172, 0.0724, 0.8172, 0.0931]
cat 3: [2, 9, 2, 669] and [0.0029, 0.0132, 0.0029, 0.9809]
[train epoch 51/100] | loss 0.45914 | nw acc 0.939 | time 3 min 0 sec
cat 0: [1106, 15, 10, 21] and [0.9601, 0.013, 0.0087, 0.0182]
cat 1: [27, 2402, 44, 83] and [0.0106, 0.9397, 0.0172, 0.0325]
cat 2: [5, 23, 886, 15] and [0.0054, 0.0248, 0.9537, 0.0161]
cat 3: [37, 101, 25, 2756] and [0.0127, 0.0346, 0.0086, 0.9442]
[test epoch 51/100] | loss 0.127 | nw acc 0.903 | time 0 min 56 sec
cat 0: [284, 14, 1, 15] and [0.9045, 0.0446, 0.0032, 0.0478]
cat 1: [4, 543, 0, 5] and [0.0072, 0.9837, 0.0, 0.0091]
cat 2: [6, 58, 239, 32] and [0.0179, 0.1731, 0.7134, 0.0955]
cat 3: [0, 21, 1, 667] and [0.0, 0.0305, 0.0015, 0.9681]
[train epoch 52/100] | loss 0.46661 | nw acc 0.936 | time 2 min 55 sec
cat 0: [1105, 19, 13, 12] and [0.9617, 0.0165, 0.0113, 0.0104]
cat 1: [28, 2396, 62, 83] and [0.0109, 0.9327, 0.0241, 0.0323]
cat 2: [7, 50, 862, 14] and [0.0075, 0.0536, 0.9239, 0.015]
cat 3: [35, 76, 28, 2766] and [0.012, 0.0262, 0.0096, 0.9522]
[test epoch 52/100] | loss 0.113 | nw acc 0.939 | time 0 min 43 sec
cat 0: [285, 6, 3, 20] and [0.9076, 0.0191, 0.0096, 0.0637]
cat 1: [5, 612, 3, 18] and [0.0078, 0.9592, 0.0047, 0.0282]
cat 2: [2, 11, 233, 9] and [0.0078, 0.0431, 0.9137, 0.0353]
cat 3: [2, 7, 2, 672] and [0.0029, 0.0102, 0.0029, 0.9839]
[train epoch 53/100] | loss 0.45695 | nw acc 0.94 | time 2 min 59 sec
cat 0: [1100, 14, 5, 17] and [0.9683, 0.0123, 0.0044, 0.015]
cat 1: [34, 2422, 54, 71] and [0.0132, 0.9384, 0.0209, 0.0275]
cat 2: [7, 14, 869, 19] and [0.0077, 0.0154, 0.956, 0.0209]
cat 3: [34, 91, 37, 2768] and [0.0116, 0.0311, 0.0126, 0.9447]
[test epoch 53/100] | loss 0.124 | nw acc 0.909 | time 0 min 46 sec
cat 0: [291, 41, 15, 18] and [0.7973, 0.1123, 0.0411, 0.0493]
cat 1: [0, 549, 5, 3] and [0.0, 0.9856, 0.009, 0.0054]
cat 2: [0, 9, 209, 1] and [0.0, 0.0411, 0.9543, 0.0046]
cat 3: [3, 37, 12, 697] and [0.004, 0.0494, 0.016, 0.9306]
[train epoch 54/100] | loss 0.44727 | nw acc 0.942 | time 3 min 14 sec
cat 0: [1100, 19, 5, 15] and [0.9658, 0.0167, 0.0044, 0.0132]
cat 1: [33, 2415, 52, 70] and [0.0128, 0.9397, 0.0202, 0.0272]
cat 2: [9, 24, 881, 10] and [0.0097, 0.026, 0.9535, 0.0108]
cat 3: [33, 83, 27, 2780] and [0.0113, 0.0284, 0.0092, 0.9511]
[test epoch 54/100] | loss 0.11 | nw acc 0.944 | time 0 min 44 sec
cat 0: [282, 2, 3, 7] and [0.9592, 0.0068, 0.0102, 0.0238]
cat 1: [4, 606, 2, 11] and [0.0064, 0.9727, 0.0032, 0.0177]
cat 2: [5, 18, 234, 11] and [0.0187, 0.0672, 0.8731, 0.041]
cat 3: [3, 10, 2, 690] and [0.0043, 0.0142, 0.0028, 0.9787]
[train epoch 55/100] | loss 0.44629 | nw acc 0.947 | time 3 min 14 sec
cat 0: [1119, 12, 5, 18] and [0.9697, 0.0104, 0.0043, 0.0156]
cat 1: [25, 2435, 48, 76] and [0.0097, 0.9423, 0.0186, 0.0294]
cat 2: [6, 21, 885, 4] and [0.0066, 0.0229, 0.9662, 0.0044]
cat 3: [25, 73, 27, 2777] and [0.0086, 0.0252, 0.0093, 0.9569]
[test epoch 55/100] | loss 0.118 | nw acc 0.929 | time 0 min 47 sec
cat 0: [284, 3, 2, 19] and [0.9221, 0.0097, 0.0065, 0.0617]
cat 1: [6, 627, 9, 49] and [0.0087, 0.9074, 0.013, 0.0709]
cat 2: [3, 4, 227, 5] and [0.0126, 0.0167, 0.9498, 0.0209]
cat 3: [1, 2, 3, 646] and [0.0015, 0.0031, 0.0046, 0.9908]
[train epoch 56/100] | loss 0.44632 | nw acc 0.945 | time 3 min 15 sec
cat 0: [1113, 15, 3, 17] and [0.9695, 0.0131, 0.0026, 0.0148]
cat 1: [23, 2424, 49, 72] and [0.009, 0.9439, 0.0191, 0.028]
cat 2: [8, 18, 888, 14] and [0.0086, 0.0194, 0.9569, 0.0151]
cat 3: [31, 84, 25, 2772] and [0.0106, 0.0288, 0.0086, 0.9519]
[test epoch 56/100] | loss 0.11 | nw acc 0.945 | time 0 min 44 sec
cat 0: [286, 9, 0, 11] and [0.9346, 0.0294, 0.0, 0.0359]
cat 1: [3, 601, 4, 11] and [0.0048, 0.9709, 0.0065, 0.0178]
cat 2: [3, 17, 234, 4] and [0.0116, 0.0659, 0.907, 0.0155]
cat 3: [2, 9, 3, 693] and [0.0028, 0.0127, 0.0042, 0.9802]
[train epoch 57/100] | loss 0.44098 | nw acc 0.949 | time 2 min 55 sec
cat 0: [1109, 15, 5, 16] and [0.9686, 0.0131, 0.0044, 0.014]
cat 1: [27, 2436, 37, 63] and [0.0105, 0.9504, 0.0144, 0.0246]
cat 2: [7, 24, 896, 9] and [0.0075, 0.0256, 0.9573, 0.0096]
cat 3: [32, 66, 27, 2787] and [0.011, 0.0227, 0.0093, 0.9571]
[test epoch 57/100] | loss 0.115 | nw acc 0.927 | time 0 min 44 sec
cat 0: [282, 7, 0, 11] and [0.94, 0.0233, 0.0, 0.0367]
cat 1: [2, 573, 1, 5] and [0.0034, 0.9862, 0.0017, 0.0086]
cat 2: [5, 31, 237, 15] and [0.0174, 0.1076, 0.8229, 0.0521]
cat 3: [5, 25, 3, 688] and [0.0069, 0.0347, 0.0042, 0.9542]
[train epoch 58/100] | loss 0.46697 | nw acc 0.932 | time 2 min 55 sec
cat 0: [1098, 18, 4, 19] and [0.964, 0.0158, 0.0035, 0.0167]
cat 1: [32, 2401, 62, 105] and [0.0123, 0.9235, 0.0238, 0.0404]
cat 2: [8, 23, 858, 10] and [0.0089, 0.0256, 0.9544, 0.0111]
cat 3: [37, 99, 41, 2741] and [0.0127, 0.0339, 0.0141, 0.9393]
[test epoch 58/100] | loss 0.111 | nw acc 0.941 | time 0 min 47 sec
cat 0: [284, 10, 2, 13] and [0.9191, 0.0324, 0.0065, 0.0421]
cat 1: [5, 600, 2, 14] and [0.0081, 0.9662, 0.0032, 0.0225]
cat 2: [2, 12, 234, 4] and [0.0079, 0.0476, 0.9286, 0.0159]
cat 3: [3, 14, 3, 688] and [0.0042, 0.0198, 0.0042, 0.9718]
[train epoch 59/100] | loss 0.44687 | nw acc 0.946 | time 3 min 16 sec
cat 0: [1113, 19, 11, 21] and [0.9562, 0.0163, 0.0095, 0.018]
cat 1: [29, 2432, 36, 75] and [0.0113, 0.9456, 0.014, 0.0292]
cat 2: [8, 23, 891, 7] and [0.0086, 0.0248, 0.9591, 0.0075]
cat 3: [25, 67, 27, 2772] and [0.0086, 0.0232, 0.0093, 0.9588]
[test epoch 59/100] | loss 0.122 | nw acc 0.92 | time 0 min 46 sec
cat 0: [285, 2, 1, 19] and [0.9283, 0.0065, 0.0033, 0.0619]
cat 1: [6, 628, 12, 49] and [0.0086, 0.9036, 0.0173, 0.0705]
cat 2: [3, 4, 228, 25] and [0.0115, 0.0154, 0.8769, 0.0962]
cat 3: [0, 2, 0, 626] and [0.0, 0.0032, 0.0, 0.9968]
[train epoch 60/100] | loss 0.43847 | nw acc 0.948 | time 2 min 50 sec
cat 0: [1122, 12, 8, 13] and [0.9714, 0.0104, 0.0069, 0.0113]
cat 1: [27, 2427, 39, 60] and [0.0106, 0.9506, 0.0153, 0.0235]
cat 2: [3, 23, 892, 20] and [0.0032, 0.0245, 0.951, 0.0213]
cat 3: [23, 79, 26, 2782] and [0.0079, 0.0271, 0.0089, 0.956]
[test epoch 60/100] | loss 0.109 | nw acc 0.941 | time 0 min 46 sec
cat 0: [283, 6, 1, 22] and [0.9071, 0.0192, 0.0032, 0.0705]
cat 1: [2, 605, 5, 7] and [0.0032, 0.9774, 0.0081, 0.0113]
cat 2: [4, 16, 233, 4] and [0.0156, 0.0623, 0.9066, 0.0156]
cat 3: [5, 9, 2, 686] and [0.0071, 0.0128, 0.0028, 0.9772]
[train epoch 61/100] | loss 0.44089 | nw acc 0.947 | time 2 min 13 sec
cat 0: [1117, 10, 5, 7] and [0.9807, 0.0088, 0.0044, 0.0061]
cat 1: [27, 2432, 51, 79] and [0.0104, 0.9394, 0.0197, 0.0305]
cat 2: [6, 25, 881, 10] and [0.0065, 0.0271, 0.9555, 0.0108]
cat 3: [25, 74, 28, 2779] and [0.0086, 0.0255, 0.0096, 0.9563]
[test epoch 61/100] | loss 0.108 | nw acc 0.945 | time 0 min 24 sec
cat 0: [286, 4, 1, 19] and [0.9226, 0.0129, 0.0032, 0.0613]
cat 1: [5, 622, 11, 19] and [0.0076, 0.9467, 0.0167, 0.0289]
cat 2: [2, 3, 227, 2] and [0.0085, 0.0128, 0.9701, 0.0085]
cat 3: [1, 7, 2, 679] and [0.0015, 0.0102, 0.0029, 0.9855]
