MaunaNet4Aug(
  (conv1): Conv2d(1, 3, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn1): BatchNorm2d(3, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool1): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv2): Conv2d(3, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
  (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool2): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv3): Conv2d(64, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
  (bn3): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool3): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv4): Conv2d(128, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
  (bn4): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool4): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (avgpool): AvgPool2d(kernel_size=7, stride=7, padding=0)
  (fc1): Linear(in_features=256, out_features=4, bias=True)
)
[train epoch 1/100] | loss 1.1746 | nw acc 0.499 | time 1 min 59 sec
cat 0: [234, 122, 58, 89] and [0.4652, 0.2425, 0.1153, 0.1769]
cat 1: [503, 1410, 436, 659] and [0.1672, 0.4688, 0.1449, 0.2191]
cat 2: [66, 81, 97, 64] and [0.2143, 0.263, 0.3149, 0.2078]
cat 3: [372, 928, 374, 2063] and [0.0995, 0.2483, 0.1001, 0.552]
[test epoch 1/100] | loss 0.316 | nw acc 0.484 | time 0 min 33 sec
cat 0: [33, 5, 0, 2] and [0.825, 0.125, 0.0, 0.05]
cat 1: [186, 414, 183, 234] and [0.1829, 0.4071, 0.1799, 0.2301]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [75, 217, 58, 483] and [0.09, 0.2605, 0.0696, 0.5798]
[train epoch 2/100] | loss 1.1188 | nw acc 0.524 | time 2 min 20 sec
cat 0: [319, 124, 81, 125] and [0.4915, 0.1911, 0.1248, 0.1926]
cat 1: [478, 1489, 412, 623] and [0.1592, 0.496, 0.1372, 0.2075]
cat 2: [82, 93, 114, 57] and [0.237, 0.2688, 0.3295, 0.1647]
cat 3: [296, 835, 358, 2070] and [0.0832, 0.2346, 0.1006, 0.5816]
[test epoch 2/100] | loss 0.28 | nw acc 0.518 | time 0 min 39 sec
cat 0: [114, 66, 31, 76] and [0.3972, 0.23, 0.108, 0.2648]
cat 1: [124, 343, 109, 113] and [0.18, 0.4978, 0.1582, 0.164]
cat 2: [7, 7, 18, 10] and [0.1667, 0.1667, 0.4286, 0.2381]
cat 3: [49, 220, 83, 520] and [0.0562, 0.2523, 0.0952, 0.5963]
[train epoch 3/100] | loss 1.0499 | nw acc 0.572 | time 2 min 34 sec
cat 0: [459, 170, 103, 144] and [0.524, 0.1941, 0.1176, 0.1644]
cat 1: [359, 1559, 362, 458] and [0.1311, 0.5694, 0.1322, 0.1673]
cat 2: [77, 111, 135, 73] and [0.1944, 0.2803, 0.3409, 0.1843]
cat 3: [280, 701, 365, 2200] and [0.079, 0.1977, 0.1029, 0.6204]
[test epoch 3/100] | loss 0.339 | nw acc 0.422 | time 0 min 40 sec
cat 0: [66, 13, 1, 15] and [0.6947, 0.1368, 0.0105, 0.1579]
cat 1: [200, 595, 233, 556] and [0.1263, 0.3756, 0.1471, 0.351]
cat 2: [1, 1, 2, 0] and [0.25, 0.25, 0.5, 0.0]
cat 3: [27, 27, 5, 148] and [0.1304, 0.1304, 0.0242, 0.715]
[train epoch 4/100] | loss 1.0364 | nw acc 0.578 | time 2 min 35 sec
cat 0: [432, 173, 94, 138] and [0.5161, 0.2067, 0.1123, 0.1649]
cat 1: [359, 1608, 346, 478] and [0.1286, 0.5761, 0.124, 0.1713]
cat 2: [79, 98, 182, 77] and [0.1812, 0.2248, 0.4174, 0.1766]
cat 3: [305, 662, 343, 2182] and [0.0873, 0.1896, 0.0982, 0.6249]
[test epoch 4/100] | loss 0.321 | nw acc 0.411 | time 0 min 37 sec
cat 0: [262, 364, 150, 263] and [0.2522, 0.3503, 0.1444, 0.2531]
cat 1: [5, 133, 18, 69] and [0.0222, 0.5911, 0.08, 0.3067]
cat 2: [8, 17, 21, 13] and [0.1356, 0.2881, 0.3559, 0.2203]
cat 3: [19, 122, 52, 374] and [0.0335, 0.2152, 0.0917, 0.6596]
[train epoch 5/100] | loss 1.0147 | nw acc 0.587 | time 2 min 31 sec
cat 0: [496, 152, 85, 145] and [0.5649, 0.1731, 0.0968, 0.1651]
cat 1: [309, 1557, 330, 439] and [0.1173, 0.5909, 0.1252, 0.1666]
cat 2: [82, 102, 209, 84] and [0.1719, 0.2138, 0.4382, 0.1761]
cat 3: [288, 730, 341, 2207] and [0.0808, 0.2047, 0.0956, 0.6189]
[test epoch 5/100] | loss 0.253 | nw acc 0.584 | time 0 min 40 sec
cat 0: [127, 47, 25, 71] and [0.4704, 0.1741, 0.0926, 0.263]
cat 1: [25, 319, 35, 33] and [0.0607, 0.7743, 0.085, 0.0801]
cat 2: [64, 66, 94, 33] and [0.249, 0.2568, 0.3658, 0.1284]
cat 3: [78, 204, 87, 582] and [0.082, 0.2145, 0.0915, 0.612]
[train epoch 6/100] | loss 0.98266 | nw acc 0.613 | time 2 min 38 sec
cat 0: [568, 158, 75, 166] and [0.5874, 0.1634, 0.0776, 0.1717]
cat 1: [262, 1625, 334, 402] and [0.0999, 0.6195, 0.1273, 0.1533]
cat 2: [83, 124, 240, 68] and [0.1612, 0.2408, 0.466, 0.132]
cat 3: [262, 634, 316, 2239] and [0.0759, 0.1837, 0.0916, 0.6488]
[test epoch 6/100] | loss 0.301 | nw acc 0.492 | time 0 min 39 sec
cat 0: [100, 26, 11, 56] and [0.5181, 0.1347, 0.057, 0.2902]
cat 1: [127, 521, 98, 369] and [0.1139, 0.4673, 0.0879, 0.3309]
cat 2: [62, 60, 128, 99] and [0.1777, 0.1719, 0.3668, 0.2837]
cat 3: [5, 29, 4, 195] and [0.0215, 0.1245, 0.0172, 0.8369]
[train epoch 7/100] | loss 0.96348 | nw acc 0.625 | time 2 min 39 sec
cat 0: [579, 175, 98, 160] and [0.5721, 0.1729, 0.0968, 0.1581]
cat 1: [238, 1649, 287, 377] and [0.0933, 0.6464, 0.1125, 0.1478]
cat 2: [97, 128, 301, 104] and [0.154, 0.2032, 0.4778, 0.1651]
cat 3: [261, 589, 279, 2234] and [0.0776, 0.1751, 0.083, 0.6643]
[test epoch 7/100] | loss 0.278 | nw acc 0.536 | time 0 min 36 sec
cat 0: [68, 19, 5, 0] and [0.7391, 0.2065, 0.0543, 0.0]
cat 1: [143, 453, 130, 222] and [0.1508, 0.4778, 0.1371, 0.2342]
cat 2: [18, 27, 65, 54] and [0.1098, 0.1646, 0.3963, 0.3293]
cat 3: [65, 137, 41, 443] and [0.0948, 0.1997, 0.0598, 0.6458]
[train epoch 8/100] | loss 0.94224 | nw acc 0.637 | time 2 min 33 sec
cat 0: [617, 165, 122, 153] and [0.5837, 0.1561, 0.1154, 0.1447]
cat 1: [241, 1726, 323, 370] and [0.0906, 0.6489, 0.1214, 0.1391]
cat 2: [69, 108, 246, 90] and [0.1345, 0.2105, 0.4795, 0.1754]
cat 3: [248, 542, 274, 2262] and [0.0746, 0.163, 0.0824, 0.6801]
[test epoch 8/100] | loss 0.272 | nw acc 0.532 | time 0 min 38 sec
cat 0: [114, 13, 7, 58] and [0.5938, 0.0677, 0.0365, 0.3021]
cat 1: [164, 574, 164, 353] and [0.1307, 0.4574, 0.1307, 0.2813]
cat 2: [6, 10, 62, 37] and [0.0522, 0.087, 0.5391, 0.3217]
cat 3: [10, 39, 8, 271] and [0.0305, 0.1189, 0.0244, 0.8262]
[train epoch 9/100] | loss 0.91234 | nw acc 0.663 | time 2 min 34 sec
cat 0: [667, 155, 98, 163] and [0.6159, 0.1431, 0.0905, 0.1505]
cat 1: [205, 1795, 285, 376] and [0.077, 0.6746, 0.1071, 0.1413]
cat 2: [67, 115, 335, 87] and [0.1109, 0.1904, 0.5546, 0.144]
cat 3: [236, 476, 247, 2249] and [0.0736, 0.1484, 0.077, 0.7011]
[test epoch 9/100] | loss 0.247 | nw acc 0.622 | time 0 min 40 sec
cat 0: [109, 22, 3, 23] and [0.6943, 0.1401, 0.0191, 0.1465]
cat 1: [47, 401, 47, 67] and [0.0836, 0.7135, 0.0836, 0.1192]
cat 2: [85, 109, 161, 105] and [0.1848, 0.237, 0.35, 0.2283]
cat 3: [53, 104, 30, 524] and [0.0745, 0.1463, 0.0422, 0.737]
[train epoch 10/100] | loss 0.90371 | nw acc 0.667 | time 2 min 34 sec
cat 0: [675, 173, 87, 155] and [0.6193, 0.1587, 0.0798, 0.1422]
cat 1: [204, 1777, 283, 346] and [0.0782, 0.6808, 0.1084, 0.1326]
cat 2: [68, 105, 334, 82] and [0.1154, 0.1783, 0.5671, 0.1392]
cat 3: [228, 486, 261, 2292] and [0.0698, 0.1488, 0.0799, 0.7016]
[test epoch 10/100] | loss 0.281 | nw acc 0.522 | time 0 min 38 sec
cat 0: [50, 0, 0, 2] and [0.9615, 0.0, 0.0, 0.0385]
cat 1: [3, 189, 17, 13] and [0.0135, 0.8514, 0.0766, 0.0586]
cat 2: [47, 26, 83, 24] and [0.2611, 0.1444, 0.4611, 0.1333]
cat 3: [194, 421, 141, 680] and [0.1351, 0.2932, 0.0982, 0.4735]
[train epoch 11/100] | loss 0.90802 | nw acc 0.668 | time 2 min 33 sec
cat 0: [656, 160, 74, 128] and [0.6444, 0.1572, 0.0727, 0.1257]
cat 1: [216, 1799, 284, 351] and [0.0815, 0.6789, 0.1072, 0.1325]
cat 2: [67, 103, 347, 111] and [0.1067, 0.164, 0.5525, 0.1768]
cat 3: [236, 479, 260, 2285] and [0.0724, 0.1469, 0.0798, 0.7009]
[test epoch 11/100] | loss 0.282 | nw acc 0.531 | time 0 min 39 sec
cat 0: [161, 55, 19, 101] and [0.4792, 0.1637, 0.0565, 0.3006]
cat 1: [11, 402, 31, 156] and [0.0183, 0.67, 0.0517, 0.26]
cat 2: [110, 154, 188, 193] and [0.1705, 0.2388, 0.2915, 0.2992]
cat 3: [12, 25, 3, 269] and [0.0388, 0.0809, 0.0097, 0.8706]
[train epoch 12/100] | loss 0.89336 | nw acc 0.677 | time 2 min 33 sec
cat 0: [652, 164, 88, 136] and [0.6269, 0.1577, 0.0846, 0.1308]
cat 1: [218, 1855, 267, 361] and [0.0807, 0.6868, 0.0989, 0.1337]
cat 2: [69, 114, 367, 96] and [0.1068, 0.1765, 0.5681, 0.1486]
cat 3: [236, 408, 243, 2282] and [0.0745, 0.1287, 0.0767, 0.7201]
[test epoch 12/100] | loss 0.28 | nw acc 0.571 | time 0 min 39 sec
cat 0: [235, 82, 87, 248] and [0.3604, 0.1258, 0.1334, 0.3804]
cat 1: [51, 515, 101, 157] and [0.0619, 0.625, 0.1226, 0.1905]
cat 2: [0, 3, 47, 14] and [0.0, 0.0469, 0.7344, 0.2188]
cat 3: [8, 36, 6, 300] and [0.0229, 0.1029, 0.0171, 0.8571]
[train epoch 13/100] | loss 0.89433 | nw acc 0.68 | time 2 min 33 sec
cat 0: [685, 156, 85, 164] and [0.6284, 0.1431, 0.078, 0.1505]
cat 1: [217, 1871, 281, 370] and [0.0792, 0.6831, 0.1026, 0.1351]
cat 2: [57, 100, 361, 79] and [0.0955, 0.1675, 0.6047, 0.1323]
cat 3: [216, 414, 238, 2262] and [0.069, 0.1323, 0.076, 0.7227]
[test epoch 13/100] | loss 0.226 | nw acc 0.672 | time 0 min 39 sec
cat 0: [184, 45, 11, 67] and [0.5993, 0.1466, 0.0358, 0.2182]
cat 1: [57, 521, 70, 145] and [0.0719, 0.657, 0.0883, 0.1828]
cat 2: [41, 30, 133, 55] and [0.1583, 0.1158, 0.5135, 0.2124]
cat 3: [12, 40, 27, 452] and [0.0226, 0.0753, 0.0508, 0.8512]
[train epoch 14/100] | loss 0.86856 | nw acc 0.686 | time 2 min 35 sec
cat 0: [703, 172, 86, 157] and [0.6288, 0.1538, 0.0769, 0.1404]
cat 1: [179, 1856, 259, 338] and [0.068, 0.7052, 0.0984, 0.1284]
cat 2: [68, 97, 387, 99] and [0.1045, 0.149, 0.5945, 0.1521]
cat 3: [225, 416, 233, 2281] and [0.0713, 0.1319, 0.0739, 0.723]
[test epoch 14/100] | loss 0.281 | nw acc 0.527 | time 0 min 38 sec
cat 0: [89, 7, 3, 14] and [0.7876, 0.0619, 0.0265, 0.1239]
cat 1: [189, 582, 157, 375] and [0.145, 0.4467, 0.1205, 0.2878]
cat 2: [7, 25, 79, 68] and [0.0391, 0.1397, 0.4413, 0.3799]
cat 3: [9, 22, 2, 262] and [0.0305, 0.0746, 0.0068, 0.8881]
[train epoch 15/100] | loss 0.85351 | nw acc 0.698 | time 2 min 33 sec
cat 0: [722, 137, 93, 122] and [0.6723, 0.1276, 0.0866, 0.1136]
cat 1: [167, 1883, 260, 311] and [0.0637, 0.7184, 0.0992, 0.1187]
cat 2: [67, 90, 378, 109] and [0.104, 0.1398, 0.587, 0.1693]
cat 3: [219, 431, 234, 2333] and [0.0681, 0.134, 0.0727, 0.7252]
[test epoch 15/100] | loss 0.26 | nw acc 0.572 | time 0 min 41 sec
cat 0: [100, 9, 5, 15] and [0.7752, 0.0698, 0.0388, 0.1163]
cat 1: [173, 584, 196, 293] and [0.1388, 0.4687, 0.1573, 0.2352]
cat 2: [1, 3, 10, 7] and [0.0476, 0.1429, 0.4762, 0.3333]
cat 3: [20, 40, 30, 404] and [0.0405, 0.081, 0.0607, 0.8178]
[train epoch 16/100] | loss 0.85458 | nw acc 0.695 | time 2 min 30 sec
cat 0: [706, 154, 80, 151] and [0.6471, 0.1412, 0.0733, 0.1384]
cat 1: [187, 1910, 256, 342] and [0.0694, 0.7087, 0.095, 0.1269]
cat 2: [78, 108, 406, 110] and [0.1111, 0.1538, 0.5783, 0.1567]
cat 3: [204, 369, 223, 2272] and [0.0665, 0.1203, 0.0727, 0.7405]
[test epoch 16/100] | loss 0.284 | nw acc 0.508 | time 0 min 39 sec
cat 0: [108, 34, 4, 3] and [0.7248, 0.2282, 0.0268, 0.0201]
cat 1: [0, 115, 6, 3] and [0.0, 0.9274, 0.0484, 0.0242]
cat 2: [6, 11, 45, 6] and [0.0882, 0.1618, 0.6618, 0.0882]
cat 3: [180, 476, 186, 707] and [0.1162, 0.3073, 0.1201, 0.4564]
[train epoch 17/100] | loss 0.83378 | nw acc 0.707 | time 2 min 37 sec
cat 0: [722, 139, 80, 127] and [0.676, 0.1301, 0.0749, 0.1189]
cat 1: [186, 1942, 255, 326] and [0.0687, 0.7169, 0.0941, 0.1203]
cat 2: [68, 105, 399, 97] and [0.1016, 0.157, 0.5964, 0.145]
cat 3: [199, 355, 231, 2325] and [0.064, 0.1141, 0.0743, 0.7476]
[test epoch 17/100] | loss 0.324 | nw acc 0.431 | time 0 min 38 sec
cat 0: [52, 1, 0, 7] and [0.8667, 0.0167, 0.0, 0.1167]
cat 1: [240, 626, 227, 569] and [0.1444, 0.3767, 0.1366, 0.3424]
cat 2: [0, 1, 10, 4] and [0.0, 0.0667, 0.6667, 0.2667]
cat 3: [2, 8, 4, 139] and [0.0131, 0.0523, 0.0261, 0.9085]
[train epoch 18/100] | loss 0.82681 | nw acc 0.716 | time 2 min 33 sec
cat 0: [727, 127, 73, 118] and [0.6957, 0.1215, 0.0699, 0.1129]
cat 1: [190, 1966, 267, 333] and [0.0689, 0.7134, 0.0969, 0.1208]
cat 2: [59, 92, 440, 103] and [0.085, 0.1326, 0.634, 0.1484]
cat 3: [199, 356, 185, 2321] and [0.065, 0.1163, 0.0604, 0.7582]
[test epoch 18/100] | loss 0.334 | nw acc 0.477 | time 0 min 40 sec
cat 0: [62, 5, 1, 11] and [0.7848, 0.0633, 0.0127, 0.1392]
cat 1: [2, 100, 4, 6] and [0.0179, 0.8929, 0.0357, 0.0536]
cat 2: [160, 259, 214, 163] and [0.201, 0.3254, 0.2688, 0.2048]
cat 3: [70, 272, 22, 539] and [0.0775, 0.3012, 0.0244, 0.5969]
[train epoch 19/100] | loss 0.83305 | nw acc 0.704 | time 2 min 35 sec
cat 0: [726, 115, 74, 146] and [0.6843, 0.1084, 0.0697, 0.1376]
cat 1: [163, 1940, 263, 333] and [0.0604, 0.7188, 0.0974, 0.1234]
cat 2: [65, 117, 430, 129] and [0.0877, 0.1579, 0.5803, 0.1741]
cat 3: [221, 369, 198, 2267] and [0.0723, 0.1208, 0.0648, 0.7421]
[test epoch 19/100] | loss 0.232 | nw acc 0.645 | time 0 min 40 sec
cat 0: [176, 50, 8, 12] and [0.7154, 0.2033, 0.0325, 0.0488]
cat 1: [8, 276, 25, 10] and [0.0251, 0.8652, 0.0784, 0.0313]
cat 2: [22, 51, 126, 37] and [0.0932, 0.2161, 0.5339, 0.1568]
cat 3: [88, 259, 82, 660] and [0.0808, 0.2378, 0.0753, 0.6061]
[train epoch 20/100] | loss 0.81964 | nw acc 0.727 | time 2 min 35 sec
cat 0: [749, 117, 88, 135] and [0.6878, 0.1074, 0.0808, 0.124]
cat 1: [183, 1984, 252, 284] and [0.0677, 0.734, 0.0932, 0.1051]
cat 2: [54, 90, 425, 78] and [0.0835, 0.1391, 0.6569, 0.1206]
cat 3: [189, 350, 200, 2378] and [0.0606, 0.1123, 0.0642, 0.7629]
[test epoch 20/100] | loss 0.234 | nw acc 0.644 | time 0 min 38 sec
cat 0: [155, 42, 11, 23] and [0.671, 0.1818, 0.0476, 0.0996]
cat 1: [36, 320, 39, 34] and [0.0839, 0.7459, 0.0909, 0.0793]
cat 2: [33, 52, 141, 41] and [0.1236, 0.1948, 0.5281, 0.1536]
cat 3: [70, 222, 50, 621] and [0.0727, 0.2305, 0.0519, 0.6449]
[train epoch 21/100] | loss 0.81995 | nw acc 0.725 | time 2 min 30 sec
cat 0: [760, 144, 79, 133] and [0.681, 0.129, 0.0708, 0.1192]
cat 1: [167, 2012, 261, 322] and [0.0605, 0.7285, 0.0945, 0.1166]
cat 2: [69, 95, 442, 115] and [0.0957, 0.1318, 0.613, 0.1595]
cat 3: [179, 290, 183, 2305] and [0.0605, 0.0981, 0.0619, 0.7795]
[test epoch 21/100] | loss 0.257 | nw acc 0.592 | time 0 min 36 sec
cat 0: [97, 8, 2, 40] and [0.6599, 0.0544, 0.0136, 0.2721]
cat 1: [182, 594, 147, 293] and [0.1497, 0.4885, 0.1209, 0.241]
cat 2: [5, 8, 83, 24] and [0.0417, 0.0667, 0.6917, 0.2]
cat 3: [10, 26, 9, 362] and [0.0246, 0.0639, 0.0221, 0.8894]
[train epoch 22/100] | loss 0.79614 | nw acc 0.745 | time 2 min 35 sec
cat 0: [805, 104, 68, 111] and [0.7399, 0.0956, 0.0625, 0.102]
cat 1: [156, 2044, 267, 302] and [0.0563, 0.7382, 0.0964, 0.1091]
cat 2: [51, 101, 464, 103] and [0.0709, 0.1405, 0.6453, 0.1433]
cat 3: [163, 292, 166, 2359] and [0.0547, 0.098, 0.0557, 0.7916]
[test epoch 22/100] | loss 0.2 | nw acc 0.723 | time 0 min 37 sec
cat 0: [144, 10, 7, 18] and [0.8045, 0.0559, 0.0391, 0.1006]
cat 1: [76, 498, 51, 62] and [0.1106, 0.7249, 0.0742, 0.0902]
cat 2: [25, 27, 133, 26] and [0.1185, 0.128, 0.6303, 0.1232]
cat 3: [49, 101, 50, 613] and [0.0603, 0.1242, 0.0615, 0.754]
[train epoch 23/100] | loss 0.79876 | nw acc 0.735 | time 2 min 34 sec
cat 0: [769, 130, 77, 110] and [0.7081, 0.1197, 0.0709, 0.1013]
cat 1: [149, 2016, 253, 284] and [0.0551, 0.7461, 0.0936, 0.1051]
cat 2: [72, 102, 443, 115] and [0.0984, 0.1393, 0.6052, 0.1571]
cat 3: [185, 293, 192, 2366] and [0.0609, 0.0965, 0.0632, 0.7793]
[test epoch 23/100] | loss 0.217 | nw acc 0.671 | time 0 min 37 sec
cat 0: [125, 8, 9, 10] and [0.8224, 0.0526, 0.0592, 0.0658]
cat 1: [108, 565, 107, 162] and [0.1146, 0.5998, 0.1136, 0.172]
cat 2: [9, 14, 81, 30] and [0.0672, 0.1045, 0.6045, 0.2239]
cat 3: [52, 49, 44, 517] and [0.0785, 0.074, 0.0665, 0.781]
[train epoch 24/100] | loss 0.79122 | nw acc 0.743 | time 2 min 37 sec
cat 0: [806, 114, 65, 131] and [0.7222, 0.1022, 0.0582, 0.1174]
cat 1: [144, 2038, 244, 311] and [0.0526, 0.7446, 0.0891, 0.1136]
cat 2: [53, 76, 468, 86] and [0.0776, 0.1113, 0.6852, 0.1259]
cat 3: [172, 313, 188, 2347] and [0.057, 0.1036, 0.0623, 0.7772]
[test epoch 24/100] | loss 0.29 | nw acc 0.516 | time 0 min 37 sec
cat 0: [30, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [217, 622, 218, 382] and [0.1508, 0.4322, 0.1515, 0.2655]
cat 2: [0, 0, 1, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [47, 14, 22, 337] and [0.1119, 0.0333, 0.0524, 0.8024]
[train epoch 25/100] | loss 0.80597 | nw acc 0.726 | time 2 min 32 sec
cat 0: [762, 119, 80, 133] and [0.6965, 0.1088, 0.0731, 0.1216]
cat 1: [146, 1979, 253, 299] and [0.0545, 0.7393, 0.0945, 0.1117]
cat 2: [63, 109, 448, 104] and [0.087, 0.1506, 0.6188, 0.1436]
cat 3: [204, 334, 184, 2339] and [0.0666, 0.1091, 0.0601, 0.7641]
[test epoch 25/100] | loss 0.245 | nw acc 0.589 | time 0 min 40 sec
cat 0: [89, 2, 0, 14] and [0.8476, 0.019, 0.0, 0.1333]
cat 1: [190, 615, 210, 294] and [0.1451, 0.4698, 0.1604, 0.2246]
cat 2: [0, 1, 19, 3] and [0.0, 0.0435, 0.8261, 0.1304]
cat 3: [15, 18, 12, 408] and [0.0331, 0.0397, 0.0265, 0.9007]
[train epoch 26/100] | loss 0.78209 | nw acc 0.75 | time 2 min 38 sec
cat 0: [828, 109, 75, 123] and [0.7295, 0.096, 0.0661, 0.1084]
cat 1: [124, 2009, 233, 253] and [0.0473, 0.7671, 0.089, 0.0966]
cat 2: [48, 90, 468, 90] and [0.069, 0.1293, 0.6724, 0.1293]
cat 3: [175, 333, 189, 2409] and [0.0563, 0.1072, 0.0608, 0.7756]
[test epoch 26/100] | loss 0.233 | nw acc 0.641 | time 0 min 39 sec
cat 0: [69, 1, 0, 2] and [0.9583, 0.0139, 0.0, 0.0278]
cat 1: [33, 388, 27, 50] and [0.0663, 0.7791, 0.0542, 0.1004]
cat 2: [39, 58, 135, 28] and [0.15, 0.2231, 0.5192, 0.1077]
cat 3: [153, 189, 79, 639] and [0.1443, 0.1783, 0.0745, 0.6028]
[train epoch 27/100] | loss 0.774 | nw acc 0.75 | time 2 min 32 sec
cat 0: [812, 110, 74, 105] and [0.7375, 0.0999, 0.0672, 0.0954]
cat 1: [142, 2037, 230, 301] and [0.0524, 0.7517, 0.0849, 0.1111]
cat 2: [51, 110, 502, 108] and [0.0661, 0.1427, 0.6511, 0.1401]
cat 3: [170, 284, 159, 2361] and [0.0572, 0.0955, 0.0535, 0.7939]
[test epoch 27/100] | loss 0.237 | nw acc 0.646 | time 0 min 38 sec
cat 0: [185, 60, 14, 61] and [0.5781, 0.1875, 0.0437, 0.1906]
cat 1: [6, 337, 19, 24] and [0.0155, 0.8731, 0.0492, 0.0622]
cat 2: [49, 116, 170, 86] and [0.1164, 0.2755, 0.4038, 0.2043]
cat 3: [54, 123, 38, 548] and [0.0708, 0.1612, 0.0498, 0.7182]
[train epoch 28/100] | loss 0.76905 | nw acc 0.757 | time 2 min 34 sec
cat 0: [815, 95, 59, 117] and [0.7505, 0.0875, 0.0543, 0.1077]
cat 1: [134, 2058, 231, 236] and [0.0504, 0.774, 0.0869, 0.0888]
cat 2: [53, 93, 482, 115] and [0.0713, 0.1252, 0.6487, 0.1548]
cat 3: [173, 295, 193, 2407] and [0.0564, 0.0962, 0.0629, 0.7846]
[test epoch 28/100] | loss 0.241 | nw acc 0.623 | time 0 min 40 sec
cat 0: [137, 18, 5, 52] and [0.6462, 0.0849, 0.0236, 0.2453]
cat 1: [18, 428, 27, 70] and [0.0331, 0.7882, 0.0497, 0.1289]
cat 2: [120, 157, 203, 169] and [0.1849, 0.2419, 0.3128, 0.2604]
cat 3: [19, 33, 6, 428] and [0.0391, 0.0679, 0.0123, 0.8807]
[train epoch 29/100] | loss 0.75902 | nw acc 0.763 | time 2 min 35 sec
cat 0: [843, 115, 60, 109] and [0.748, 0.102, 0.0532, 0.0967]
cat 1: [120, 2056, 259, 264] and [0.0445, 0.7618, 0.096, 0.0978]
cat 2: [58, 90, 488, 80] and [0.081, 0.1257, 0.6816, 0.1117]
cat 3: [154, 280, 158, 2422] and [0.0511, 0.0929, 0.0524, 0.8036]
[test epoch 29/100] | loss 0.25 | nw acc 0.616 | time 0 min 39 sec
cat 0: [97, 2, 0, 12] and [0.8739, 0.018, 0.0, 0.1081]
cat 1: [18, 349, 21, 32] and [0.0429, 0.831, 0.05, 0.0762]
cat 2: [148, 169, 203, 142] and [0.2236, 0.2553, 0.3066, 0.2145]
cat 3: [31, 116, 17, 533] and [0.0445, 0.1664, 0.0244, 0.7647]
[train epoch 30/100] | loss 0.75708 | nw acc 0.759 | time 2 min 38 sec
cat 0: [835, 95, 56, 101] and [0.7682, 0.0874, 0.0515, 0.0929]
cat 1: [137, 2088, 256, 292] and [0.0494, 0.753, 0.0923, 0.1053]
cat 2: [55, 85, 472, 94] and [0.0779, 0.1204, 0.6686, 0.1331]
cat 3: [148, 273, 181, 2388] and [0.0495, 0.0913, 0.0605, 0.7987]
[test epoch 30/100] | loss 0.286 | nw acc 0.52 | time 0 min 40 sec
cat 0: [34, 0, 0, 7] and [0.8293, 0.0, 0.0, 0.1707]
cat 1: [214, 591, 229, 339] and [0.1559, 0.4304, 0.1668, 0.2469]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [46, 45, 12, 373] and [0.0966, 0.0945, 0.0252, 0.7836]
[train epoch 31/100] | loss 0.75447 | nw acc 0.768 | time 2 min 35 sec
cat 0: [856, 80, 65, 115] and [0.767, 0.0717, 0.0582, 0.103]
cat 1: [108, 2106, 258, 261] and [0.0395, 0.7706, 0.0944, 0.0955]
cat 2: [60, 89, 494, 103] and [0.0804, 0.1193, 0.6622, 0.1381]
cat 3: [151, 266, 148, 2396] and [0.051, 0.0898, 0.05, 0.8092]
[test epoch 31/100] | loss 0.223 | nw acc 0.686 | time 0 min 40 sec
cat 0: [174, 31, 27, 21] and [0.6877, 0.1225, 0.1067, 0.083]
cat 1: [97, 538, 171, 104] and [0.1066, 0.5912, 0.1879, 0.1143]
cat 2: [0, 1, 13, 2] and [0.0, 0.0625, 0.8125, 0.125]
cat 3: [23, 66, 30, 592] and [0.0323, 0.0928, 0.0422, 0.8326]
[train epoch 32/100] | loss 0.75686 | nw acc 0.765 | time 2 min 36 sec
cat 0: [853, 107, 63, 115] and [0.7496, 0.094, 0.0554, 0.1011]
cat 1: [126, 2077, 263, 275] and [0.046, 0.7578, 0.096, 0.1003]
cat 2: [60, 87, 495, 82] and [0.0829, 0.1202, 0.6837, 0.1133]
cat 3: [136, 270, 144, 2403] and [0.0461, 0.0914, 0.0488, 0.8137]
[test epoch 32/100] | loss 0.254 | nw acc 0.584 | time 0 min 38 sec
cat 0: [81, 1, 0, 7] and [0.9101, 0.0112, 0.0, 0.0787]
cat 1: [202, 609, 181, 295] and [0.157, 0.4732, 0.1406, 0.2292]
cat 2: [4, 13, 56, 41] and [0.0351, 0.114, 0.4912, 0.3596]
cat 3: [7, 13, 4, 376] and [0.0175, 0.0325, 0.01, 0.94]
[train epoch 33/100] | loss 0.75332 | nw acc 0.766 | time 2 min 37 sec
cat 0: [871, 100, 68, 115] and [0.7548, 0.0867, 0.0589, 0.0997]
cat 1: [114, 2048, 237, 251] and [0.043, 0.7728, 0.0894, 0.0947]
cat 2: [49, 103, 512, 104] and [0.0638, 0.1341, 0.6667, 0.1354]
cat 3: [141, 290, 148, 2405] and [0.0473, 0.0972, 0.0496, 0.806]
[test epoch 33/100] | loss 0.22 | nw acc 0.698 | time 0 min 39 sec
cat 0: [239, 61, 21, 62] and [0.624, 0.1593, 0.0548, 0.1619]
cat 1: [16, 493, 36, 145] and [0.0232, 0.7145, 0.0522, 0.2101]
cat 2: [27, 44, 169, 73] and [0.0863, 0.1406, 0.5399, 0.2332]
cat 3: [12, 38, 15, 439] and [0.0238, 0.0754, 0.0298, 0.871]
[train epoch 34/100] | loss 0.73133 | nw acc 0.771 | time 2 min 41 sec
cat 0: [885, 91, 55, 109] and [0.7763, 0.0798, 0.0482, 0.0956]
cat 1: [91, 2086, 247, 260] and [0.0339, 0.7772, 0.092, 0.0969]
cat 2: [63, 82, 501, 104] and [0.084, 0.1093, 0.668, 0.1387]
cat 3: [136, 282, 162, 2402] and [0.0456, 0.0946, 0.0543, 0.8055]
[test epoch 34/100] | loss 0.196 | nw acc 0.74 | time 0 min 39 sec
cat 0: [205, 22, 33, 18] and [0.7374, 0.0791, 0.1187, 0.0647]
cat 1: [36, 542, 79, 91] and [0.0481, 0.7246, 0.1056, 0.1217]
cat 2: [3, 9, 78, 14] and [0.0288, 0.0865, 0.75, 0.1346]
cat 3: [50, 63, 51, 596] and [0.0658, 0.0829, 0.0671, 0.7842]
[train epoch 35/100] | loss 0.74164 | nw acc 0.769 | time 2 min 36 sec
cat 0: [873, 81, 55, 103] and [0.7851, 0.0728, 0.0495, 0.0926]
cat 1: [106, 2083, 263, 246] and [0.0393, 0.7721, 0.0975, 0.0912]
cat 2: [53, 88, 465, 89] and [0.0763, 0.1266, 0.6691, 0.1281]
cat 3: [143, 289, 182, 2437] and [0.0469, 0.0947, 0.0597, 0.7988]
[test epoch 35/100] | loss 0.3 | nw acc 0.477 | time 0 min 40 sec
cat 0: [50, 0, 2, 17] and [0.7246, 0.0, 0.029, 0.2464]
cat 1: [241, 631, 231, 469] and [0.1533, 0.4014, 0.1469, 0.2983]
cat 2: [0, 0, 2, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [3, 5, 6, 233] and [0.0121, 0.0202, 0.0243, 0.9433]
[train epoch 36/100] | loss 0.73335 | nw acc 0.778 | time 2 min 34 sec
cat 0: [862, 81, 53, 99] and [0.7872, 0.074, 0.0484, 0.0904]
cat 1: [114, 2118, 245, 258] and [0.0417, 0.7744, 0.0896, 0.0943]
cat 2: [61, 86, 520, 90] and [0.0806, 0.1136, 0.6869, 0.1189]
cat 3: [138, 256, 147, 2428] and [0.0465, 0.0862, 0.0495, 0.8178]
[test epoch 36/100] | loss 0.208 | nw acc 0.699 | time 0 min 38 sec
cat 0: [182, 15, 10, 18] and [0.8089, 0.0667, 0.0444, 0.08]
cat 1: [30, 382, 37, 19] and [0.0641, 0.8162, 0.0791, 0.0406]
cat 2: [13, 6, 98, 2] and [0.1092, 0.0504, 0.8235, 0.0168]
cat 3: [69, 233, 96, 680] and [0.064, 0.2161, 0.0891, 0.6308]
[train epoch 37/100] | loss 0.71897 | nw acc 0.793 | time 2 min 36 sec
cat 0: [923, 86, 57, 106] and [0.7875, 0.0734, 0.0486, 0.0904]
cat 1: [81, 2142, 245, 240] and [0.0299, 0.791, 0.0905, 0.0886]
cat 2: [57, 80, 525, 80] and [0.0768, 0.1078, 0.7075, 0.1078]
cat 3: [114, 233, 138, 2449] and [0.0389, 0.0794, 0.047, 0.8347]
[test epoch 37/100] | loss 0.261 | nw acc 0.591 | time 0 min 38 sec
cat 0: [135, 25, 37, 58] and [0.5294, 0.098, 0.1451, 0.2275]
cat 1: [149, 578, 191, 239] and [0.1288, 0.4996, 0.1651, 0.2066]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [10, 33, 13, 422] and [0.0209, 0.069, 0.0272, 0.8828]
[train epoch 38/100] | loss 0.71539 | nw acc 0.79 | time 2 min 32 sec
cat 0: [933, 79, 60, 93] and [0.8009, 0.0678, 0.0515, 0.0798]
cat 1: [86, 2142, 245, 233] and [0.0318, 0.7916, 0.0905, 0.0861]
cat 2: [46, 79, 481, 90] and [0.0661, 0.1135, 0.6911, 0.1293]
cat 3: [110, 241, 179, 2459] and [0.0368, 0.0806, 0.0599, 0.8227]
[test epoch 38/100] | loss 0.196 | nw acc 0.734 | time 0 min 38 sec
cat 0: [198, 10, 24, 36] and [0.7388, 0.0373, 0.0896, 0.1343]
cat 1: [75, 539, 113, 71] and [0.094, 0.6754, 0.1416, 0.089]
cat 2: [0, 2, 63, 2] and [0.0, 0.0299, 0.9403, 0.0299]
cat 3: [21, 85, 41, 610] and [0.0277, 0.1123, 0.0542, 0.8058]
[train epoch 39/100] | loss 0.70089 | nw acc 0.799 | time 2 min 36 sec
cat 0: [929, 67, 48, 77] and [0.8287, 0.0598, 0.0428, 0.0687]
cat 1: [88, 2139, 245, 210] and [0.0328, 0.7975, 0.0913, 0.0783]
cat 2: [51, 85, 529, 102] and [0.0665, 0.1108, 0.6897, 0.133]
cat 3: [107, 250, 143, 2486] and [0.0358, 0.0837, 0.0479, 0.8326]
[test epoch 39/100] | loss 0.277 | nw acc 0.528 | time 0 min 36 sec
cat 0: [171, 10, 17, 54] and [0.6786, 0.0397, 0.0675, 0.2143]
cat 1: [122, 620, 194, 459] and [0.0875, 0.4444, 0.1391, 0.329]
cat 2: [1, 0, 23, 6] and [0.0333, 0.0, 0.7667, 0.2]
cat 3: [0, 6, 7, 200] and [0.0, 0.0282, 0.0329, 0.939]
[train epoch 40/100] | loss 0.70767 | nw acc 0.795 | time 2 min 35 sec
cat 0: [926, 78, 60, 89] and [0.8031, 0.0676, 0.052, 0.0772]
cat 1: [80, 2165, 237, 266] and [0.0291, 0.7878, 0.0862, 0.0968]
cat 2: [52, 76, 531, 90] and [0.0694, 0.1015, 0.7089, 0.1202]
cat 3: [117, 222, 137, 2430] and [0.0403, 0.0764, 0.0471, 0.8362]
[test epoch 40/100] | loss 0.246 | nw acc 0.594 | time 0 min 40 sec
cat 0: [138, 17, 2, 16] and [0.7977, 0.0983, 0.0116, 0.0925]
cat 1: [2, 280, 7, 8] and [0.0067, 0.9428, 0.0236, 0.0269]
cat 2: [110, 236, 210, 182] and [0.1491, 0.3198, 0.2846, 0.2466]
cat 3: [44, 103, 22, 513] and [0.0645, 0.151, 0.0323, 0.7522]
[train epoch 41/100] | loss 0.71076 | nw acc 0.792 | time 2 min 39 sec
cat 0: [928, 108, 67, 102] and [0.7701, 0.0896, 0.0556, 0.0846]
cat 1: [83, 2100, 236, 199] and [0.0317, 0.8021, 0.0901, 0.076]
cat 2: [51, 85, 517, 86] and [0.069, 0.115, 0.6996, 0.1164]
cat 3: [113, 248, 145, 2488] and [0.0377, 0.0828, 0.0484, 0.831]
[test epoch 41/100] | loss 0.235 | nw acc 0.657 | time 0 min 39 sec
cat 0: [265, 188, 71, 55] and [0.4577, 0.3247, 0.1226, 0.095]
cat 1: [1, 240, 19, 9] and [0.0037, 0.8922, 0.0706, 0.0335]
cat 2: [3, 33, 130, 29] and [0.0154, 0.1692, 0.6667, 0.1487]
cat 3: [25, 175, 21, 626] and [0.0295, 0.2066, 0.0248, 0.7391]
[train epoch 42/100] | loss 0.70546 | nw acc 0.794 | time 2 min 39 sec
cat 0: [921, 73, 45, 96] and [0.8115, 0.0643, 0.0396, 0.0846]
cat 1: [96, 2164, 231, 250] and [0.035, 0.7895, 0.0843, 0.0912]
cat 2: [43, 73, 530, 97] and [0.0579, 0.0983, 0.7133, 0.1306]
cat 3: [115, 231, 159, 2432] and [0.0392, 0.0787, 0.0541, 0.8281]
[test epoch 42/100] | loss 0.205 | nw acc 0.698 | time 0 min 37 sec
cat 0: [166, 3, 9, 9] and [0.8877, 0.016, 0.0481, 0.0481]
cat 1: [115, 602, 172, 170] and [0.1086, 0.5685, 0.1624, 0.1605]
cat 2: [0, 2, 35, 3] and [0.0, 0.05, 0.875, 0.075]
cat 3: [13, 29, 25, 537] and [0.0215, 0.048, 0.0414, 0.8891]
[train epoch 43/100] | loss 0.70358 | nw acc 0.795 | time 2 min 33 sec
cat 0: [933, 67, 48, 93] and [0.8177, 0.0587, 0.0421, 0.0815]
cat 1: [89, 2138, 245, 235] and [0.0329, 0.7898, 0.0905, 0.0868]
cat 2: [57, 87, 525, 91] and [0.075, 0.1145, 0.6908, 0.1197]
cat 3: [96, 249, 147, 2456] and [0.0326, 0.0845, 0.0499, 0.8331]
[test epoch 43/100] | loss 0.26 | nw acc 0.602 | time 0 min 38 sec
cat 0: [94, 5, 2, 27] and [0.7344, 0.0391, 0.0156, 0.2109]
cat 1: [74, 495, 42, 142] and [0.0983, 0.6574, 0.0558, 0.1886]
cat 2: [123, 122, 193, 177] and [0.2, 0.1984, 0.3138, 0.2878]
cat 3: [3, 14, 4, 373] and [0.0076, 0.0355, 0.0102, 0.9467]
[train epoch 44/100] | loss 0.70211 | nw acc 0.793 | time 2 min 35 sec
cat 0: [948, 81, 47, 92] and [0.8116, 0.0693, 0.0402, 0.0788]
cat 1: [77, 2129, 251, 237] and [0.0286, 0.7903, 0.0932, 0.088]
cat 2: [58, 96, 517, 97] and [0.0755, 0.125, 0.6732, 0.1263]
cat 3: [92, 235, 150, 2449] and [0.0314, 0.0803, 0.0513, 0.837]
[test epoch 44/100] | loss 0.271 | nw acc 0.58 | time 0 min 37 sec
cat 0: [121, 13, 2, 14] and [0.8067, 0.0867, 0.0133, 0.0933]
cat 1: [0, 180, 10, 1] and [0.0, 0.9424, 0.0524, 0.0052]
cat 2: [53, 90, 132, 23] and [0.1779, 0.302, 0.443, 0.0772]
cat 3: [120, 353, 97, 681] and [0.0959, 0.2822, 0.0775, 0.5444]
[train epoch 45/100] | loss 0.6965 | nw acc 0.793 | time 2 min 30 sec
cat 0: [928, 76, 42, 99] and [0.8105, 0.0664, 0.0367, 0.0865]
cat 1: [90, 2135, 249, 237] and [0.0332, 0.7875, 0.0918, 0.0874]
cat 2: [46, 75, 524, 84] and [0.0631, 0.1029, 0.7188, 0.1152]
cat 3: [111, 255, 150, 2455] and [0.0374, 0.0858, 0.0505, 0.8263]
[test epoch 45/100] | loss 0.167 | nw acc 0.815 | time 0 min 40 sec
cat 0: [258, 19, 11, 27] and [0.819, 0.0603, 0.0349, 0.0857]
cat 1: [8, 518, 56, 28] and [0.0131, 0.8492, 0.0918, 0.0459]
cat 2: [9, 20, 148, 24] and [0.0448, 0.0995, 0.7363, 0.1194]
cat 3: [19, 79, 26, 640] and [0.0249, 0.1034, 0.034, 0.8377]
[train epoch 46/100] | loss 0.68869 | nw acc 0.812 | time 2 min 36 sec
cat 0: [978, 82, 43, 81] and [0.826, 0.0693, 0.0363, 0.0684]
cat 1: [65, 2162, 234, 202] and [0.0244, 0.8119, 0.0879, 0.0759]
cat 2: [38, 66, 530, 81] and [0.0531, 0.0923, 0.7413, 0.1133]
cat 3: [94, 231, 158, 2511] and [0.0314, 0.0772, 0.0528, 0.8387]
[test epoch 46/100] | loss 0.183 | nw acc 0.754 | time 0 min 39 sec
cat 0: [167, 4, 3, 8] and [0.9176, 0.022, 0.0165, 0.044]
cat 1: [54, 516, 74, 48] and [0.078, 0.7457, 0.1069, 0.0694]
cat 2: [4, 7, 113, 11] and [0.0296, 0.0519, 0.837, 0.0815]
cat 3: [69, 109, 51, 652] and [0.0783, 0.1237, 0.0579, 0.7401]
[train epoch 47/100] | loss 0.69807 | nw acc 0.797 | time 2 min 36 sec
cat 0: [952, 71, 54, 97] and [0.8109, 0.0605, 0.046, 0.0826]
cat 1: [63, 2141, 237, 212] and [0.0237, 0.807, 0.0893, 0.0799]
cat 2: [49, 78, 504, 96] and [0.0674, 0.1073, 0.6933, 0.132]
cat 3: [111, 251, 170, 2470] and [0.037, 0.0836, 0.0566, 0.8228]
[test epoch 47/100] | loss 0.284 | nw acc 0.546 | time 0 min 37 sec
cat 0: [33, 0, 0, 3] and [0.9167, 0.0, 0.0, 0.0833]
cat 1: [247, 618, 229, 318] and [0.1749, 0.4377, 0.1622, 0.2252]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [14, 18, 12, 398] and [0.0317, 0.0407, 0.0271, 0.9005]
[train epoch 48/100] | loss 0.67782 | nw acc 0.811 | time 2 min 37 sec
cat 0: [960, 59, 51, 86] and [0.8304, 0.051, 0.0441, 0.0744]
cat 1: [66, 2168, 231, 212] and [0.0247, 0.8099, 0.0863, 0.0792]
cat 2: [41, 87, 561, 88] and [0.0528, 0.112, 0.722, 0.1133]
cat 3: [108, 227, 122, 2489] and [0.0367, 0.0771, 0.0414, 0.8449]
[test epoch 48/100] | loss 0.17 | nw acc 0.808 | time 0 min 35 sec
cat 0: [239, 19, 6, 14] and [0.8597, 0.0683, 0.0216, 0.0504]
cat 1: [12, 501, 36, 31] and [0.0207, 0.8638, 0.0621, 0.0534]
cat 2: [21, 39, 177, 39] and [0.0761, 0.1413, 0.6413, 0.1413]
cat 3: [22, 77, 22, 635] and [0.0291, 0.1019, 0.0291, 0.8399]
[train epoch 49/100] | loss 0.67301 | nw acc 0.813 | time 2 min 43 sec
cat 0: [975, 55, 44, 81] and [0.8442, 0.0476, 0.0381, 0.0701]
cat 1: [74, 2180, 235, 213] and [0.0274, 0.8068, 0.087, 0.0788]
cat 2: [43, 66, 539, 84] and [0.0587, 0.0902, 0.7363, 0.1148]
cat 3: [83, 240, 147, 2497] and [0.028, 0.0809, 0.0495, 0.8416]
[test epoch 49/100] | loss 0.199 | nw acc 0.733 | time 0 min 27 sec
cat 0: [179, 4, 10, 11] and [0.8775, 0.0196, 0.049, 0.0539]
cat 1: [79, 590, 138, 119] and [0.0853, 0.6371, 0.149, 0.1285]
cat 2: [2, 1, 51, 2] and [0.0357, 0.0179, 0.9107, 0.0357]
cat 3: [34, 41, 42, 587] and [0.0483, 0.0582, 0.0597, 0.8338]
[train epoch 50/100] | loss 0.67462 | nw acc 0.811 | time 2 min 42 sec
cat 0: [982, 56, 49, 74] and [0.8458, 0.0482, 0.0422, 0.0637]
cat 1: [74, 2163, 237, 237] and [0.0273, 0.7979, 0.0874, 0.0874]
cat 2: [36, 81, 548, 78] and [0.0485, 0.109, 0.7376, 0.105]
cat 3: [83, 241, 131, 2486] and [0.0282, 0.0819, 0.0445, 0.8453]
[test epoch 50/100] | loss 0.254 | nw acc 0.591 | time 0 min 37 sec
cat 0: [247, 172, 30, 225] and [0.3665, 0.2552, 0.0445, 0.3338]
cat 1: [4, 295, 19, 4] and [0.0124, 0.9161, 0.059, 0.0124]
cat 2: [25, 90, 146, 44] and [0.082, 0.2951, 0.4787, 0.1443]
cat 3: [18, 79, 46, 446] and [0.0306, 0.1341, 0.0781, 0.7572]
[train epoch 51/100] | loss 0.68276 | nw acc 0.807 | time 2 min 44 sec
cat 0: [949, 68, 51, 77] and [0.8288, 0.0594, 0.0445, 0.0672]
cat 1: [87, 2148, 236, 206] and [0.0325, 0.8024, 0.0882, 0.077]
cat 2: [42, 82, 529, 75] and [0.0577, 0.1126, 0.7266, 0.103]
cat 3: [97, 243, 149, 2517] and [0.0323, 0.0808, 0.0496, 0.8373]
[test epoch 51/100] | loss 0.246 | nw acc 0.609 | time 0 min 36 sec
cat 0: [93, 0, 0, 5] and [0.949, 0.0, 0.0, 0.051]
cat 1: [174, 535, 195, 173] and [0.1616, 0.4968, 0.1811, 0.1606]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [27, 101, 46, 541] and [0.0378, 0.1413, 0.0643, 0.7566]
[train epoch 52/100] | loss 0.69461 | nw acc 0.803 | time 2 min 36 sec
cat 0: [991, 60, 48, 91] and [0.8328, 0.0504, 0.0403, 0.0765]
cat 1: [49, 2103, 225, 231] and [0.0188, 0.8064, 0.0863, 0.0886]
cat 2: [52, 81, 550, 83] and [0.0679, 0.1057, 0.718, 0.1084]
cat 3: [83, 297, 142, 2470] and [0.0277, 0.0993, 0.0475, 0.8255]
[test epoch 52/100] | loss 0.216 | nw acc 0.676 | time 0 min 38 sec
cat 0: [207, 13, 20, 23] and [0.7871, 0.0494, 0.076, 0.0875]
cat 1: [80, 602, 155, 259] and [0.073, 0.5493, 0.1414, 0.2363]
cat 2: [3, 3, 57, 6] and [0.0435, 0.0435, 0.8261, 0.087]
cat 3: [4, 18, 9, 431] and [0.0087, 0.039, 0.0195, 0.9329]
[train epoch 53/100] | loss 0.67671 | nw acc 0.814 | time 2 min 40 sec
cat 0: [977, 64, 41, 73] and [0.8459, 0.0554, 0.0355, 0.0632]
cat 1: [69, 2171, 236, 226] and [0.0255, 0.8035, 0.0873, 0.0836]
cat 2: [46, 79, 561, 89] and [0.0594, 0.1019, 0.7239, 0.1148]
cat 3: [83, 227, 127, 2487] and [0.0284, 0.0776, 0.0434, 0.8505]
[test epoch 53/100] | loss 0.17 | nw acc 0.806 | time 0 min 29 sec
cat 0: [237, 14, 10, 19] and [0.8464, 0.05, 0.0357, 0.0679]
cat 1: [18, 564, 72, 66] and [0.025, 0.7833, 0.1, 0.0917]
cat 2: [13, 16, 132, 20] and [0.0718, 0.0884, 0.7293, 0.1105]
cat 3: [26, 42, 27, 614] and [0.0367, 0.0592, 0.0381, 0.866]
[train epoch 54/100] | loss 0.665 | nw acc 0.816 | time 2 min 38 sec
cat 0: [973, 55, 31, 86] and [0.8498, 0.048, 0.0271, 0.0751]
cat 1: [68, 2179, 239, 187] and [0.0254, 0.8152, 0.0894, 0.07]
cat 2: [56, 88, 565, 108] and [0.0685, 0.1077, 0.6916, 0.1322]
cat 3: [78, 219, 130, 2494] and [0.0267, 0.075, 0.0445, 0.8538]
[test epoch 54/100] | loss 0.231 | nw acc 0.67 | time 0 min 38 sec
cat 0: [59, 1, 0, 3] and [0.9365, 0.0159, 0.0, 0.0476]
cat 1: [184, 607, 137, 165] and [0.1683, 0.5554, 0.1253, 0.151]
cat 2: [2, 1, 72, 3] and [0.0256, 0.0128, 0.9231, 0.0385]
cat 3: [49, 27, 32, 548] and [0.0747, 0.0412, 0.0488, 0.8354]
[train epoch 55/100] | loss 0.67975 | nw acc 0.81 | time 2 min 37 sec
cat 0: [988, 79, 63, 128] and [0.7854, 0.0628, 0.0501, 0.1017]
cat 1: [66, 2167, 223, 196] and [0.0249, 0.8171, 0.0841, 0.0739]
cat 2: [34, 94, 536, 70] and [0.0463, 0.1281, 0.7302, 0.0954]
cat 3: [87, 201, 143, 2481] and [0.0299, 0.069, 0.0491, 0.852]
[test epoch 55/100] | loss 0.24 | nw acc 0.657 | time 0 min 38 sec
cat 0: [269, 147, 110, 147] and [0.3997, 0.2184, 0.1634, 0.2184]
cat 1: [21, 436, 69, 61] and [0.0358, 0.7428, 0.1175, 0.1039]
cat 2: [0, 8, 55, 10] and [0.0, 0.1096, 0.7534, 0.137]
cat 3: [4, 45, 7, 501] and [0.0072, 0.0808, 0.0126, 0.8995]
[train epoch 56/100] | loss 0.68248 | nw acc 0.809 | time 2 min 39 sec
cat 0: [970, 90, 44, 92] and [0.811, 0.0753, 0.0368, 0.0769]
cat 1: [81, 2143, 229, 211] and [0.0304, 0.8044, 0.086, 0.0792]
cat 2: [44, 86, 548, 75] and [0.0584, 0.1142, 0.7278, 0.0996]
cat 3: [80, 222, 144, 2497] and [0.0272, 0.0754, 0.0489, 0.8485]
[test epoch 56/100] | loss 0.276 | nw acc 0.599 | time 0 min 37 sec
cat 0: [138, 0, 0, 10] and [0.9324, 0.0, 0.0, 0.0676]
cat 1: [104, 619, 85, 384] and [0.0872, 0.5193, 0.0713, 0.3221]
cat 2: [45, 14, 151, 83] and [0.1536, 0.0478, 0.5154, 0.2833]
cat 3: [7, 3, 5, 242] and [0.0272, 0.0117, 0.0195, 0.9416]
[train epoch 57/100] | loss 0.66587 | nw acc 0.821 | time 2 min 38 sec
cat 0: [995, 68, 48, 78] and [0.8368, 0.0572, 0.0404, 0.0656]
cat 1: [58, 2194, 220, 211] and [0.0216, 0.8177, 0.082, 0.0786]
cat 2: [42, 69, 569, 93] and [0.0543, 0.0893, 0.7361, 0.1203]
cat 3: [80, 210, 128, 2493] and [0.0275, 0.0721, 0.044, 0.8564]
[test epoch 57/100] | loss 0.182 | nw acc 0.778 | time 0 min 45 sec
cat 0: [246, 32, 9, 18] and [0.8066, 0.1049, 0.0295, 0.059]
cat 1: [6, 469, 31, 26] and [0.0113, 0.8816, 0.0583, 0.0489]
cat 2: [21, 60, 187, 83] and [0.0598, 0.1709, 0.5328, 0.2365]
cat 3: [21, 75, 14, 592] and [0.0299, 0.1068, 0.0199, 0.8433]
[train epoch 58/100] | loss 0.68606 | nw acc 0.807 | time 2 min 47 sec
cat 0: [973, 82, 58, 105] and [0.7989, 0.0673, 0.0476, 0.0862]
cat 1: [82, 2148, 221, 214] and [0.0308, 0.806, 0.0829, 0.0803]
cat 2: [39, 81, 548, 78] and [0.0523, 0.1086, 0.7346, 0.1046]
cat 3: [81, 230, 138, 2478] and [0.0277, 0.0786, 0.0471, 0.8466]
[test epoch 58/100] | loss 0.189 | nw acc 0.755 | time 0 min 39 sec
cat 0: [181, 17, 10, 18] and [0.8009, 0.0752, 0.0442, 0.0796]
cat 1: [26, 520, 35, 39] and [0.0419, 0.8387, 0.0565, 0.0629]
cat 2: [30, 41, 142, 56] and [0.1115, 0.1524, 0.5279, 0.2082]
cat 3: [57, 58, 54, 606] and [0.0735, 0.0748, 0.0697, 0.7819]
[train epoch 59/100] | loss 0.65583 | nw acc 0.825 | time 2 min 37 sec
cat 0: [997, 48, 37, 75] and [0.8617, 0.0415, 0.032, 0.0648]
cat 1: [63, 2200, 231, 174] and [0.0236, 0.8246, 0.0866, 0.0652]
cat 2: [39, 71, 555, 92] and [0.0515, 0.0938, 0.7332, 0.1215]
cat 3: [76, 222, 142, 2534] and [0.0256, 0.0746, 0.0477, 0.8521]
[test epoch 59/100] | loss 0.228 | nw acc 0.658 | time 0 min 39 sec
cat 0: [276, 180, 55, 102] and [0.4502, 0.2936, 0.0897, 0.1664]
cat 1: [5, 296, 14, 37] and [0.0142, 0.8409, 0.0398, 0.1051]
cat 2: [8, 95, 158, 47] and [0.026, 0.3084, 0.513, 0.1526]
cat 3: [5, 65, 14, 533] and [0.0081, 0.1053, 0.0227, 0.8639]
[train epoch 60/100] | loss 0.66245 | nw acc 0.817 | time 2 min 41 sec
cat 0: [1000, 69, 45, 80] and [0.8375, 0.0578, 0.0377, 0.067]
cat 1: [53, 2170, 216, 197] and [0.0201, 0.8232, 0.0819, 0.0747]
cat 2: [43, 71, 549, 98] and [0.0565, 0.0933, 0.7214, 0.1288]
cat 3: [79, 231, 155, 2500] and [0.0266, 0.0779, 0.0523, 0.8432]
[test epoch 60/100] | loss 0.193 | nw acc 0.739 | time 0 min 39 sec
cat 0: [228, 6, 21, 14] and [0.8476, 0.0223, 0.0781, 0.052]
cat 1: [16, 420, 52, 22] and [0.0314, 0.8235, 0.102, 0.0431]
cat 2: [5, 16, 96, 9] and [0.0397, 0.127, 0.7619, 0.0714]
cat 3: [45, 194, 72, 674] and [0.0457, 0.197, 0.0731, 0.6843]
[train epoch 61/100] | loss 0.65098 | nw acc 0.832 | time 2 min 34 sec
cat 0: [1014, 48, 32, 78] and [0.8652, 0.041, 0.0273, 0.0666]
cat 1: [47, 2206, 222, 192] and [0.0176, 0.8271, 0.0832, 0.072]
cat 2: [34, 70, 584, 76] and [0.0445, 0.0916, 0.7644, 0.0995]
cat 3: [80, 217, 127, 2529] and [0.0271, 0.0735, 0.043, 0.8564]
[test epoch 61/100] | loss 0.188 | nw acc 0.743 | time 0 min 39 sec
cat 0: [201, 3, 6, 15] and [0.8933, 0.0133, 0.0267, 0.0667]
cat 1: [83, 611, 129, 166] and [0.0839, 0.6178, 0.1304, 0.1678]
cat 2: [2, 6, 85, 8] and [0.0198, 0.0594, 0.8416, 0.0792]
cat 3: [8, 16, 21, 530] and [0.0139, 0.0278, 0.0365, 0.9217]
[train epoch 62/100] | loss 0.63895 | nw acc 0.83 | time 2 min 38 sec
cat 0: [999, 50, 45, 88] and [0.8452, 0.0423, 0.0381, 0.0745]
cat 1: [61, 2240, 215, 203] and [0.0224, 0.8238, 0.0791, 0.0747]
cat 2: [45, 73, 592, 95] and [0.0559, 0.0907, 0.7354, 0.118]
cat 3: [70, 178, 113, 2489] and [0.0246, 0.0625, 0.0396, 0.8733]
[test epoch 62/100] | loss 0.336 | nw acc 0.419 | time 0 min 39 sec
cat 0: [2, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [279, 633, 240, 550] and [0.1639, 0.3719, 0.141, 0.3231]
cat 2: [1, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 3: [12, 3, 1, 169] and [0.0649, 0.0162, 0.0054, 0.9135]
[train epoch 63/100] | loss 0.63295 | nw acc 0.838 | time 2 min 36 sec
cat 0: [1008, 35, 27, 77] and [0.8788, 0.0305, 0.0235, 0.0671]
cat 1: [50, 2243, 219, 179] and [0.0186, 0.8335, 0.0814, 0.0665]
cat 2: [34, 67, 602, 86] and [0.0431, 0.0849, 0.763, 0.109]
cat 3: [83, 196, 117, 2533] and [0.0283, 0.0669, 0.0399, 0.8648]
[test epoch 63/100] | loss 0.202 | nw acc 0.709 | time 0 min 38 sec
cat 0: [148, 3, 3, 8] and [0.9136, 0.0185, 0.0185, 0.0494]
cat 1: [130, 600, 172, 126] and [0.1265, 0.5837, 0.1673, 0.1226]
cat 2: [0, 1, 29, 0] and [0.0, 0.0333, 0.9667, 0.0]
cat 3: [16, 32, 37, 585] and [0.0239, 0.0478, 0.0552, 0.8731]
