BenchMarkAug(
  (conv1): Conv2d(1, 3, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (pool1): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (drop1): Dropout2d(p=0.2)
  (conv2): Conv2d(3, 16, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (pool2): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (drop2): Dropout2d(p=0.2)
  (conv3): Conv2d(16, 64, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (pool3): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (drop3): Dropout2d(p=0.2)
  (fc1): Linear(in_features=576, out_features=4, bias=True)
)
[train epoch 1/100] | loss 1.3082 | nw acc 0.374 | time 2 min 33 sec
cat 0: [6, 11, 1, 9] and [0.2222, 0.4074, 0.037, 0.3333]
cat 1: [141, 297, 122, 323] and [0.1597, 0.3364, 0.1382, 0.3658]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1028, 2233, 842, 2543] and [0.1547, 0.336, 0.1267, 0.3826]
[test epoch 1/100] | loss 0.326 | nw acc 0.374 | time 1 min 21 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [294, 636, 241, 719] and [0.1556, 0.3365, 0.1275, 0.3804]
[train epoch 2/100] | loss 1.2999 | nw acc 0.376 | time 1 min 18 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [24, 33, 16, 47] and [0.2, 0.275, 0.1333, 0.3917]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [1151, 2508, 949, 2828] and [0.1548, 0.3373, 0.1276, 0.3803]
[test epoch 2/100] | loss 0.323 | nw acc 0.374 | time 0 min 22 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [294, 636, 241, 719] and [0.1556, 0.3365, 0.1275, 0.3804]
[train epoch 3/100] | loss 1.2802 | nw acc 0.415 | time 1 min 29 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [504, 1009, 411, 727] and [0.1901, 0.3806, 0.155, 0.2742]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [671, 1532, 554, 2148] and [0.1368, 0.3123, 0.1129, 0.4379]
[test epoch 3/100] | loss 0.318 | nw acc 0.429 | time 0 min 28 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [203, 447, 179, 343] and [0.1732, 0.3814, 0.1527, 0.2927]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [91, 189, 62, 376] and [0.1267, 0.2632, 0.0864, 0.5237]
[train epoch 4/100] | loss 1.2692 | nw acc 0.428 | time 2 min 2 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [714, 1582, 621, 1199] and [0.1735, 0.3844, 0.1509, 0.2913]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [461, 959, 344, 1676] and [0.134, 0.2788, 0.1, 0.4872]
[test epoch 4/100] | loss 0.316 | nw acc 0.433 | time 0 min 33 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [167, 326, 134, 213] and [0.1988, 0.3881, 0.1595, 0.2536]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [127, 310, 107, 506] and [0.121, 0.2952, 0.1019, 0.4819]
[train epoch 5/100] | loss 1.2622 | nw acc 0.436 | time 2 min 26 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [712, 1489, 595, 1041] and [0.1856, 0.3881, 0.1551, 0.2713]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [463, 1052, 370, 1834] and [0.1245, 0.2829, 0.0995, 0.4931]
[test epoch 5/100] | loss 0.315 | nw acc 0.44 | time 0 min 37 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [167, 350, 146, 225] and [0.1881, 0.3941, 0.1644, 0.2534]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [127, 286, 95, 494] and [0.1267, 0.2854, 0.0948, 0.493]
[train epoch 6/100] | loss 1.2644 | nw acc 0.433 | time 2 min 33 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [739, 1553, 590, 1134] and [0.184, 0.3867, 0.1469, 0.2824]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [436, 988, 375, 1741] and [0.1232, 0.2791, 0.1059, 0.4918]
[test epoch 6/100] | loss 0.315 | nw acc 0.436 | time 0 min 40 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [174, 337, 132, 218] and [0.2021, 0.3914, 0.1533, 0.2532]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [120, 299, 109, 501] and [0.1166, 0.2906, 0.1059, 0.4869]
[train epoch 7/100] | loss 1.2636 | nw acc 0.431 | time 2 min 28 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [721, 1482, 554, 1071] and [0.1883, 0.3871, 0.1447, 0.2798]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [454, 1059, 411, 1804] and [0.1218, 0.2841, 0.1102, 0.4839]
[test epoch 7/100] | loss 0.316 | nw acc 0.431 | time 0 min 37 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [185, 382, 152, 274] and [0.1863, 0.3847, 0.1531, 0.2759]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [109, 254, 89, 445] and [0.1215, 0.2832, 0.0992, 0.4961]
[train epoch 8/100] | loss 1.261 | nw acc 0.434 | time 2 min 35 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [707, 1504, 566, 1071] and [0.1837, 0.3909, 0.1471, 0.2783]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [468, 1037, 399, 1804] and [0.1262, 0.2797, 0.1076, 0.4865]
[test epoch 8/100] | loss 0.315 | nw acc 0.429 | time 0 min 40 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [188, 357, 136, 253] and [0.2013, 0.3822, 0.1456, 0.2709]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [106, 279, 105, 466] and [0.1109, 0.2918, 0.1098, 0.4874]
[train epoch 9/100] | loss 1.256 | nw acc 0.437 | time 2 min 38 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [674, 1423, 542, 971] and [0.1867, 0.3942, 0.1501, 0.269]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [501, 1118, 423, 1904] and [0.127, 0.2833, 0.1072, 0.4825]
[test epoch 9/100] | loss 0.314 | nw acc 0.43 | time 0 min 37 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [164, 313, 129, 207] and [0.2017, 0.385, 0.1587, 0.2546]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [130, 323, 112, 512] and [0.1207, 0.2999, 0.104, 0.4754]
[train epoch 10/100] | loss 1.2523 | nw acc 0.436 | time 2 min 38 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [669, 1412, 534, 969] and [0.1867, 0.394, 0.149, 0.2704]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [506, 1129, 431, 1906] and [0.1274, 0.2842, 0.1085, 0.4799]
[test epoch 10/100] | loss 0.312 | nw acc 0.435 | time 0 min 38 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [164, 318, 126, 202] and [0.2025, 0.3926, 0.1556, 0.2494]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [130, 318, 115, 517] and [0.1204, 0.2944, 0.1065, 0.4787]
[train epoch 11/100] | loss 1.2574 | nw acc 0.429 | time 2 min 38 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [676, 1338, 528, 949] and [0.1936, 0.3833, 0.1512, 0.2718]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [499, 1203, 437, 1926] and [0.1228, 0.2959, 0.1075, 0.4738]
[test epoch 11/100] | loss 0.312 | nw acc 0.418 | time 0 min 39 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [160, 277, 114, 193] and [0.2151, 0.3723, 0.1532, 0.2594]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [134, 359, 127, 526] and [0.1169, 0.3133, 0.1108, 0.459]
[train epoch 12/100] | loss 1.2467 | nw acc 0.434 | time 2 min 36 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [637, 1364, 520, 931] and [0.1845, 0.3951, 0.1506, 0.2697]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [538, 1177, 445, 1944] and [0.1311, 0.2868, 0.1084, 0.4737]
[test epoch 12/100] | loss 0.309 | nw acc 0.43 | time 0 min 37 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [151, 274, 119, 167] and [0.2124, 0.3854, 0.1674, 0.2349]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [143, 362, 122, 552] and [0.1213, 0.307, 0.1035, 0.4682]
[train epoch 13/100] | loss 1.2438 | nw acc 0.436 | time 2 min 34 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [660, 1424, 550, 981] and [0.1826, 0.3939, 0.1521, 0.2714]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [515, 1117, 415, 1894] and [0.1307, 0.2834, 0.1053, 0.4806]
[test epoch 13/100] | loss 0.311 | nw acc 0.432 | time 0 min 38 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [171, 328, 129, 218] and [0.2021, 0.3877, 0.1525, 0.2577]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [123, 308, 112, 501] and [0.1178, 0.295, 0.1073, 0.4799]
[train epoch 14/100] | loss 1.2419 | nw acc 0.429 | time 2 min 36 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [634, 1403, 543, 1013] and [0.1765, 0.3905, 0.1511, 0.2819]
cat 2: [0, 2, 1, 0] and [0.0, 0.6667, 0.3333, 0.0]
cat 3: [541, 1136, 421, 1862] and [0.1366, 0.2869, 0.1063, 0.4702]
[test epoch 14/100] | loss 0.309 | nw acc 0.439 | time 0 min 39 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [157, 320, 126, 197] and [0.1963, 0.4, 0.1575, 0.2462]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [137, 316, 115, 522] and [0.1257, 0.2899, 0.1055, 0.4789]
[train epoch 15/100] | loss 1.2354 | nw acc 0.43 | time 2 min 34 sec
cat 0: [1, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [667, 1499, 611, 1099] and [0.1721, 0.3867, 0.1576, 0.2835]
cat 2: [0, 1, 1, 1] and [0.0, 0.3333, 0.3333, 0.3333]
cat 3: [507, 1041, 353, 1775] and [0.1379, 0.2832, 0.096, 0.4829]
[test epoch 15/100] | loss 0.31 | nw acc 0.422 | time 0 min 37 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [163, 300, 130, 209] and [0.2032, 0.3741, 0.1621, 0.2606]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [131, 336, 111, 510] and [0.1204, 0.3088, 0.102, 0.4688]
[train epoch 16/100] | loss 1.2373 | nw acc 0.424 | time 2 min 36 sec
cat 0: [12, 3, 0, 11] and [0.4615, 0.1154, 0.0, 0.4231]
cat 1: [639, 1401, 604, 1048] and [0.1731, 0.3795, 0.1636, 0.2839]
cat 2: [1, 2, 1, 2] and [0.1667, 0.3333, 0.1667, 0.3333]
cat 3: [523, 1135, 360, 1814] and [0.1365, 0.2962, 0.0939, 0.4734]
[test epoch 16/100] | loss 0.304 | nw acc 0.428 | time 0 min 37 sec
cat 0: [2, 2, 0, 1] and [0.4, 0.4, 0.0, 0.2]
cat 1: [154, 289, 128, 188] and [0.2029, 0.3808, 0.1686, 0.2477]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [138, 345, 113, 530] and [0.1226, 0.3064, 0.1004, 0.4707]
[train epoch 17/100] | loss 1.2273 | nw acc 0.435 | time 2 min 34 sec
cat 0: [59, 14, 5, 44] and [0.4836, 0.1148, 0.041, 0.3607]
cat 1: [612, 1391, 575, 971] and [0.1724, 0.3919, 0.162, 0.2736]
cat 2: [0, 2, 1, 0] and [0.0, 0.6667, 0.3333, 0.0]
cat 3: [504, 1134, 384, 1860] and [0.1298, 0.2921, 0.0989, 0.4791]
[test epoch 17/100] | loss 0.305 | nw acc 0.435 | time 0 min 39 sec
cat 0: [6, 1, 0, 2] and [0.6667, 0.1111, 0.0, 0.2222]
cat 1: [158, 314, 138, 201] and [0.1948, 0.3872, 0.1702, 0.2478]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [130, 321, 103, 516] and [0.1215, 0.3, 0.0963, 0.4822]
[train epoch 18/100] | loss 1.2209 | nw acc 0.437 | time 2 min 34 sec
cat 0: [80, 17, 7, 51] and [0.5161, 0.1097, 0.0452, 0.329]
cat 1: [649, 1394, 566, 971] and [0.1813, 0.3894, 0.1581, 0.2712]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [446, 1130, 392, 1853] and [0.1167, 0.2957, 0.1026, 0.485]
[test epoch 18/100] | loss 0.305 | nw acc 0.443 | time 0 min 39 sec
cat 0: [45, 19, 2, 24] and [0.5, 0.2111, 0.0222, 0.2667]
cat 1: [153, 304, 128, 194] and [0.1964, 0.3902, 0.1643, 0.249]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [96, 313, 111, 501] and [0.094, 0.3066, 0.1087, 0.4907]
[train epoch 19/100] | loss 1.2219 | nw acc 0.438 | time 2 min 32 sec
cat 0: [124, 32, 10, 90] and [0.4844, 0.125, 0.0391, 0.3516]
cat 1: [636, 1422, 570, 998] and [0.1754, 0.3922, 0.1572, 0.2752]
cat 2: [2, 4, 0, 1] and [0.2857, 0.5714, 0.0, 0.1429]
cat 3: [413, 1083, 385, 1786] and [0.1126, 0.2953, 0.105, 0.487]
[test epoch 19/100] | loss 0.304 | nw acc 0.437 | time 0 min 38 sec
cat 0: [37, 12, 1, 25] and [0.4933, 0.16, 0.0133, 0.3333]
cat 1: [162, 341, 137, 233] and [0.1856, 0.3906, 0.1569, 0.2669]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [95, 283, 103, 461] and [0.1008, 0.3004, 0.1093, 0.4894]
[train epoch 20/100] | loss 1.2234 | nw acc 0.436 | time 2 min 35 sec
cat 0: [109, 30, 6, 69] and [0.5093, 0.1402, 0.028, 0.3224]
cat 1: [641, 1381, 549, 975] and [0.1808, 0.3895, 0.1548, 0.275]
cat 2: [0, 0, 2, 1] and [0.0, 0.0, 0.6667, 0.3333]
cat 3: [425, 1130, 408, 1830] and [0.112, 0.2979, 0.1076, 0.4825]
[test epoch 20/100] | loss 0.302 | nw acc 0.437 | time 0 min 38 sec
cat 0: [34, 11, 0, 19] and [0.5312, 0.1719, 0.0, 0.2969]
cat 1: [174, 350, 152, 245] and [0.1889, 0.38, 0.165, 0.266]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [86, 275, 89, 455] and [0.095, 0.3039, 0.0983, 0.5028]
[train epoch 21/100] | loss 1.2205 | nw acc 0.438 | time 2 min 34 sec
cat 0: [124, 47, 11, 90] and [0.4559, 0.1728, 0.0404, 0.3309]
cat 1: [644, 1396, 526, 973] and [0.182, 0.3945, 0.1486, 0.2749]
cat 2: [0, 1, 2, 1] and [0.0, 0.25, 0.5, 0.25]
cat 3: [407, 1097, 426, 1811] and [0.1088, 0.2932, 0.1139, 0.4841]
[test epoch 21/100] | loss 0.301 | nw acc 0.457 | time 0 min 40 sec
cat 0: [76, 43, 4, 49] and [0.4419, 0.25, 0.0233, 0.2849]
cat 1: [153, 309, 132, 177] and [0.1984, 0.4008, 0.1712, 0.2296]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [65, 284, 105, 493] and [0.0686, 0.2999, 0.1109, 0.5206]
[train epoch 22/100] | loss 1.2211 | nw acc 0.441 | time 2 min 36 sec
cat 0: [179, 52, 16, 88] and [0.5343, 0.1552, 0.0478, 0.2627]
cat 1: [628, 1311, 552, 919] and [0.1842, 0.3845, 0.1619, 0.2695]
cat 2: [1, 1, 1, 0] and [0.3333, 0.3333, 0.3333, 0.0]
cat 3: [367, 1177, 396, 1868] and [0.0964, 0.3091, 0.104, 0.4905]
[test epoch 22/100] | loss 0.3 | nw acc 0.446 | time 0 min 37 sec
cat 0: [45, 13, 0, 23] and [0.5556, 0.1605, 0.0, 0.284]
cat 1: [158, 289, 123, 173] and [0.2127, 0.389, 0.1655, 0.2328]
cat 2: [0, 0, 0, 1] and [0.0, 0.0, 0.0, 1.0]
cat 3: [91, 334, 118, 522] and [0.0854, 0.3136, 0.1108, 0.4901]
[train epoch 23/100] | loss 1.2151 | nw acc 0.43 | time 2 min 34 sec
cat 0: [191, 84, 15, 120] and [0.4659, 0.2049, 0.0366, 0.2927]
cat 1: [614, 1251, 519, 924] and [0.1856, 0.3782, 0.1569, 0.2793]
cat 2: [1, 7, 4, 4] and [0.0625, 0.4375, 0.25, 0.25]
cat 3: [369, 1199, 427, 1827] and [0.0965, 0.3137, 0.1117, 0.478]
[test epoch 23/100] | loss 0.3 | nw acc 0.454 | time 0 min 40 sec
cat 0: [77, 39, 3, 40] and [0.4843, 0.2453, 0.0189, 0.2516]
cat 1: [161, 310, 142, 195] and [0.1993, 0.3837, 0.1757, 0.2413]
cat 2: [0, 0, 1, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [56, 287, 95, 484] and [0.0607, 0.3113, 0.103, 0.5249]
[train epoch 24/100] | loss 1.2158 | nw acc 0.444 | time 2 min 32 sec
cat 0: [188, 92, 20, 112] and [0.4563, 0.2233, 0.0485, 0.2718]
cat 1: [634, 1330, 552, 902] and [0.1855, 0.3891, 0.1615, 0.2639]
cat 2: [0, 2, 2, 2] and [0.0, 0.3333, 0.3333, 0.3333]
cat 3: [353, 1117, 391, 1859] and [0.0949, 0.3003, 0.1051, 0.4997]
[test epoch 24/100] | loss 0.298 | nw acc 0.465 | time 0 min 36 sec
cat 0: [65, 32, 3, 22] and [0.5328, 0.2623, 0.0246, 0.1803]
cat 1: [154, 305, 127, 174] and [0.2026, 0.4013, 0.1671, 0.2289]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [75, 299, 111, 523] and [0.0744, 0.2966, 0.1101, 0.5188]
[train epoch 25/100] | loss 1.2033 | nw acc 0.449 | time 2 min 37 sec
cat 0: [242, 115, 29, 128] and [0.4708, 0.2237, 0.0564, 0.249]
cat 1: [617, 1327, 529, 900] and [0.1829, 0.3934, 0.1568, 0.2668]
cat 2: [2, 5, 8, 3] and [0.1111, 0.2778, 0.4444, 0.1667]
cat 3: [314, 1094, 399, 1844] and [0.086, 0.2996, 0.1093, 0.5051]
[test epoch 25/100] | loss 0.298 | nw acc 0.458 | time 0 min 38 sec
cat 0: [92, 62, 11, 64] and [0.4017, 0.2707, 0.048, 0.2795]
cat 1: [145, 304, 128, 173] and [0.1933, 0.4053, 0.1707, 0.2307]
cat 2: [0, 2, 3, 1] and [0.0, 0.3333, 0.5, 0.1667]
cat 3: [57, 268, 99, 481] and [0.063, 0.2961, 0.1094, 0.5315]
[train epoch 26/100] | loss 1.2045 | nw acc 0.449 | time 2 min 35 sec
cat 0: [268, 120, 28, 151] and [0.4727, 0.2116, 0.0494, 0.2663]
cat 1: [588, 1294, 494, 863] and [0.1815, 0.3995, 0.1525, 0.2664]
cat 2: [0, 6, 6, 6] and [0.0, 0.3333, 0.3333, 0.3333]
cat 3: [319, 1121, 437, 1855] and [0.0855, 0.3004, 0.1171, 0.4971]
[test epoch 26/100] | loss 0.297 | nw acc 0.459 | time 0 min 38 sec
cat 0: [93, 46, 10, 46] and [0.4769, 0.2359, 0.0513, 0.2359]
cat 1: [149, 305, 127, 190] and [0.1933, 0.3956, 0.1647, 0.2464]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [52, 285, 104, 483] and [0.0563, 0.3084, 0.1126, 0.5227]
[train epoch 27/100] | loss 1.2022 | nw acc 0.453 | time 2 min 33 sec
cat 0: [329, 160, 45, 163] and [0.472, 0.2296, 0.0646, 0.2339]
cat 1: [555, 1261, 502, 853] and [0.175, 0.3977, 0.1583, 0.269]
cat 2: [0, 4, 3, 5] and [0.0, 0.3333, 0.25, 0.4167]
cat 3: [291, 1116, 415, 1854] and [0.0792, 0.3036, 0.1129, 0.5044]
[test epoch 27/100] | loss 0.296 | nw acc 0.449 | time 0 min 39 sec
cat 0: [65, 36, 3, 24] and [0.5078, 0.2812, 0.0234, 0.1875]
cat 1: [140, 276, 133, 174] and [0.1936, 0.3817, 0.184, 0.2407]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [89, 324, 105, 521] and [0.0857, 0.3118, 0.1011, 0.5014]
[train epoch 28/100] | loss 1.1959 | nw acc 0.452 | time 2 min 33 sec
cat 0: [259, 147, 44, 126] and [0.4497, 0.2552, 0.0764, 0.2188]
cat 1: [590, 1276, 523, 840] and [0.1827, 0.3952, 0.162, 0.2601]
cat 2: [2, 1, 1, 6] and [0.2, 0.1, 0.1, 0.6]
cat 3: [324, 1117, 397, 1903] and [0.0866, 0.2986, 0.1061, 0.5087]
[test epoch 28/100] | loss 0.298 | nw acc 0.456 | time 0 min 38 sec
cat 0: [64, 26, 7, 33] and [0.4923, 0.2, 0.0538, 0.2538]
cat 1: [173, 348, 148, 223] and [0.1939, 0.3901, 0.1659, 0.25]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [57, 262, 86, 463] and [0.0657, 0.3018, 0.0991, 0.5334]
[train epoch 29/100] | loss 1.1937 | nw acc 0.451 | time 2 min 32 sec
cat 0: [307, 191, 48, 137] and [0.4495, 0.2796, 0.0703, 0.2006]
cat 1: [580, 1269, 509, 880] and [0.1791, 0.3919, 0.1572, 0.2718]
cat 2: [1, 2, 4, 4] and [0.0909, 0.1818, 0.3636, 0.3636]
cat 3: [287, 1079, 404, 1854] and [0.0792, 0.2977, 0.1115, 0.5116]
[test epoch 29/100] | loss 0.295 | nw acc 0.459 | time 0 min 37 sec
cat 0: [109, 65, 8, 57] and [0.4561, 0.272, 0.0335, 0.2385]
cat 1: [147, 300, 121, 193] and [0.1932, 0.3942, 0.159, 0.2536]
cat 2: [1, 1, 3, 0] and [0.2, 0.2, 0.6, 0.0]
cat 3: [37, 270, 109, 469] and [0.0418, 0.3051, 0.1232, 0.5299]
[train epoch 30/100] | loss 1.1976 | nw acc 0.445 | time 2 min 37 sec
cat 0: [288, 167, 39, 141] and [0.4535, 0.263, 0.0614, 0.222]
cat 1: [593, 1220, 523, 852] and [0.186, 0.3827, 0.1641, 0.2673]
cat 2: [1, 3, 5, 4] and [0.0769, 0.2308, 0.3846, 0.3077]
cat 3: [293, 1151, 398, 1878] and [0.0788, 0.3094, 0.107, 0.5048]
[test epoch 30/100] | loss 0.295 | nw acc 0.456 | time 0 min 40 sec
cat 0: [58, 29, 3, 23] and [0.5133, 0.2566, 0.0265, 0.2035]
cat 1: [168, 304, 134, 183] and [0.2129, 0.3853, 0.1698, 0.2319]
cat 2: [0, 1, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 3: [68, 302, 104, 513] and [0.0689, 0.306, 0.1054, 0.5198]
[train epoch 31/100] | loss 1.1961 | nw acc 0.456 | time 2 min 38 sec
cat 0: [305, 168, 56, 145] and [0.4525, 0.2493, 0.0831, 0.2151]
cat 1: [611, 1270, 488, 825] and [0.1913, 0.3976, 0.1528, 0.2583]
cat 2: [0, 2, 2, 7] and [0.0, 0.1818, 0.1818, 0.6364]
cat 3: [259, 1101, 419, 1898] and [0.0704, 0.2994, 0.114, 0.5162]
[test epoch 31/100] | loss 0.295 | nw acc 0.457 | time 0 min 39 sec
cat 0: [82, 35, 13, 35] and [0.497, 0.2121, 0.0788, 0.2121]
cat 1: [163, 330, 138, 218] and [0.192, 0.3887, 0.1625, 0.2568]
cat 2: [0, 1, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 3: [49, 270, 90, 466] and [0.056, 0.3086, 0.1029, 0.5326]
[train epoch 32/100] | loss 1.1941 | nw acc 0.449 | time 2 min 32 sec
cat 0: [284, 155, 44, 123] and [0.4686, 0.2558, 0.0726, 0.203]
cat 1: [579, 1248, 516, 857] and [0.1809, 0.39, 0.1613, 0.2678]
cat 2: [0, 4, 1, 5] and [0.0, 0.4, 0.1, 0.5]
cat 3: [312, 1134, 404, 1890] and [0.0834, 0.3032, 0.108, 0.5053]
[test epoch 32/100] | loss 0.294 | nw acc 0.454 | time 0 min 40 sec
cat 0: [77, 43, 17, 28] and [0.4667, 0.2606, 0.103, 0.1697]
cat 1: [140, 263, 122, 164] and [0.2032, 0.3817, 0.1771, 0.238]
cat 2: [0, 2, 5, 1] and [0.0, 0.25, 0.625, 0.125]
cat 3: [77, 328, 97, 526] and [0.0749, 0.3191, 0.0944, 0.5117]
[train epoch 33/100] | loss 1.1887 | nw acc 0.454 | time 2 min 32 sec
cat 0: [305, 168, 77, 117] and [0.4573, 0.2519, 0.1154, 0.1754]
cat 1: [580, 1246, 494, 850] and [0.183, 0.3931, 0.1558, 0.2681]
cat 2: [0, 7, 5, 4] and [0.0, 0.4375, 0.3125, 0.25]
cat 3: [290, 1120, 389, 1904] and [0.0783, 0.3025, 0.105, 0.5142]
[test epoch 33/100] | loss 0.296 | nw acc 0.461 | time 0 min 36 sec
cat 0: [94, 46, 10, 35] and [0.5081, 0.2486, 0.0541, 0.1892]
cat 1: [120, 247, 114, 141] and [0.1929, 0.3971, 0.1833, 0.2267]
cat 2: [0, 4, 1, 0] and [0.0, 0.8, 0.2, 0.0]
cat 3: [80, 339, 116, 543] and [0.0742, 0.3145, 0.1076, 0.5037]
[train epoch 34/100] | loss 1.1885 | nw acc 0.446 | time 2 min 37 sec
cat 0: [304, 174, 47, 152] and [0.449, 0.257, 0.0694, 0.2245]
cat 1: [588, 1185, 491, 815] and [0.191, 0.3849, 0.1595, 0.2647]
cat 2: [0, 3, 2, 4] and [0.0, 0.3333, 0.2222, 0.4444]
cat 3: [283, 1179, 425, 1904] and [0.0747, 0.311, 0.1121, 0.5022]
[test epoch 34/100] | loss 0.293 | nw acc 0.454 | time 0 min 38 sec
cat 0: [64, 33, 3, 28] and [0.5, 0.2578, 0.0234, 0.2188]
cat 1: [160, 292, 129, 175] and [0.2116, 0.3862, 0.1706, 0.2315]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [70, 311, 109, 516] and [0.0696, 0.3091, 0.1083, 0.5129]
[train epoch 35/100] | loss 1.1937 | nw acc 0.457 | time 2 min 30 sec
cat 0: [304, 173, 68, 119] and [0.4578, 0.2605, 0.1024, 0.1792]
cat 1: [566, 1239, 485, 822] and [0.1819, 0.3981, 0.1558, 0.2641]
cat 2: [0, 3, 1, 1] and [0.0, 0.6, 0.2, 0.2]
cat 3: [305, 1126, 411, 1933] and [0.0808, 0.2983, 0.1089, 0.5121]
[test epoch 35/100] | loss 0.292 | nw acc 0.464 | time 0 min 39 sec
cat 0: [90, 37, 9, 41] and [0.5085, 0.209, 0.0508, 0.2316]
cat 1: [142, 308, 128, 186] and [0.1859, 0.4031, 0.1675, 0.2435]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [62, 291, 104, 492] and [0.0653, 0.3066, 0.1096, 0.5184]
[train epoch 36/100] | loss 1.179 | nw acc 0.459 | time 2 min 37 sec
cat 0: [351, 182, 52, 146] and [0.4802, 0.249, 0.0711, 0.1997]
cat 1: [559, 1216, 490, 795] and [0.1827, 0.3974, 0.1601, 0.2598]
cat 2: [2, 6, 9, 11] and [0.0714, 0.2143, 0.3214, 0.3929]
cat 3: [263, 1137, 414, 1923] and [0.0704, 0.3043, 0.1108, 0.5146]
[test epoch 36/100] | loss 0.291 | nw acc 0.475 | time 0 min 38 sec
cat 0: [97, 52, 8, 49] and [0.4709, 0.2524, 0.0388, 0.2379]
cat 1: [150, 332, 130, 186] and [0.188, 0.416, 0.1629, 0.2331]
cat 2: [0, 1, 0, 1] and [0.0, 0.5, 0.0, 0.5]
cat 3: [47, 251, 103, 483] and [0.0532, 0.2839, 0.1165, 0.5464]
[train epoch 37/100] | loss 1.1895 | nw acc 0.452 | time 2 min 35 sec
cat 0: [303, 155, 38, 114] and [0.4967, 0.2541, 0.0623, 0.1869]
cat 1: [579, 1194, 507, 815] and [0.1871, 0.3858, 0.1638, 0.2633]
cat 2: [2, 4, 1, 3] and [0.2, 0.4, 0.1, 0.3]
cat 3: [291, 1188, 419, 1943] and [0.0758, 0.3093, 0.1091, 0.5059]
[test epoch 37/100] | loss 0.293 | nw acc 0.47 | time 0 min 38 sec
cat 0: [82, 36, 10, 30] and [0.519, 0.2278, 0.0633, 0.1899]
cat 1: [147, 305, 128, 174] and [0.195, 0.4045, 0.1698, 0.2308]
cat 2: [0, 0, 1, 1] and [0.0, 0.0, 0.5, 0.5]
cat 3: [65, 295, 102, 514] and [0.0666, 0.3023, 0.1045, 0.5266]
[train epoch 38/100] | loss 1.1881 | nw acc 0.461 | time 2 min 34 sec
cat 0: [279, 133, 32, 104] and [0.5091, 0.2427, 0.0584, 0.1898]
cat 1: [593, 1291, 532, 830] and [0.1827, 0.3977, 0.1639, 0.2557]
cat 2: [0, 6, 4, 5] and [0.0, 0.4, 0.2667, 0.3333]
cat 3: [303, 1111, 397, 1936] and [0.0809, 0.2965, 0.106, 0.5167]
[test epoch 38/100] | loss 0.292 | nw acc 0.482 | time 0 min 39 sec
cat 0: [121, 75, 10, 52] and [0.469, 0.2907, 0.0388, 0.2016]
cat 1: [118, 292, 130, 156] and [0.1695, 0.4195, 0.1868, 0.2241]
cat 2: [0, 2, 4, 2] and [0.0, 0.25, 0.5, 0.25]
cat 3: [55, 267, 97, 509] and [0.0593, 0.2877, 0.1045, 0.5485]
[train epoch 39/100] | loss 1.1974 | nw acc 0.45 | time 2 min 32 sec
cat 0: [291, 136, 49, 157] and [0.4597, 0.2148, 0.0774, 0.248]
cat 1: [584, 1234, 476, 822] and [0.1874, 0.396, 0.1528, 0.2638]
cat 2: [3, 13, 18, 10] and [0.0682, 0.2955, 0.4091, 0.2273]
cat 3: [297, 1158, 422, 1886] and [0.0789, 0.3077, 0.1121, 0.5012]
[test epoch 39/100] | loss 0.294 | nw acc 0.463 | time 0 min 39 sec
cat 0: [72, 27, 4, 22] and [0.576, 0.216, 0.032, 0.176]
cat 1: [157, 337, 141, 216] and [0.1845, 0.396, 0.1657, 0.2538]
cat 2: [0, 0, 0, 1] and [0.0, 0.0, 0.0, 1.0]
cat 3: [65, 272, 96, 480] and [0.0712, 0.2979, 0.1051, 0.5257]
[train epoch 40/100] | loss 1.1901 | nw acc 0.46 | time 2 min 34 sec
cat 0: [286, 143, 42, 137] and [0.4704, 0.2352, 0.0691, 0.2253]
cat 1: [596, 1250, 484, 765] and [0.1926, 0.4039, 0.1564, 0.2472]
cat 2: [0, 7, 6, 8] and [0.0, 0.3333, 0.2857, 0.381]
cat 3: [293, 1141, 433, 1965] and [0.0765, 0.2978, 0.113, 0.5128]
[test epoch 40/100] | loss 0.291 | nw acc 0.466 | time 0 min 39 sec
cat 0: [77, 37, 6, 25] and [0.531, 0.2552, 0.0414, 0.1724]
cat 1: [154, 310, 129, 188] and [0.1972, 0.3969, 0.1652, 0.2407]
cat 2: [1, 0, 1, 0] and [0.5, 0.0, 0.5, 0.0]
cat 3: [62, 289, 105, 506] and [0.0644, 0.3004, 0.1091, 0.526]
[train epoch 41/100] | loss 1.1891 | nw acc 0.456 | time 2 min 34 sec
cat 0: [314, 176, 49, 114] and [0.4809, 0.2695, 0.075, 0.1746]
cat 1: [538, 1174, 484, 777] and [0.181, 0.3949, 0.1628, 0.2614]
cat 2: [1, 13, 5, 5] and [0.0417, 0.5417, 0.2083, 0.2083]
cat 3: [322, 1178, 427, 1979] and [0.0824, 0.3016, 0.1093, 0.5067]
[test epoch 41/100] | loss 0.29 | nw acc 0.457 | time 0 min 39 sec
cat 0: [85, 51, 17, 30] and [0.4645, 0.2787, 0.0929, 0.1639]
cat 1: [142, 263, 114, 159] and [0.2094, 0.3879, 0.1681, 0.2345]
cat 2: [0, 3, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 3: [67, 319, 110, 530] and [0.0653, 0.3109, 0.1072, 0.5166]
[train epoch 42/100] | loss 1.1804 | nw acc 0.467 | time 2 min 35 sec
cat 0: [341, 183, 62, 138] and [0.471, 0.2528, 0.0856, 0.1906]
cat 1: [567, 1262, 487, 784] and [0.1829, 0.4071, 0.1571, 0.2529]
cat 2: [6, 5, 6, 5] and [0.2727, 0.2273, 0.2727, 0.2273]
cat 3: [261, 1091, 410, 1948] and [0.0704, 0.2941, 0.1105, 0.5251]
[test epoch 42/100] | loss 0.293 | nw acc 0.454 | time 0 min 40 sec
cat 0: [78, 36, 3, 41] and [0.4937, 0.2278, 0.019, 0.2595]
cat 1: [168, 320, 154, 203] and [0.1988, 0.3787, 0.1822, 0.2402]
cat 2: [0, 2, 0, 2] and [0.0, 0.5, 0.0, 0.5]
cat 3: [48, 278, 84, 473] and [0.0544, 0.3148, 0.0951, 0.5357]
[train epoch 43/100] | loss 1.1946 | nw acc 0.453 | time 2 min 35 sec
cat 0: [278, 152, 48, 130] and [0.4572, 0.25, 0.0789, 0.2138]
cat 1: [585, 1226, 488, 800] and [0.1888, 0.3956, 0.1575, 0.2581]
cat 2: [3, 12, 8, 10] and [0.0909, 0.3636, 0.2424, 0.303]
cat 3: [309, 1151, 421, 1935] and [0.081, 0.3016, 0.1103, 0.5071]
[test epoch 43/100] | loss 0.293 | nw acc 0.464 | time 0 min 38 sec
cat 0: [67, 35, 4, 27] and [0.5038, 0.2632, 0.0301, 0.203]
cat 1: [174, 371, 152, 240] and [0.1857, 0.3959, 0.1622, 0.2561]
cat 2: [0, 1, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 3: [53, 229, 85, 452] and [0.0647, 0.2796, 0.1038, 0.5519]
[train epoch 44/100] | loss 1.1807 | nw acc 0.464 | time 2 min 40 sec
cat 0: [287, 168, 54, 97] and [0.4736, 0.2772, 0.0891, 0.1601]
cat 1: [576, 1161, 465, 696] and [0.1988, 0.4006, 0.1605, 0.2402]
cat 2: [0, 4, 5, 0] and [0.0, 0.4444, 0.5556, 0.0]
cat 3: [312, 1208, 441, 2082] and [0.0772, 0.2988, 0.1091, 0.515]
[test epoch 44/100] | loss 0.292 | nw acc 0.459 | time 0 min 37 sec
cat 0: [46, 15, 1, 13] and [0.6133, 0.2, 0.0133, 0.1733]
cat 1: [175, 356, 151, 227] and [0.1925, 0.3916, 0.1661, 0.2497]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [73, 265, 89, 479] and [0.0806, 0.2925, 0.0982, 0.5287]
[train epoch 45/100] | loss 1.1807 | nw acc 0.463 | time 2 min 33 sec
cat 0: [307, 175, 58, 123] and [0.463, 0.264, 0.0875, 0.1855]
cat 1: [567, 1220, 486, 755] and [0.1873, 0.4029, 0.1605, 0.2493]
cat 2: [0, 3, 3, 2] and [0.0, 0.375, 0.375, 0.25]
cat 3: [301, 1143, 418, 1995] and [0.078, 0.2963, 0.1084, 0.5172]
[test epoch 45/100] | loss 0.292 | nw acc 0.46 | time 0 min 39 sec
cat 0: [111, 81, 19, 32] and [0.4568, 0.3333, 0.0782, 0.1317]
cat 1: [123, 238, 110, 153] and [0.1971, 0.3814, 0.1763, 0.2452]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [60, 317, 112, 534] and [0.0587, 0.3099, 0.1095, 0.522]
[train epoch 46/100] | loss 1.186 | nw acc 0.46 | time 2 min 40 sec
cat 0: [303, 156, 51, 120] and [0.481, 0.2476, 0.081, 0.1905]
cat 1: [562, 1214, 477, 770] and [0.1859, 0.4016, 0.1578, 0.2547]
cat 2: [0, 3, 6, 2] and [0.0, 0.2727, 0.5455, 0.1818]
cat 3: [310, 1168, 431, 1983] and [0.0797, 0.3001, 0.1107, 0.5095]
[test epoch 46/100] | loss 0.291 | nw acc 0.472 | time 0 min 37 sec
cat 0: [63, 31, 3, 17] and [0.5526, 0.2719, 0.0263, 0.1491]
cat 1: [148, 294, 129, 155] and [0.2039, 0.405, 0.1777, 0.2135]
cat 2: [1, 0, 3, 0] and [0.25, 0.0, 0.75, 0.0]
cat 3: [82, 311, 106, 547] and [0.0784, 0.2973, 0.1013, 0.5229]
[train epoch 47/100] | loss 1.1851 | nw acc 0.459 | time 2 min 40 sec
cat 0: [322, 190, 65, 129] and [0.4561, 0.2691, 0.0921, 0.1827]
cat 1: [506, 1057, 465, 633] and [0.1902, 0.3972, 0.1747, 0.2379]
cat 2: [2, 4, 3, 1] and [0.2, 0.4, 0.3, 0.1]
cat 3: [345, 1290, 432, 2112] and [0.0826, 0.3087, 0.1034, 0.5054]
[test epoch 47/100] | loss 0.292 | nw acc 0.469 | time 0 min 37 sec
cat 0: [80, 27, 2, 22] and [0.6107, 0.2061, 0.0153, 0.1679]
cat 1: [148, 305, 138, 181] and [0.1917, 0.3951, 0.1788, 0.2345]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [66, 304, 101, 516] and [0.0669, 0.308, 0.1023, 0.5228]
[train epoch 48/100] | loss 1.184 | nw acc 0.453 | time 2 min 37 sec
cat 0: [318, 175, 59, 132] and [0.4649, 0.2558, 0.0863, 0.193]
cat 1: [558, 1121, 461, 726] and [0.1947, 0.3911, 0.1609, 0.2533]
cat 2: [0, 8, 2, 6] and [0.0, 0.5, 0.125, 0.375]
cat 3: [299, 1237, 443, 2011] and [0.0749, 0.31, 0.111, 0.504]
[test epoch 48/100] | loss 0.293 | nw acc 0.456 | time 0 min 38 sec
cat 0: [139, 89, 25, 56] and [0.4498, 0.288, 0.0809, 0.1812]
cat 1: [103, 261, 122, 189] and [0.1526, 0.3867, 0.1807, 0.28]
cat 2: [0, 1, 1, 0] and [0.0, 0.5, 0.5, 0.0]
cat 3: [52, 285, 93, 474] and [0.0575, 0.3153, 0.1029, 0.5243]
[train epoch 49/100] | loss 1.1851 | nw acc 0.465 | time 2 min 34 sec
cat 0: [336, 181, 54, 168] and [0.4547, 0.2449, 0.0731, 0.2273]
cat 1: [511, 1148, 466, 655] and [0.1838, 0.4129, 0.1676, 0.2356]
cat 2: [0, 5, 5, 3] and [0.0, 0.3846, 0.3846, 0.2308]
cat 3: [328, 1207, 440, 2049] and [0.0815, 0.3, 0.1093, 0.5092]
[test epoch 49/100] | loss 0.292 | nw acc 0.467 | time 0 min 37 sec
cat 0: [131, 76, 20, 50] and [0.4729, 0.2744, 0.0722, 0.1805]
cat 1: [112, 281, 122, 185] and [0.16, 0.4014, 0.1743, 0.2643]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [51, 279, 99, 484] and [0.0559, 0.3056, 0.1084, 0.5301]
[train epoch 50/100] | loss 1.1789 | nw acc 0.468 | time 2 min 36 sec
cat 0: [363, 194, 58, 123] and [0.4919, 0.2629, 0.0786, 0.1667]
cat 1: [504, 1176, 476, 728] and [0.1748, 0.4078, 0.165, 0.2524]
cat 2: [1, 5, 3, 2] and [0.0909, 0.4545, 0.2727, 0.1818]
cat 3: [307, 1166, 428, 2022] and [0.0783, 0.2972, 0.1091, 0.5154]
[test epoch 50/100] | loss 0.289 | nw acc 0.47 | time 0 min 38 sec
cat 0: [85, 39, 6, 32] and [0.5247, 0.2407, 0.037, 0.1975]
cat 1: [158, 317, 129, 187] and [0.1997, 0.4008, 0.1631, 0.2364]
cat 2: [0, 0, 1, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [51, 280, 105, 500] and [0.0545, 0.2991, 0.1122, 0.5342]
[train epoch 51/100] | loss 1.1848 | nw acc 0.458 | time 2 min 50 sec
cat 0: [321, 192, 49, 119] and [0.4714, 0.2819, 0.072, 0.1747]
cat 1: [525, 1115, 475, 709] and [0.1859, 0.3948, 0.1682, 0.2511]
cat 2: [0, 8, 5, 3] and [0.0, 0.5, 0.3125, 0.1875]
cat 3: [329, 1226, 436, 2044] and [0.0815, 0.3038, 0.1081, 0.5066]
[test epoch 51/100] | loss 0.29 | nw acc 0.474 | time 0 min 28 sec
cat 0: [90, 38, 10, 14] and [0.5921, 0.25, 0.0658, 0.0921]
cat 1: [121, 266, 114, 151] and [0.1856, 0.408, 0.1748, 0.2316]
cat 2: [1, 0, 1, 0] and [0.5, 0.0, 0.5, 0.0]
cat 3: [82, 332, 116, 554] and [0.0756, 0.3063, 0.107, 0.5111]
[train epoch 52/100] | loss 1.1777 | nw acc 0.459 | time 2 min 47 sec
cat 0: [345, 186, 61, 116] and [0.4873, 0.2627, 0.0862, 0.1638]
cat 1: [508, 1125, 470, 736] and [0.1789, 0.3963, 0.1656, 0.2592]
cat 2: [2, 6, 9, 4] and [0.0952, 0.2857, 0.4286, 0.1905]
cat 3: [320, 1224, 425, 2019] and [0.0802, 0.3069, 0.1066, 0.5063]
[test epoch 52/100] | loss 0.293 | nw acc 0.471 | time 0 min 29 sec
cat 0: [100, 63, 8, 36] and [0.4831, 0.3043, 0.0386, 0.1739]
cat 1: [154, 341, 150, 219] and [0.1782, 0.3947, 0.1736, 0.2535]
cat 2: [0, 1, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 3: [40, 231, 83, 464] and [0.0489, 0.2824, 0.1015, 0.5672]
[train epoch 53/100] | loss 1.1745 | nw acc 0.463 | time 2 min 36 sec
cat 0: [335, 164, 44, 124] and [0.5022, 0.2459, 0.066, 0.1859]
cat 1: [548, 1181, 508, 744] and [0.1838, 0.3962, 0.1704, 0.2496]
cat 2: [0, 9, 8, 6] and [0.0, 0.3913, 0.3478, 0.2609]
cat 3: [292, 1187, 405, 2001] and [0.0752, 0.3055, 0.1042, 0.5151]
[test epoch 53/100] | loss 0.291 | nw acc 0.47 | time 0 min 42 sec
cat 0: [70, 30, 6, 20] and [0.5556, 0.2381, 0.0476, 0.1587]
cat 1: [134, 273, 129, 139] and [0.1985, 0.4044, 0.1911, 0.2059]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [90, 333, 106, 560] and [0.0826, 0.3058, 0.0973, 0.5142]
[train epoch 54/100] | loss 1.1735 | nw acc 0.463 | time 2 min 41 sec
cat 0: [325, 178, 44, 126] and [0.4829, 0.2645, 0.0654, 0.1872]
cat 1: [566, 1187, 495, 729] and [0.1901, 0.3987, 0.1663, 0.2449]
cat 2: [0, 1, 2, 4] and [0.0, 0.1429, 0.2857, 0.5714]
cat 3: [284, 1175, 424, 2016] and [0.0728, 0.3014, 0.1087, 0.5171]
[test epoch 54/100] | loss 0.29 | nw acc 0.479 | time 0 min 39 sec
cat 0: [103, 60, 9, 32] and [0.5049, 0.2941, 0.0441, 0.1569]
cat 1: [126, 295, 134, 165] and [0.175, 0.4097, 0.1861, 0.2292]
cat 2: [0, 2, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 3: [65, 279, 98, 522] and [0.0674, 0.2894, 0.1017, 0.5415]
[train epoch 55/100] | loss 1.1785 | nw acc 0.47 | time 2 min 34 sec
cat 0: [345, 184, 56, 123] and [0.4873, 0.2599, 0.0791, 0.1737]
cat 1: [527, 1153, 455, 670] and [0.1879, 0.4111, 0.1622, 0.2389]
cat 2: [1, 8, 6, 3] and [0.0556, 0.4444, 0.3333, 0.1667]
cat 3: [302, 1196, 448, 2079] and [0.075, 0.2971, 0.1113, 0.5165]
[test epoch 55/100] | loss 0.291 | nw acc 0.458 | time 0 min 40 sec
cat 0: [95, 54, 10, 48] and [0.4589, 0.2609, 0.0483, 0.2319]
cat 1: [140, 271, 120, 158] and [0.2032, 0.3933, 0.1742, 0.2293]
cat 2: [0, 2, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 3: [59, 309, 111, 513] and [0.0595, 0.3115, 0.1119, 0.5171]
[train epoch 56/100] | loss 1.1785 | nw acc 0.468 | time 2 min 58 sec
cat 0: [345, 190, 55, 128] and [0.4805, 0.2646, 0.0766, 0.1783]
cat 1: [515, 1124, 454, 662] and [0.1869, 0.408, 0.1648, 0.2403]
cat 2: [1, 6, 12, 5] and [0.0417, 0.25, 0.5, 0.2083]
cat 3: [314, 1221, 444, 2080] and [0.0774, 0.3008, 0.1094, 0.5124]
[test epoch 56/100] | loss 0.292 | nw acc 0.455 | time 0 min 30 sec
cat 0: [88, 73, 15, 20] and [0.449, 0.3724, 0.0765, 0.102]
cat 1: [118, 227, 116, 141] and [0.196, 0.3771, 0.1927, 0.2342]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [88, 336, 110, 558] and [0.0806, 0.3077, 0.1007, 0.511]
[train epoch 57/100] | loss 1.1758 | nw acc 0.468 | time 2 min 31 sec
cat 0: [351, 165, 67, 120] and [0.4993, 0.2347, 0.0953, 0.1707]
cat 1: [508, 1125, 445, 679] and [0.1843, 0.4081, 0.1614, 0.2463]
cat 2: [0, 5, 16, 6] and [0.0, 0.1852, 0.5926, 0.2222]
cat 3: [316, 1246, 437, 2070] and [0.0777, 0.3062, 0.1074, 0.5087]
[test epoch 57/100] | loss 0.291 | nw acc 0.47 | time 0 min 39 sec
cat 0: [92, 35, 8, 33] and [0.5476, 0.2083, 0.0476, 0.1964]
cat 1: [140, 290, 140, 165] and [0.1905, 0.3946, 0.1905, 0.2245]
cat 2: [0, 1, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 3: [62, 310, 93, 521] and [0.0629, 0.3144, 0.0943, 0.5284]
[train epoch 58/100] | loss 1.1794 | nw acc 0.464 | time 2 min 38 sec
cat 0: [356, 219, 76, 139] and [0.4506, 0.2772, 0.0962, 0.1759]
cat 1: [508, 1093, 455, 651] and [0.1877, 0.4038, 0.1681, 0.2405]
cat 2: [1, 8, 4, 6] and [0.0526, 0.4211, 0.2105, 0.3158]
cat 3: [310, 1221, 430, 2079] and [0.0767, 0.3022, 0.1064, 0.5146]
[test epoch 58/100] | loss 0.294 | nw acc 0.475 | time 0 min 39 sec
cat 0: [84, 40, 8, 36] and [0.5, 0.2381, 0.0476, 0.2143]
cat 1: [165, 356, 144, 211] and [0.1884, 0.4064, 0.1644, 0.2409]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [45, 240, 89, 472] and [0.0532, 0.2837, 0.1052, 0.5579]
[train epoch 59/100] | loss 1.1674 | nw acc 0.466 | time 2 min 36 sec
cat 0: [342, 189, 60, 119] and [0.4817, 0.2662, 0.0845, 0.1676]
cat 1: [508, 1115, 478, 669] and [0.1834, 0.4025, 0.1726, 0.2415]
cat 2: [2, 9, 8, 4] and [0.087, 0.3913, 0.3478, 0.1739]
cat 3: [323, 1228, 419, 2083] and [0.0797, 0.303, 0.1034, 0.5139]
[test epoch 59/100] | loss 0.291 | nw acc 0.463 | time 0 min 38 sec
cat 0: [144, 103, 30, 72] and [0.4126, 0.2951, 0.086, 0.2063]
cat 1: [91, 230, 121, 134] and [0.158, 0.3993, 0.2101, 0.2326]
cat 2: [0, 3, 1, 0] and [0.0, 0.75, 0.25, 0.0]
cat 3: [59, 300, 89, 513] and [0.0614, 0.3122, 0.0926, 0.5338]
[train epoch 60/100] | loss 1.1727 | nw acc 0.467 | time 2 min 40 sec
cat 0: [359, 184, 54, 141] and [0.4864, 0.2493, 0.0732, 0.1911]
cat 1: [509, 1107, 480, 645] and [0.1857, 0.4039, 0.1751, 0.2353]
cat 2: [3, 9, 9, 4] and [0.12, 0.36, 0.36, 0.16]
cat 3: [304, 1241, 422, 2085] and [0.075, 0.3063, 0.1041, 0.5146]
[test epoch 60/100] | loss 0.295 | nw acc 0.458 | time 0 min 48 sec
cat 0: [135, 108, 24, 88] and [0.3803, 0.3042, 0.0676, 0.2479]
cat 1: [119, 285, 130, 172] and [0.1686, 0.4037, 0.1841, 0.2436]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [40, 243, 87, 459] and [0.0483, 0.2931, 0.1049, 0.5537]
[train epoch 61/100] | loss 1.1772 | nw acc 0.459 | time 2 min 34 sec
cat 0: [330, 190, 55, 151] and [0.4545, 0.2617, 0.0758, 0.208]
cat 1: [529, 1100, 472, 661] and [0.1915, 0.3983, 0.1709, 0.2393]
cat 2: [1, 3, 5, 4] and [0.0769, 0.2308, 0.3846, 0.3077]
cat 3: [315, 1248, 433, 2059] and [0.0777, 0.3078, 0.1068, 0.5078]
[test epoch 61/100] | loss 0.29 | nw acc 0.464 | time 0 min 40 sec
cat 0: [119, 87, 26, 48] and [0.425, 0.3107, 0.0929, 0.1714]
cat 1: [127, 275, 127, 175] and [0.1804, 0.3906, 0.1804, 0.2486]
cat 2: [0, 0, 1, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [48, 274, 87, 496] and [0.053, 0.3028, 0.0961, 0.5481]
[train epoch 62/100] | loss 1.182 | nw acc 0.472 | time 2 min 35 sec
cat 0: [344, 191, 64, 128] and [0.4732, 0.2627, 0.088, 0.1761]
cat 1: [508, 1147, 473, 645] and [0.1832, 0.4136, 0.1706, 0.2326]
cat 2: [1, 7, 9, 4] and [0.0476, 0.3333, 0.4286, 0.1905]
cat 3: [322, 1196, 419, 2098] and [0.0798, 0.2964, 0.1038, 0.52]
[test epoch 62/100] | loss 0.288 | nw acc 0.477 | time 0 min 40 sec
cat 0: [88, 38, 9, 14] and [0.5906, 0.255, 0.0604, 0.094]
cat 1: [125, 261, 130, 140] and [0.1905, 0.3979, 0.1982, 0.2134]
cat 2: [0, 0, 1, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [81, 337, 101, 565] and [0.0747, 0.3109, 0.0932, 0.5212]
[train epoch 63/100] | loss 1.1729 | nw acc 0.462 | time 2 min 39 sec
cat 0: [367, 200, 60, 142] and [0.4772, 0.2601, 0.078, 0.1847]
cat 1: [499, 1081, 452, 660] and [0.1854, 0.4016, 0.1679, 0.2452]
cat 2: [2, 7, 7, 6] and [0.0909, 0.3182, 0.3182, 0.2727]
cat 3: [307, 1253, 446, 2067] and [0.0754, 0.3076, 0.1095, 0.5075]
[test epoch 63/100] | loss 0.289 | nw acc 0.461 | time 0 min 39 sec
cat 0: [101, 58, 11, 52] and [0.455, 0.2613, 0.0495, 0.2342]
cat 1: [150, 310, 153, 193] and [0.1861, 0.3846, 0.1898, 0.2395]
cat 2: [0, 1, 1, 0] and [0.0, 0.5, 0.5, 0.0]
cat 3: [43, 267, 76, 474] and [0.05, 0.3105, 0.0884, 0.5512]
[train epoch 64/100] | loss 1.1807 | nw acc 0.462 | time 2 min 37 sec
cat 0: [335, 183, 46, 124] and [0.4869, 0.266, 0.0669, 0.1802]
cat 1: [506, 1112, 487, 682] and [0.1816, 0.399, 0.1747, 0.2447]
cat 2: [0, 5, 8, 9] and [0.0, 0.2273, 0.3636, 0.4091]
cat 3: [334, 1241, 424, 2060] and [0.0823, 0.3057, 0.1045, 0.5075]
[test epoch 64/100] | loss 0.288 | nw acc 0.483 | time 0 min 38 sec
cat 0: [153, 82, 26, 59] and [0.4781, 0.2562, 0.0813, 0.1844]
cat 1: [104, 262, 124, 148] and [0.163, 0.4107, 0.1944, 0.232]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [37, 292, 91, 512] and [0.0397, 0.3133, 0.0976, 0.5494]
[train epoch 65/100] | loss 1.1734 | nw acc 0.467 | time 2 min 34 sec
cat 0: [325, 190, 53, 132] and [0.4643, 0.2714, 0.0757, 0.1886]
cat 1: [504, 1158, 487, 675] and [0.1785, 0.4101, 0.1725, 0.239]
cat 2: [1, 4, 9, 3] and [0.0588, 0.2353, 0.5294, 0.1765]
cat 3: [345, 1189, 416, 2065] and [0.0859, 0.2961, 0.1036, 0.5143]
[test epoch 65/100] | loss 0.289 | nw acc 0.471 | time 0 min 38 sec
cat 0: [75, 44, 7, 22] and [0.5068, 0.2973, 0.0473, 0.1486]
cat 1: [152, 282, 144, 150] and [0.2088, 0.3874, 0.1978, 0.206]
cat 2: [0, 0, 1, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [67, 310, 89, 547] and [0.0661, 0.306, 0.0879, 0.54]
[train epoch 66/100] | loss 1.1733 | nw acc 0.465 | time 2 min 31 sec
cat 0: [312, 145, 35, 118] and [0.5115, 0.2377, 0.0574, 0.1934]
cat 1: [564, 1199, 520, 725] and [0.1875, 0.3986, 0.1729, 0.241]
cat 2: [0, 4, 1, 2] and [0.0, 0.5714, 0.1429, 0.2857]
cat 3: [299, 1193, 409, 2030] and [0.0761, 0.3035, 0.104, 0.5164]
[test epoch 66/100] | loss 0.288 | nw acc 0.471 | time 0 min 39 sec
cat 0: [112, 66, 16, 32] and [0.4956, 0.292, 0.0708, 0.1416]
cat 1: [125, 292, 137, 186] and [0.1689, 0.3946, 0.1851, 0.2514]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [57, 278, 88, 501] and [0.0617, 0.3009, 0.0952, 0.5422]
