MaunaNet4(
  (conv1): Conv2d(1, 3, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn1): BatchNorm2d(3, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool1): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv2): Conv2d(3, 64, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool2): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv3): Conv2d(64, 128, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn3): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool3): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv4): Conv2d(128, 256, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn4): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool4): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (avgpool): AvgPool2d(kernel_size=2, stride=2, padding=0)
  (fc1): Linear(in_features=256, out_features=4, bias=True)
)
[train epoch 1/100] | loss 0.90351 | nw acc 0.665 | time 1 min 23 sec
cat 0: [833, 65, 78, 70] and [0.7964, 0.0621, 0.0746, 0.0669]
cat 1: [137, 1705, 253, 518] and [0.0524, 0.6525, 0.0968, 0.1982]
cat 2: [30, 80, 355, 113] and [0.0519, 0.1384, 0.6142, 0.1955]
cat 3: [175, 691, 279, 2174] and [0.0527, 0.2082, 0.0841, 0.655]
[test epoch 1/100] | loss 0.37 | nw acc 0.391 | time 0 min 55 sec
cat 0: [138, 37, 46, 55] and [0.5, 0.1341, 0.1667, 0.1993]
cat 1: [156, 598, 190, 654] and [0.0976, 0.3742, 0.1189, 0.4093]
cat 2: [0, 1, 5, 1] and [0.0, 0.1429, 0.7143, 0.1429]
cat 3: [0, 0, 0, 9] and [0.0, 0.0, 0.0, 1.0]
[train epoch 2/100] | loss 0.74438 | nw acc 0.766 | time 1 min 22 sec
cat 0: [965, 45, 38, 41] and [0.8861, 0.0413, 0.0349, 0.0376]
cat 1: [88, 1935, 197, 374] and [0.0339, 0.746, 0.0759, 0.1442]
cat 2: [17, 70, 567, 92] and [0.0228, 0.0938, 0.7601, 0.1233]
cat 3: [105, 491, 163, 2368] and [0.0336, 0.157, 0.0521, 0.7573]
[test epoch 2/100] | loss 0.295 | nw acc 0.437 | time 0 min 24 sec
cat 0: [49, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [238, 631, 215, 565] and [0.1443, 0.3827, 0.1304, 0.3426]
cat 2: [0, 0, 5, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [7, 5, 21, 154] and [0.0374, 0.0267, 0.1123, 0.8235]
[train epoch 3/100] | loss 0.64646 | nw acc 0.835 | time 1 min 44 sec
cat 0: [1014, 27, 23, 35] and [0.9227, 0.0246, 0.0209, 0.0318]
cat 1: [69, 2138, 159, 255] and [0.0263, 0.8157, 0.0607, 0.0973]
cat 2: [10, 48, 685, 65] and [0.0124, 0.0594, 0.8478, 0.0804]
cat 3: [82, 328, 98, 2520] and [0.0271, 0.1083, 0.0324, 0.8322]
[test epoch 3/100] | loss 0.377 | nw acc 0.389 | time 0 min 30 sec
cat 0: [28, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [266, 636, 241, 719] and [0.1429, 0.3416, 0.1294, 0.3861]
[train epoch 4/100] | loss 0.60057 | nw acc 0.861 | time 2 min 26 sec
cat 0: [1055, 24, 24, 42] and [0.9214, 0.021, 0.021, 0.0367]
cat 1: [35, 2233, 146, 198] and [0.0134, 0.8549, 0.0559, 0.0758]
cat 2: [20, 57, 711, 76] and [0.0231, 0.066, 0.8229, 0.088]
cat 3: [65, 227, 84, 2559] and [0.0221, 0.0773, 0.0286, 0.8719]
[test epoch 4/100] | loss 0.289 | nw acc 0.563 | time 0 min 38 sec
cat 0: [171, 1, 0, 0] and [0.9942, 0.0058, 0.0, 0.0]
cat 1: [1, 132, 0, 2] and [0.0074, 0.9778, 0.0, 0.0148]
cat 2: [104, 332, 240, 179] and [0.1216, 0.3883, 0.2807, 0.2094]
cat 3: [18, 171, 1, 538] and [0.0247, 0.2349, 0.0014, 0.739]
[train epoch 5/100] | loss 0.53877 | nw acc 0.901 | time 2 min 54 sec
cat 0: [1094, 19, 12, 31] and [0.9464, 0.0164, 0.0104, 0.0268]
cat 1: [40, 2316, 112, 156] and [0.0152, 0.8826, 0.0427, 0.0595]
cat 2: [7, 34, 801, 40] and [0.0079, 0.0385, 0.9082, 0.0454]
cat 3: [34, 172, 40, 2648] and [0.0117, 0.0594, 0.0138, 0.915]
[test epoch 5/100] | loss 0.224 | nw acc 0.633 | time 0 min 44 sec
cat 0: [289, 168, 134, 246] and [0.3453, 0.2007, 0.1601, 0.2939]
cat 1: [0, 420, 24, 6] and [0.0, 0.9333, 0.0533, 0.0133]
cat 2: [0, 0, 40, 1] and [0.0, 0.0, 0.9756, 0.0244]
cat 3: [5, 48, 43, 466] and [0.0089, 0.0854, 0.0765, 0.8292]
[train epoch 6/100] | loss 0.50935 | nw acc 0.917 | time 2 min 51 sec
cat 0: [1084, 27, 13, 53] and [0.921, 0.0229, 0.011, 0.045]
cat 1: [28, 2379, 83, 108] and [0.0108, 0.9157, 0.0319, 0.0416]
cat 2: [14, 34, 833, 24] and [0.0155, 0.0376, 0.9204, 0.0265]
cat 3: [49, 101, 36, 2690] and [0.017, 0.0351, 0.0125, 0.9353]
[test epoch 6/100] | loss 0.351 | nw acc 0.41 | time 0 min 45 sec
cat 0: [58, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 2: [14, 2, 11, 0] and [0.5185, 0.0741, 0.4074, 0.0]
cat 3: [222, 634, 230, 719] and [0.123, 0.3512, 0.1274, 0.3983]
[train epoch 7/100] | loss 0.51543 | nw acc 0.913 | time 2 min 56 sec
cat 0: [1078, 13, 8, 25] and [0.9591, 0.0116, 0.0071, 0.0222]
cat 1: [23, 2371, 97, 85] and [0.0089, 0.9204, 0.0377, 0.033]
cat 2: [37, 64, 813, 73] and [0.0375, 0.0648, 0.8237, 0.074]
cat 3: [37, 93, 47, 2692] and [0.0129, 0.0324, 0.0164, 0.9383]
[test epoch 7/100] | loss 0.163 | nw acc 0.812 | time 0 min 39 sec
cat 0: [277, 46, 59, 31] and [0.6707, 0.1114, 0.1429, 0.0751]
cat 1: [3, 556, 67, 29] and [0.0046, 0.8489, 0.1023, 0.0443]
cat 2: [0, 2, 77, 10] and [0.0, 0.0225, 0.8652, 0.1124]
cat 3: [14, 32, 38, 649] and [0.0191, 0.0437, 0.0518, 0.8854]
[train epoch 8/100] | loss 0.43515 | nw acc 0.955 | time 2 min 51 sec
cat 0: [1137, 5, 2, 13] and [0.9827, 0.0043, 0.0017, 0.0112]
cat 1: [12, 2446, 52, 42] and [0.0047, 0.9585, 0.0204, 0.0165]
cat 2: [9, 29, 886, 14] and [0.0096, 0.0309, 0.9446, 0.0149]
cat 3: [17, 61, 25, 2806] and [0.0058, 0.021, 0.0086, 0.9646]
[test epoch 8/100] | loss 0.286 | nw acc 0.645 | time 0 min 44 sec
cat 0: [270, 26, 0, 1] and [0.9091, 0.0875, 0.0, 0.0034]
cat 1: [0, 23, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [5, 209, 237, 9] and [0.0109, 0.4543, 0.5152, 0.0196]
cat 3: [19, 378, 4, 709] and [0.0171, 0.3405, 0.0036, 0.6387]
[train epoch 9/100] | loss 0.4034 | nw acc 0.969 | time 2 min 51 sec
cat 0: [1150, 8, 3, 10] and [0.9821, 0.0068, 0.0026, 0.0085]
cat 1: [5, 2480, 33, 28] and [0.002, 0.9741, 0.013, 0.011]
cat 2: [8, 20, 919, 4] and [0.0084, 0.021, 0.9664, 0.0042]
cat 3: [12, 33, 10, 2833] and [0.0042, 0.0114, 0.0035, 0.981]
[test epoch 9/100] | loss 0.202 | nw acc 0.69 | time 0 min 42 sec
cat 0: [159, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [124, 635, 172, 257] and [0.1044, 0.5345, 0.1448, 0.2163]
cat 2: [1, 0, 68, 0] and [0.0145, 0.0, 0.9855, 0.0]
cat 3: [10, 1, 1, 462] and [0.0211, 0.0021, 0.0021, 0.9747]
[train epoch 10/100] | loss 0.3846 | nw acc 0.979 | time 2 min 53 sec
cat 0: [1164, 3, 1, 3] and [0.994, 0.0026, 0.0009, 0.0026]
cat 1: [2, 2504, 24, 11] and [0.0008, 0.9854, 0.0094, 0.0043]
cat 2: [3, 19, 933, 3] and [0.0031, 0.0198, 0.9739, 0.0031]
cat 3: [6, 15, 7, 2858] and [0.0021, 0.0052, 0.0024, 0.9903]
[test epoch 10/100] | loss 0.158 | nw acc 0.831 | time 0 min 43 sec
cat 0: [274, 13, 1, 0] and [0.9514, 0.0451, 0.0035, 0.0]
cat 1: [0, 382, 1, 0] and [0.0, 0.9974, 0.0026, 0.0]
cat 2: [1, 14, 221, 0] and [0.0042, 0.0593, 0.9364, 0.0]
cat 3: [19, 227, 18, 719] and [0.0193, 0.2309, 0.0183, 0.7314]
[train epoch 11/100] | loss 0.39228 | nw acc 0.978 | time 2 min 51 sec
cat 0: [1159, 9, 5, 9] and [0.9805, 0.0076, 0.0042, 0.0076]
cat 1: [4, 2500, 20, 14] and [0.0016, 0.985, 0.0079, 0.0055]
cat 2: [3, 9, 935, 1] and [0.0032, 0.0095, 0.9863, 0.0011]
cat 3: [9, 23, 5, 2851] and [0.0031, 0.008, 0.0017, 0.9872]
[test epoch 11/100] | loss 0.282 | nw acc 0.511 | time 0 min 42 sec
cat 0: [38, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [249, 631, 97, 548] and [0.1633, 0.4138, 0.0636, 0.3593]
cat 2: [7, 5, 144, 3] and [0.044, 0.0314, 0.9057, 0.0189]
cat 3: [0, 0, 0, 168] and [0.0, 0.0, 0.0, 1.0]
[train epoch 12/100] | loss 0.39261 | nw acc 0.975 | time 2 min 56 sec
cat 0: [1152, 3, 1, 8] and [0.9897, 0.0026, 0.0009, 0.0069]
cat 1: [6, 2505, 17, 21] and [0.0024, 0.9827, 0.0067, 0.0082]
cat 2: [8, 11, 928, 2] and [0.0084, 0.0116, 0.9779, 0.0021]
cat 3: [9, 22, 19, 2844] and [0.0031, 0.0076, 0.0066, 0.9827]
[test epoch 12/100] | loss 0.213 | nw acc 0.672 | time 0 min 45 sec
cat 0: [245, 0, 0, 4] and [0.9839, 0.0, 0.0, 0.0161]
cat 1: [49, 636, 165, 381] and [0.0398, 0.5167, 0.134, 0.3095]
cat 2: [0, 0, 76, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 334] and [0.0, 0.0, 0.0, 1.0]
[train epoch 13/100] | loss 0.36225 | nw acc 0.988 | time 2 min 51 sec
cat 0: [1171, 3, 1, 1] and [0.9957, 0.0026, 0.0009, 0.0009]
cat 1: [1, 2525, 7, 2] and [0.0004, 0.9961, 0.0028, 0.0008]
cat 2: [1, 11, 954, 1] and [0.001, 0.0114, 0.9866, 0.001]
cat 3: [2, 2, 3, 2871] and [0.0007, 0.0007, 0.001, 0.9976]
[test epoch 13/100] | loss 0.219 | nw acc 0.705 | time 0 min 43 sec
cat 0: [287, 59, 0, 1] and [0.8271, 0.17, 0.0, 0.0029]
cat 1: [0, 113, 1, 0] and [0.0, 0.9912, 0.0088, 0.0]
cat 2: [1, 125, 235, 0] and [0.0028, 0.3463, 0.651, 0.0]
cat 3: [6, 339, 5, 718] and [0.0056, 0.3174, 0.0047, 0.6723]
[train epoch 14/100] | loss 0.3628 | nw acc 0.988 | time 2 min 56 sec
cat 0: [1171, 2, 0, 0] and [0.9983, 0.0017, 0.0, 0.0]
cat 1: [1, 2530, 7, 7] and [0.0004, 0.9941, 0.0028, 0.0028]
cat 2: [2, 5, 954, 0] and [0.0021, 0.0052, 0.9927, 0.0]
cat 3: [1, 4, 4, 2868] and [0.0003, 0.0014, 0.0014, 0.9969]
[test epoch 14/100] | loss 0.149 | nw acc 0.853 | time 0 min 44 sec
cat 0: [280, 1, 1, 12] and [0.9524, 0.0034, 0.0034, 0.0408]
cat 1: [13, 634, 88, 131] and [0.015, 0.7321, 0.1016, 0.1513]
cat 2: [0, 0, 152, 4] and [0.0, 0.0, 0.9744, 0.0256]
cat 3: [1, 1, 0, 572] and [0.0017, 0.0017, 0.0, 0.9965]
[train epoch 15/100] | loss 0.36145 | nw acc 0.988 | time 2 min 52 sec
cat 0: [1172, 1, 0, 0] and [0.9991, 0.0009, 0.0, 0.0]
cat 1: [2, 2528, 8, 5] and [0.0008, 0.9941, 0.0031, 0.002]
cat 2: [0, 4, 953, 0] and [0.0, 0.0042, 0.9958, 0.0]
cat 3: [1, 8, 4, 2870] and [0.0003, 0.0028, 0.0014, 0.9955]
[test epoch 15/100] | loss 0.146 | nw acc 0.849 | time 0 min 42 sec
cat 0: [243, 0, 1, 1] and [0.9918, 0.0, 0.0041, 0.0041]
cat 1: [44, 633, 121, 65] and [0.051, 0.7335, 0.1402, 0.0753]
cat 2: [1, 0, 101, 0] and [0.0098, 0.0, 0.9902, 0.0]
cat 3: [6, 3, 18, 653] and [0.0088, 0.0044, 0.0265, 0.9603]
[train epoch 16/100] | loss 0.36288 | nw acc 0.987 | time 2 min 51 sec
cat 0: [1169, 0, 0, 2] and [0.9983, 0.0, 0.0, 0.0017]
cat 1: [2, 2534, 10, 11] and [0.0008, 0.991, 0.0039, 0.0043]
cat 2: [1, 1, 953, 1] and [0.001, 0.001, 0.9969, 0.001]
cat 3: [3, 6, 2, 2861] and [0.001, 0.0021, 0.0007, 0.9962]
[test epoch 16/100] | loss 0.159 | nw acc 0.83 | time 0 min 43 sec
cat 0: [245, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [45, 635, 28, 208] and [0.0491, 0.6932, 0.0306, 0.2271]
cat 2: [2, 0, 213, 11] and [0.0088, 0.0, 0.9425, 0.0487]
cat 3: [2, 1, 0, 500] and [0.004, 0.002, 0.0, 0.994]
[train epoch 17/100] | loss 0.35383 | nw acc 0.991 | time 2 min 52 sec
cat 0: [1174, 1, 0, 0] and [0.9991, 0.0009, 0.0, 0.0]
cat 1: [1, 2538, 2, 3] and [0.0004, 0.9976, 0.0008, 0.0012]
cat 2: [0, 0, 962, 1] and [0.0, 0.0, 0.999, 0.001]
cat 3: [0, 2, 1, 2871] and [0.0, 0.0007, 0.0003, 0.999]
[test epoch 17/100] | loss 0.148 | nw acc 0.865 | time 0 min 45 sec
cat 0: [291, 102, 8, 6] and [0.715, 0.2506, 0.0197, 0.0147]
cat 1: [1, 428, 1, 0] and [0.0023, 0.9953, 0.0023, 0.0]
cat 2: [0, 27, 230, 1] and [0.0, 0.1047, 0.8915, 0.0039]
cat 3: [2, 79, 2, 712] and [0.0025, 0.0994, 0.0025, 0.8956]
[train epoch 18/100] | loss 0.3559 | nw acc 0.991 | time 2 min 54 sec
cat 0: [1172, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [1, 2540, 2, 0] and [0.0004, 0.9988, 0.0008, 0.0]
cat 2: [0, 0, 962, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [2, 1, 1, 2875] and [0.0007, 0.0003, 0.0003, 0.9986]
[test epoch 18/100] | loss 0.256 | nw acc 0.626 | time 0 min 42 sec
cat 0: [292, 216, 68, 35] and [0.4779, 0.3535, 0.1113, 0.0573]
cat 1: [0, 82, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [1, 2, 144, 0] and [0.0068, 0.0136, 0.9796, 0.0]
cat 3: [1, 336, 29, 684] and [0.001, 0.32, 0.0276, 0.6514]
[train epoch 19/100] | loss 0.45075 | nw acc 0.951 | time 2 min 54 sec
cat 0: [1138, 15, 10, 17] and [0.9644, 0.0127, 0.0085, 0.0144]
cat 1: [12, 2450, 45, 72] and [0.0047, 0.95, 0.0174, 0.0279]
cat 2: [6, 31, 889, 18] and [0.0064, 0.0328, 0.9417, 0.0191]
cat 3: [19, 45, 21, 2768] and [0.0067, 0.0158, 0.0074, 0.9702]
[test epoch 19/100] | loss 0.189 | nw acc 0.787 | time 0 min 41 sec
cat 0: [290, 75, 167, 22] and [0.5235, 0.1354, 0.3014, 0.0397]
cat 1: [2, 502, 9, 4] and [0.0039, 0.971, 0.0174, 0.0077]
cat 2: [0, 0, 27, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [2, 59, 38, 693] and [0.0025, 0.0745, 0.048, 0.875]
[train epoch 20/100] | loss 0.38507 | nw acc 0.979 | time 2 min 53 sec
cat 0: [1166, 5, 2, 4] and [0.9907, 0.0042, 0.0017, 0.0034]
cat 1: [6, 2506, 13, 27] and [0.0024, 0.982, 0.0051, 0.0106]
cat 2: [0, 6, 942, 0] and [0.0, 0.0063, 0.9937, 0.0]
cat 3: [3, 24, 8, 2844] and [0.001, 0.0083, 0.0028, 0.9878]
[test epoch 20/100] | loss 0.164 | nw acc 0.81 | time 0 min 46 sec
cat 0: [282, 4, 0, 3] and [0.9758, 0.0138, 0.0, 0.0104]
cat 1: [1, 405, 0, 2] and [0.0025, 0.9926, 0.0, 0.0049]
cat 2: [10, 213, 241, 86] and [0.0182, 0.3873, 0.4382, 0.1564]
cat 3: [1, 14, 0, 628] and [0.0016, 0.0218, 0.0, 0.9767]
[train epoch 21/100] | loss 0.37011 | nw acc 0.986 | time 2 min 59 sec
cat 0: [1168, 0, 3, 6] and [0.9924, 0.0, 0.0025, 0.0051]
cat 1: [2, 2527, 7, 3] and [0.0008, 0.9953, 0.0028, 0.0012]
cat 2: [2, 9, 953, 1] and [0.0021, 0.0093, 0.9876, 0.001]
cat 3: [3, 5, 2, 2865] and [0.001, 0.0017, 0.0007, 0.9965]
[test epoch 21/100] | loss 0.1 | nw acc 0.963 | time 0 min 41 sec
cat 0: [289, 4, 2, 1] and [0.9764, 0.0135, 0.0068, 0.0034]
cat 1: [1, 612, 5, 2] and [0.0016, 0.9871, 0.0081, 0.0032]
cat 2: [1, 5, 231, 0] and [0.0042, 0.0211, 0.9747, 0.0]
cat 3: [3, 15, 3, 716] and [0.0041, 0.0204, 0.0041, 0.9715]
[train epoch 22/100] | loss 0.35263 | nw acc 0.992 | time 2 min 51 sec
cat 0: [1173, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [1, 2541, 1, 0] and [0.0004, 0.9992, 0.0004, 0.0]
cat 2: [0, 0, 964, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [1, 0, 0, 2875] and [0.0003, 0.0, 0.0, 0.9997]
[test epoch 22/100] | loss 0.172 | nw acc 0.778 | time 0 min 43 sec
cat 0: [215, 3, 0, 3] and [0.9729, 0.0136, 0.0, 0.0136]
cat 1: [8, 336, 2, 0] and [0.0231, 0.9711, 0.0058, 0.0]
cat 2: [6, 19, 230, 3] and [0.0233, 0.0736, 0.8915, 0.0116]
cat 3: [65, 278, 9, 713] and [0.061, 0.261, 0.0085, 0.6695]
[train epoch 23/100] | loss 0.39847 | nw acc 0.971 | time 2 min 52 sec
cat 0: [1142, 14, 6, 28] and [0.9597, 0.0118, 0.005, 0.0235]
cat 1: [12, 2494, 11, 18] and [0.0047, 0.9838, 0.0043, 0.0071]
cat 2: [7, 17, 939, 6] and [0.0072, 0.0175, 0.969, 0.0062]
cat 3: [14, 16, 9, 2823] and [0.0049, 0.0056, 0.0031, 0.9864]
[test epoch 23/100] | loss 0.178 | nw acc 0.809 | time 0 min 41 sec
cat 0: [286, 15, 20, 96] and [0.6859, 0.036, 0.048, 0.2302]
cat 1: [5, 615, 35, 130] and [0.0064, 0.7834, 0.0446, 0.1656]
cat 2: [1, 2, 185, 25] and [0.0047, 0.0094, 0.8685, 0.1174]
cat 3: [2, 4, 1, 468] and [0.0042, 0.0084, 0.0021, 0.9853]
[train epoch 24/100] | loss 0.37937 | nw acc 0.978 | time 2 min 54 sec
cat 0: [1143, 3, 3, 12] and [0.9845, 0.0026, 0.0026, 0.0103]
cat 1: [4, 2518, 5, 18] and [0.0016, 0.9894, 0.002, 0.0071]
cat 2: [1, 5, 948, 2] and [0.001, 0.0052, 0.9916, 0.0021]
cat 3: [27, 15, 9, 2843] and [0.0093, 0.0052, 0.0031, 0.9824]
[test epoch 24/100] | loss 0.106 | nw acc 0.953 | time 0 min 49 sec
cat 0: [278, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [9, 629, 9, 23] and [0.0134, 0.9388, 0.0134, 0.0343]
cat 2: [4, 5, 232, 6] and [0.0162, 0.0202, 0.9393, 0.0243]
cat 3: [3, 2, 0, 690] and [0.0043, 0.0029, 0.0, 0.9928]
[train epoch 25/100] | loss 0.35189 | nw acc 0.992 | time 3 min 11 sec
cat 0: [1174, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2540, 1, 0] and [0.0, 0.9996, 0.0004, 0.0]
cat 2: [0, 0, 964, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [1, 1, 0, 2875] and [0.0003, 0.0003, 0.0, 0.9993]
[test epoch 25/100] | loss 0.146 | nw acc 0.877 | time 0 min 43 sec
cat 0: [290, 26, 1, 36] and [0.8215, 0.0737, 0.0028, 0.102]
cat 1: [0, 560, 3, 19] and [0.0, 0.9622, 0.0052, 0.0326]
cat 2: [4, 45, 237, 67] and [0.0113, 0.1275, 0.6714, 0.1898]
cat 3: [0, 5, 0, 597] and [0.0, 0.0083, 0.0, 0.9917]
[train epoch 26/100] | loss 0.39443 | nw acc 0.973 | time 2 min 52 sec
cat 0: [1143, 8, 1, 11] and [0.9828, 0.0069, 0.0009, 0.0095]
cat 1: [14, 2497, 13, 24] and [0.0055, 0.98, 0.0051, 0.0094]
cat 2: [0, 9, 935, 2] and [0.0, 0.0095, 0.9884, 0.0021]
cat 3: [18, 27, 16, 2838] and [0.0062, 0.0093, 0.0055, 0.979]
[test epoch 26/100] | loss 0.121 | nw acc 0.916 | time 0 min 49 sec
cat 0: [243, 0, 0, 1] and [0.9959, 0.0, 0.0, 0.0041]
cat 1: [36, 609, 10, 29] and [0.0526, 0.8904, 0.0146, 0.0424]
cat 2: [10, 12, 231, 13] and [0.0376, 0.0451, 0.8684, 0.0489]
cat 3: [5, 15, 0, 676] and [0.0072, 0.0216, 0.0, 0.9713]
[train epoch 27/100] | loss 0.35448 | nw acc 0.991 | time 3 min 13 sec
cat 0: [1173, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [2, 2541, 1, 2] and [0.0008, 0.998, 0.0004, 0.0008]
cat 2: [0, 0, 964, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 2873] and [0.0, 0.0, 0.0, 1.0]
[test epoch 27/100] | loss 0.179 | nw acc 0.778 | time 0 min 48 sec
cat 0: [288, 44, 0, 3] and [0.8597, 0.1313, 0.0, 0.009]
cat 1: [1, 252, 0, 0] and [0.004, 0.996, 0.0, 0.0]
cat 2: [3, 85, 238, 1] and [0.0092, 0.2599, 0.7278, 0.0031]
cat 3: [2, 255, 3, 715] and [0.0021, 0.2615, 0.0031, 0.7333]
[train epoch 28/100] | loss 0.36153 | nw acc 0.989 | time 2 min 57 sec
cat 0: [1169, 6, 0, 1] and [0.994, 0.0051, 0.0, 0.0009]
cat 1: [5, 2530, 4, 5] and [0.002, 0.9945, 0.0016, 0.002]
cat 2: [0, 0, 961, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [1, 5, 0, 2869] and [0.0003, 0.0017, 0.0, 0.9979]
[test epoch 28/100] | loss 0.11 | nw acc 0.944 | time 0 min 42 sec
cat 0: [263, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [22, 631, 24, 13] and [0.0319, 0.9145, 0.0348, 0.0188]
cat 2: [1, 0, 213, 0] and [0.0047, 0.0, 0.9953, 0.0]
cat 3: [8, 5, 4, 706] and [0.0111, 0.0069, 0.0055, 0.9765]
[train epoch 29/100] | loss 0.35482 | nw acc 0.991 | time 2 min 51 sec
cat 0: [1170, 2, 0, 1] and [0.9974, 0.0017, 0.0, 0.0009]
cat 1: [3, 2537, 1, 1] and [0.0012, 0.998, 0.0004, 0.0004]
cat 2: [0, 1, 964, 0] and [0.0, 0.001, 0.999, 0.0]
cat 3: [2, 1, 0, 2873] and [0.0007, 0.0003, 0.0, 0.999]
[test epoch 29/100] | loss 0.097 | nw acc 0.968 | time 0 min 41 sec
cat 0: [287, 0, 0, 1] and [0.9965, 0.0, 0.0, 0.0035]
cat 1: [2, 626, 9, 3] and [0.0031, 0.9781, 0.0141, 0.0047]
cat 2: [1, 4, 231, 1] and [0.0042, 0.0169, 0.9747, 0.0042]
cat 3: [4, 6, 1, 714] and [0.0055, 0.0083, 0.0014, 0.9848]
[train epoch 30/100] | loss 0.34744 | nw acc 0.992 | time 2 min 48 sec
cat 0: [1174, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [1, 2541, 1, 0] and [0.0004, 0.9992, 0.0004, 0.0]
cat 2: [0, 0, 964, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 2875] and [0.0, 0.0, 0.0, 1.0]
[test epoch 30/100] | loss 0.0996 | nw acc 0.966 | time 0 min 44 sec
cat 0: [281, 0, 0, 1] and [0.9965, 0.0, 0.0, 0.0035]
cat 1: [8, 628, 6, 7] and [0.0123, 0.9676, 0.0092, 0.0108]
cat 2: [3, 4, 234, 0] and [0.0124, 0.0166, 0.971, 0.0]
cat 3: [2, 4, 1, 711] and [0.0028, 0.0056, 0.0014, 0.9903]
[train epoch 31/100] | loss 0.35171 | nw acc 0.992 | time 2 min 56 sec
cat 0: [1173, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [1, 2541, 1, 0] and [0.0004, 0.9992, 0.0004, 0.0]
cat 2: [0, 0, 963, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [1, 0, 1, 2875] and [0.0003, 0.0, 0.0003, 0.9993]
[test epoch 31/100] | loss 0.144 | nw acc 0.863 | time 0 min 43 sec
cat 0: [241, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [49, 634, 90, 84] and [0.0572, 0.7398, 0.105, 0.098]
cat 2: [1, 0, 147, 1] and [0.0067, 0.0, 0.9866, 0.0067]
cat 3: [3, 2, 4, 634] and [0.0047, 0.0031, 0.0062, 0.986]
[train epoch 32/100] | loss 0.38393 | nw acc 0.981 | time 2 min 58 sec
cat 0: [1166, 6, 1, 14] and [0.9823, 0.0051, 0.0008, 0.0118]
cat 1: [4, 2510, 7, 11] and [0.0016, 0.9913, 0.0028, 0.0043]
cat 2: [2, 5, 948, 5] and [0.0021, 0.0052, 0.9875, 0.0052]
cat 3: [3, 20, 9, 2845] and [0.001, 0.007, 0.0031, 0.9889]
[test epoch 32/100] | loss 0.282 | nw acc 0.617 | time 0 min 44 sec
cat 0: [287, 71, 10, 2] and [0.7757, 0.1919, 0.027, 0.0054]
cat 1: [0, 3, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 5, 177, 0] and [0.0, 0.0275, 0.9725, 0.0]
cat 3: [7, 557, 54, 717] and [0.0052, 0.4172, 0.0404, 0.5371]
[train epoch 33/100] | loss 0.35046 | nw acc 0.991 | time 3 min 1 sec
cat 0: [1173, 1, 0, 2] and [0.9974, 0.0009, 0.0, 0.0017]
cat 1: [1, 2538, 1, 1] and [0.0004, 0.9988, 0.0004, 0.0004]
cat 2: [0, 0, 962, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [1, 2, 2, 2872] and [0.0003, 0.0007, 0.0007, 0.9983]
[test epoch 33/100] | loss 0.109 | nw acc 0.948 | time 0 min 45 sec
cat 0: [293, 8, 13, 19] and [0.8799, 0.024, 0.039, 0.0571]
cat 1: [1, 625, 16, 7] and [0.0015, 0.963, 0.0247, 0.0108]
cat 2: [0, 0, 209, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 3, 3, 693] and [0.0, 0.0043, 0.0043, 0.9914]
[train epoch 34/100] | loss 0.3499 | nw acc 0.991 | time 2 min 54 sec
cat 0: [1174, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [1, 2540, 1, 1] and [0.0004, 0.9988, 0.0004, 0.0004]
cat 2: [0, 0, 963, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 1, 1, 2874] and [0.0, 0.0003, 0.0003, 0.9993]
[test epoch 34/100] | loss 0.238 | nw acc 0.648 | time 0 min 43 sec
cat 0: [294, 408, 96, 55] and [0.3447, 0.4783, 0.1125, 0.0645]
cat 1: [0, 146, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 7, 141, 0] and [0.0, 0.0473, 0.9527, 0.0]
cat 3: [0, 75, 4, 664] and [0.0, 0.1009, 0.0054, 0.8937]
[train epoch 35/100] | loss 0.35161 | nw acc 0.991 | time 3 min 0 sec
cat 0: [1172, 1, 0, 0] and [0.9991, 0.0009, 0.0, 0.0]
cat 1: [3, 2539, 2, 1] and [0.0012, 0.9976, 0.0008, 0.0004]
cat 2: [0, 0, 962, 1] and [0.0, 0.0, 0.999, 0.001]
cat 3: [0, 1, 1, 2873] and [0.0, 0.0003, 0.0003, 0.9993]
[test epoch 35/100] | loss 0.118 | nw acc 0.921 | time 0 min 47 sec
cat 0: [270, 0, 0, 5] and [0.9818, 0.0, 0.0, 0.0182]
cat 1: [21, 634, 13, 72] and [0.0284, 0.8568, 0.0176, 0.0973]
cat 2: [2, 0, 228, 5] and [0.0085, 0.0, 0.9702, 0.0213]
cat 3: [1, 2, 0, 637] and [0.0016, 0.0031, 0.0, 0.9953]
[train epoch 36/100] | loss 0.35788 | nw acc 0.99 | time 3 min 10 sec
cat 0: [1174, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [1, 2536, 2, 2] and [0.0004, 0.998, 0.0008, 0.0008]
cat 2: [0, 0, 961, 1] and [0.0, 0.0, 0.999, 0.001]
cat 3: [0, 5, 2, 2872] and [0.0, 0.0017, 0.0007, 0.9976]
[test epoch 36/100] | loss 0.118 | nw acc 0.928 | time 0 min 44 sec
cat 0: [274, 0, 0, 3] and [0.9892, 0.0, 0.0, 0.0108]
cat 1: [15, 608, 34, 9] and [0.0225, 0.9129, 0.0511, 0.0135]
cat 2: [1, 0, 193, 0] and [0.0052, 0.0, 0.9948, 0.0]
cat 3: [4, 28, 14, 707] and [0.0053, 0.0372, 0.0186, 0.9389]
[train epoch 37/100] | loss 0.35704 | nw acc 0.989 | time 2 min 53 sec
cat 0: [1169, 5, 0, 6] and [0.9907, 0.0042, 0.0, 0.0051]
cat 1: [6, 2532, 2, 1] and [0.0024, 0.9965, 0.0008, 0.0004]
cat 2: [0, 2, 961, 1] and [0.0, 0.0021, 0.9969, 0.001]
cat 3: [0, 2, 2, 2867] and [0.0, 0.0007, 0.0007, 0.9986]
[test epoch 37/100] | loss 0.0973 | nw acc 0.965 | time 0 min 48 sec
cat 0: [284, 0, 0, 1] and [0.9965, 0.0, 0.0, 0.0035]
cat 1: [6, 632, 16, 5] and [0.0091, 0.959, 0.0243, 0.0076]
cat 2: [1, 0, 223, 0] and [0.0045, 0.0, 0.9955, 0.0]
cat 3: [3, 4, 2, 713] and [0.0042, 0.0055, 0.0028, 0.9875]
[train epoch 38/100] | loss 0.34883 | nw acc 0.991 | time 3 min 10 sec
cat 0: [1174, 0, 0, 1] and [0.9991, 0.0, 0.0, 0.0009]
cat 1: [1, 2540, 1, 1] and [0.0004, 0.9988, 0.0004, 0.0004]
cat 2: [0, 0, 964, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 1, 0, 2873] and [0.0, 0.0003, 0.0, 0.9997]
[test epoch 38/100] | loss 0.391 | nw acc 0.25 | time 0 min 43 sec
cat 0: [294, 610, 239, 551] and [0.1736, 0.3601, 0.1411, 0.3253]
cat 1: [0, 16, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 1, 2, 0] and [0.0, 0.3333, 0.6667, 0.0]
cat 3: [0, 9, 0, 168] and [0.0, 0.0508, 0.0, 0.9492]
[train epoch 39/100] | loss 0.37836 | nw acc 0.978 | time 2 min 58 sec
cat 0: [1156, 6, 1, 7] and [0.988, 0.0051, 0.0009, 0.006]
cat 1: [9, 2491, 11, 14] and [0.0036, 0.9865, 0.0044, 0.0055]
cat 2: [2, 6, 948, 3] and [0.0021, 0.0063, 0.9885, 0.0031]
cat 3: [8, 38, 5, 2851] and [0.0028, 0.0131, 0.0017, 0.9824]
[test epoch 39/100] | loss 0.101 | nw acc 0.958 | time 0 min 46 sec
cat 0: [290, 3, 0, 0] and [0.9898, 0.0102, 0.0, 0.0]
cat 1: [1, 597, 5, 0] and [0.0017, 0.99, 0.0083, 0.0]
cat 2: [1, 3, 233, 0] and [0.0042, 0.0127, 0.9831, 0.0]
cat 3: [2, 33, 3, 719] and [0.0026, 0.0436, 0.004, 0.9498]
[train epoch 40/100] | loss 0.34636 | nw acc 0.992 | time 3 min 13 sec
cat 0: [1174, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [1, 2541, 0, 2] and [0.0004, 0.9988, 0.0, 0.0008]
cat 2: [0, 0, 965, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 2873] and [0.0, 0.0, 0.0, 1.0]
[test epoch 40/100] | loss 0.1 | nw acc 0.966 | time 0 min 43 sec
cat 0: [292, 6, 0, 1] and [0.9766, 0.0201, 0.0, 0.0033]
cat 1: [0, 609, 3, 2] and [0.0, 0.9919, 0.0049, 0.0033]
cat 2: [2, 9, 238, 1] and [0.008, 0.036, 0.952, 0.004]
cat 3: [0, 12, 0, 715] and [0.0, 0.0165, 0.0, 0.9835]
[train epoch 41/100] | loss 0.34506 | nw acc 0.992 | time 2 min 53 sec
cat 0: [1175, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2541, 0, 1] and [0.0, 0.9996, 0.0, 0.0004]
cat 2: [0, 0, 965, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 2874] and [0.0, 0.0, 0.0, 1.0]
[test epoch 41/100] | loss 0.0969 | nw acc 0.968 | time 0 min 43 sec
cat 0: [287, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [4, 632, 13, 6] and [0.0061, 0.9649, 0.0198, 0.0092]
cat 2: [2, 1, 227, 0] and [0.0087, 0.0043, 0.987, 0.0]
cat 3: [1, 3, 1, 713] and [0.0014, 0.0042, 0.0014, 0.993]
[train epoch 42/100] | loss 0.35007 | nw acc 0.992 | time 3 min 3 sec
cat 0: [1175, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2541, 0, 1] and [0.0, 0.9996, 0.0, 0.0004]
cat 2: [0, 0, 964, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 1, 2874] and [0.0, 0.0, 0.0003, 0.9997]
[test epoch 42/100] | loss 0.163 | nw acc 0.826 | time 0 min 45 sec
cat 0: [290, 33, 0, 3] and [0.8896, 0.1012, 0.0, 0.0092]
cat 1: [0, 354, 1, 0] and [0.0, 0.9972, 0.0028, 0.0]
cat 2: [4, 168, 240, 15] and [0.0094, 0.3934, 0.5621, 0.0351]
cat 3: [0, 81, 0, 701] and [0.0, 0.1036, 0.0, 0.8964]
[train epoch 43/100] | loss 0.35921 | nw acc 0.988 | time 2 min 57 sec
cat 0: [1171, 2, 0, 2] and [0.9966, 0.0017, 0.0, 0.0017]
cat 1: [1, 2536, 4, 2] and [0.0004, 0.9972, 0.0016, 0.0008]
cat 2: [3, 2, 957, 7] and [0.0031, 0.0021, 0.9876, 0.0072]
cat 3: [0, 1, 4, 2864] and [0.0, 0.0003, 0.0014, 0.9983]
[test epoch 43/100] | loss 0.119 | nw acc 0.926 | time 0 min 42 sec
cat 0: [286, 1, 0, 6] and [0.9761, 0.0034, 0.0, 0.0205]
cat 1: [6, 634, 15, 77] and [0.0082, 0.8661, 0.0205, 0.1052]
cat 2: [2, 1, 226, 5] and [0.0085, 0.0043, 0.9658, 0.0214]
cat 3: [0, 0, 0, 631] and [0.0, 0.0, 0.0, 1.0]
[train epoch 44/100] | loss 0.36207 | nw acc 0.987 | time 2 min 57 sec
cat 0: [1172, 1, 0, 0] and [0.9991, 0.0009, 0.0, 0.0]
cat 1: [1, 2524, 0, 15] and [0.0004, 0.9937, 0.0, 0.0059]
cat 2: [0, 0, 961, 2] and [0.0, 0.0, 0.9979, 0.0021]
cat 3: [2, 16, 4, 2858] and [0.0007, 0.0056, 0.0014, 0.9924]
[test epoch 44/100] | loss 0.0978 | nw acc 0.966 | time 0 min 45 sec
cat 0: [288, 2, 0, 2] and [0.9863, 0.0068, 0.0, 0.0068]
cat 1: [3, 623, 11, 3] and [0.0047, 0.9734, 0.0172, 0.0047]
cat 2: [2, 1, 229, 0] and [0.0086, 0.0043, 0.9871, 0.0]
cat 3: [1, 10, 1, 714] and [0.0014, 0.0138, 0.0014, 0.9835]
[train epoch 45/100] | loss 0.36485 | nw acc 0.986 | time 3 min 2 sec
cat 0: [1169, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [6, 2521, 7, 15] and [0.0024, 0.989, 0.0027, 0.0059]
cat 2: [0, 3, 957, 1] and [0.0, 0.0031, 0.9958, 0.001]
cat 3: [0, 17, 1, 2859] and [0.0, 0.0059, 0.0003, 0.9937]
[test epoch 45/100] | loss 0.104 | nw acc 0.956 | time 0 min 32 sec
cat 0: [285, 1, 0, 1] and [0.993, 0.0035, 0.0, 0.0035]
cat 1: [5, 628, 11, 22] and [0.0075, 0.9429, 0.0165, 0.033]
cat 2: [3, 4, 229, 3] and [0.0126, 0.0167, 0.9582, 0.0126]
cat 3: [1, 3, 1, 693] and [0.0014, 0.0043, 0.0014, 0.9928]
[train epoch 46/100] | loss 0.34914 | nw acc 0.991 | time 3 min 2 sec
cat 0: [1175, 2, 0, 1] and [0.9975, 0.0017, 0.0, 0.0008]
cat 1: [0, 2536, 1, 0] and [0.0, 0.9996, 0.0004, 0.0]
cat 2: [0, 0, 964, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 3, 0, 2874] and [0.0, 0.001, 0.0, 0.999]
[test epoch 46/100] | loss 0.0966 | nw acc 0.969 | time 0 min 36 sec
cat 0: [288, 0, 0, 1] and [0.9965, 0.0, 0.0, 0.0035]
cat 1: [2, 629, 9, 6] and [0.0031, 0.9737, 0.0139, 0.0093]
cat 2: [2, 3, 231, 0] and [0.0085, 0.0127, 0.9788, 0.0]
cat 3: [2, 4, 1, 712] and [0.0028, 0.0056, 0.0014, 0.9903]
[train epoch 47/100] | loss 0.35132 | nw acc 0.991 | time 2 min 58 sec
cat 0: [1175, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2536, 1, 0] and [0.0, 0.9996, 0.0004, 0.0]
cat 2: [0, 0, 964, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 5, 0, 2875] and [0.0, 0.0017, 0.0, 0.9983]
[test epoch 47/100] | loss 0.102 | nw acc 0.958 | time 1 min 28 sec
cat 0: [282, 0, 0, 1] and [0.9965, 0.0, 0.0, 0.0035]
cat 1: [8, 635, 17, 19] and [0.0118, 0.9352, 0.025, 0.028]
cat 2: [3, 0, 223, 0] and [0.0133, 0.0, 0.9867, 0.0]
cat 3: [1, 1, 1, 699] and [0.0014, 0.0014, 0.0014, 0.9957]
[train epoch 48/100] | loss 0.3534 | nw acc 0.991 | time 2 min 54 sec
cat 0: [1174, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [1, 2538, 1, 2] and [0.0004, 0.9984, 0.0004, 0.0008]
cat 2: [0, 0, 964, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 3, 0, 2873] and [0.0, 0.001, 0.0, 0.999]
[test epoch 48/100] | loss 0.103 | nw acc 0.953 | time 0 min 45 sec
cat 0: [284, 0, 0, 1] and [0.9965, 0.0, 0.0, 0.0035]
cat 1: [8, 635, 30, 14] and [0.0116, 0.9243, 0.0437, 0.0204]
cat 2: [1, 0, 208, 1] and [0.0048, 0.0, 0.9905, 0.0048]
cat 3: [1, 1, 3, 703] and [0.0014, 0.0014, 0.0042, 0.9929]
[train epoch 49/100] | loss 0.34476 | nw acc 0.992 | time 3 min 0 sec
cat 0: [1175, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2541, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 965, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 2875] and [0.0, 0.0, 0.0, 1.0]
[test epoch 49/100] | loss 0.0949 | nw acc 0.972 | time 1 min 6 sec
cat 0: [288, 0, 0, 1] and [0.9965, 0.0, 0.0, 0.0035]
cat 1: [2, 631, 8, 2] and [0.0031, 0.9813, 0.0124, 0.0031]
cat 2: [3, 1, 232, 0] and [0.0127, 0.0042, 0.9831, 0.0]
cat 3: [1, 4, 1, 716] and [0.0014, 0.0055, 0.0014, 0.9917]
[train epoch 50/100] | loss 0.34417 | nw acc 0.992 | time 2 min 59 sec
cat 0: [1175, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2541, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 965, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 2875] and [0.0, 0.0, 0.0, 1.0]
[test epoch 50/100] | loss 0.0949 | nw acc 0.968 | time 0 min 45 sec
cat 0: [287, 1, 0, 1] and [0.9931, 0.0035, 0.0, 0.0035]
cat 1: [3, 625, 8, 2] and [0.0047, 0.9796, 0.0125, 0.0031]
cat 2: [3, 2, 231, 0] and [0.0127, 0.0085, 0.9788, 0.0]
cat 3: [1, 8, 2, 716] and [0.0014, 0.011, 0.0028, 0.9849]
[train epoch 51/100] | loss 0.3445 | nw acc 0.992 | time 2 min 54 sec
cat 0: [1175, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2541, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 965, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 2875] and [0.0, 0.0, 0.0, 1.0]
[test epoch 51/100] | loss 0.159 | nw acc 0.84 | time 0 min 42 sec
cat 0: [294, 123, 20, 68] and [0.5822, 0.2436, 0.0396, 0.1347]
cat 1: [0, 451, 2, 0] and [0.0, 0.9956, 0.0044, 0.0]
cat 2: [0, 25, 219, 3] and [0.0, 0.1012, 0.8866, 0.0121]
cat 3: [0, 37, 0, 648] and [0.0, 0.054, 0.0, 0.946]
[train epoch 52/100] | loss 0.35971 | nw acc 0.989 | time 2 min 58 sec
cat 0: [1171, 1, 2, 1] and [0.9966, 0.0009, 0.0017, 0.0009]
cat 1: [1, 2532, 2, 5] and [0.0004, 0.9969, 0.0008, 0.002]
cat 2: [0, 1, 960, 1] and [0.0, 0.001, 0.9979, 0.001]
cat 3: [3, 7, 1, 2868] and [0.001, 0.0024, 0.0003, 0.9962]
[test epoch 52/100] | loss 0.139 | nw acc 0.861 | time 0 min 45 sec
cat 0: [232, 0, 0, 1] and [0.9957, 0.0, 0.0, 0.0043]
cat 1: [9, 521, 20, 2] and [0.0163, 0.9438, 0.0362, 0.0036]
cat 2: [2, 2, 185, 0] and [0.0106, 0.0106, 0.9788, 0.0]
cat 3: [51, 113, 36, 716] and [0.0557, 0.1234, 0.0393, 0.7817]
[train epoch 53/100] | loss 0.37807 | nw acc 0.98 | time 3 min 4 sec
cat 0: [1162, 16, 6, 29] and [0.958, 0.0132, 0.0049, 0.0239]
cat 1: [5, 2518, 3, 12] and [0.002, 0.9921, 0.0012, 0.0047]
cat 2: [2, 1, 956, 4] and [0.0021, 0.001, 0.9927, 0.0042]
cat 3: [6, 6, 0, 2830] and [0.0021, 0.0021, 0.0, 0.9958]
[test epoch 53/100] | loss 0.109 | nw acc 0.942 | time 0 min 46 sec
cat 0: [269, 1, 0, 0] and [0.9963, 0.0037, 0.0, 0.0]
cat 1: [19, 602, 20, 0] and [0.0296, 0.9392, 0.0312, 0.0]
cat 2: [3, 3, 220, 1] and [0.0132, 0.0132, 0.9692, 0.0044]
cat 3: [3, 30, 1, 718] and [0.004, 0.0399, 0.0013, 0.9548]
[train epoch 54/100] | loss 0.3473 | nw acc 0.992 | time 3 min 13 sec
cat 0: [1174, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [1, 2541, 0, 1] and [0.0004, 0.9992, 0.0, 0.0004]
cat 2: [0, 0, 964, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 1, 2874] and [0.0, 0.0, 0.0003, 0.9997]
[test epoch 54/100] | loss 0.108 | nw acc 0.942 | time 0 min 42 sec
cat 0: [289, 5, 1, 1] and [0.9764, 0.0169, 0.0034, 0.0034]
cat 1: [1, 565, 2, 0] and [0.0018, 0.9947, 0.0035, 0.0]
cat 2: [2, 28, 237, 0] and [0.0075, 0.1049, 0.8876, 0.0]
cat 3: [2, 38, 1, 718] and [0.0026, 0.0501, 0.0013, 0.946]
[train epoch 55/100] | loss 0.3463 | nw acc 0.992 | time 2 min 55 sec
cat 0: [1174, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [1, 2540, 0, 0] and [0.0004, 0.9996, 0.0, 0.0]
cat 2: [0, 0, 965, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 1, 0, 2875] and [0.0, 0.0003, 0.0, 0.9997]
[test epoch 55/100] | loss 0.0963 | nw acc 0.967 | time 0 min 44 sec
cat 0: [285, 0, 0, 1] and [0.9965, 0.0, 0.0, 0.0035]
cat 1: [3, 624, 6, 2] and [0.0047, 0.9827, 0.0094, 0.0031]
cat 2: [2, 5, 232, 0] and [0.0084, 0.0209, 0.9707, 0.0]
cat 3: [4, 7, 3, 716] and [0.0055, 0.0096, 0.0041, 0.9808]
[train epoch 56/100] | loss 0.34469 | nw acc 0.992 | time 2 min 58 sec
cat 0: [1175, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 2541, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 965, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 2875] and [0.0, 0.0, 0.0, 1.0]
[test epoch 56/100] | loss 0.133 | nw acc 0.877 | time 0 min 43 sec
cat 0: [262, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [0, 498, 9, 0] and [0.0, 0.9822, 0.0178, 0.0]
cat 2: [1, 0, 205, 0] and [0.0049, 0.0, 0.9951, 0.0]
cat 3: [31, 138, 27, 719] and [0.0339, 0.1508, 0.0295, 0.7858]
[train epoch 57/100] | loss 0.34487 | nw acc 0.992 | time 2 min 58 sec
cat 0: [1174, 0, 0, 0] and [1.0, 0.0, 0.0, 0.0]
cat 1: [1, 2541, 0, 0] and [0.0004, 0.9996, 0.0, 0.0]
cat 2: [0, 0, 965, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [0, 0, 0, 2875] and [0.0, 0.0, 0.0, 1.0]
[test epoch 57/100] | loss 0.103 | nw acc 0.957 | time 0 min 45 sec
cat 0: [276, 0, 0, 1] and [0.9964, 0.0, 0.0, 0.0036]
cat 1: [13, 636, 18, 15] and [0.0191, 0.9326, 0.0264, 0.022]
cat 2: [3, 0, 223, 0] and [0.0133, 0.0, 0.9867, 0.0]
cat 3: [2, 0, 0, 703] and [0.0028, 0.0, 0.0, 0.9972]
[train epoch 58/100] | loss 0.34519 | nw acc 0.992 | time 3 min 3 sec
cat 0: [1174, 0, 0, 1] and [0.9991, 0.0, 0.0, 0.0009]
cat 1: [0, 2541, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 2: [0, 0, 965, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [1, 0, 0, 2874] and [0.0003, 0.0, 0.0, 0.9997]
