BenchMarkAugBn(
  (conv1): Conv2d(1, 3, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn1): BatchNorm2d(3, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool1): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (drop1): Dropout2d(p=0.2)
  (conv2): Conv2d(3, 16, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn2): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool2): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (drop2): Dropout2d(p=0.2)
  (conv3): Conv2d(16, 64, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1))
  (bn3): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (pool3): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (drop3): Dropout2d(p=0.2)
  (fc1): Linear(in_features=576, out_features=4, bias=True)
)
[train epoch 1/100] | loss 1.2965 | nw acc 0.378 | time 2 min 30 sec
cat 0: [14, 20, 4, 19] and [0.2456, 0.3509, 0.0702, 0.3333]
cat 1: [357, 924, 439, 911] and [0.1357, 0.3512, 0.1669, 0.3463]
cat 2: [5, 18, 6, 10] and [0.1282, 0.4615, 0.1538, 0.2564]
cat 3: [799, 1579, 516, 1935] and [0.1655, 0.327, 0.1069, 0.4007]
[test epoch 1/100] | loss 0.32 | nw acc 0.387 | time 0 min 36 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [145, 378, 183, 354] and [0.1368, 0.3566, 0.1726, 0.334]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [149, 258, 58, 365] and [0.1795, 0.3108, 0.0699, 0.4398]
[train epoch 2/100] | loss 1.288 | nw acc 0.387 | time 2 min 34 sec
cat 0: [0, 0, 0, 1] and [0.0, 0.0, 0.0, 1.0]
cat 1: [565, 1479, 645, 1408] and [0.1379, 0.361, 0.1574, 0.3437]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [610, 1062, 320, 1466] and [0.1764, 0.3071, 0.0925, 0.4239]
[test epoch 2/100] | loss 0.313 | nw acc 0.408 | time 0 min 37 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [138, 347, 162, 283] and [0.1484, 0.3731, 0.1742, 0.3043]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [156, 289, 79, 436] and [0.1625, 0.301, 0.0823, 0.4542]
[train epoch 3/100] | loss 1.2722 | nw acc 0.402 | time 2 min 35 sec
cat 0: [2, 3, 3, 6] and [0.1429, 0.2143, 0.2143, 0.4286]
cat 1: [456, 1074, 524, 880] and [0.1554, 0.3661, 0.1786, 0.2999]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [717, 1464, 438, 1989] and [0.1556, 0.3177, 0.0951, 0.4316]
[test epoch 3/100] | loss 0.312 | nw acc 0.402 | time 0 min 38 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [108, 244, 137, 191] and [0.1588, 0.3588, 0.2015, 0.2809]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [186, 392, 104, 528] and [0.1537, 0.324, 0.086, 0.4364]
[train epoch 4/100] | loss 1.274 | nw acc 0.401 | time 2 min 39 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [493, 1249, 579, 1073] and [0.1453, 0.368, 0.1706, 0.3161]
cat 2: [0, 1, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 3: [682, 1291, 386, 1802] and [0.1639, 0.3103, 0.0928, 0.4331]
[test epoch 4/100] | loss 0.311 | nw acc 0.422 | time 0 min 35 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [130, 307, 150, 216] and [0.1619, 0.3823, 0.1868, 0.269]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [164, 329, 91, 503] and [0.1509, 0.3027, 0.0837, 0.4627]
[train epoch 5/100] | loss 1.2554 | nw acc 0.412 | time 2 min 30 sec
cat 0: [14, 6, 2, 17] and [0.359, 0.1538, 0.0513, 0.4359]
cat 1: [525, 1265, 551, 999] and [0.1572, 0.3787, 0.165, 0.2991]
cat 2: [0, 0, 1, 1] and [0.0, 0.0, 0.5, 0.5]
cat 3: [636, 1270, 411, 1858] and [0.1523, 0.3042, 0.0984, 0.445]
[test epoch 5/100] | loss 0.309 | nw acc 0.411 | time 0 min 37 sec
cat 0: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 1: [146, 385, 184, 315] and [0.1417, 0.3738, 0.1786, 0.3058]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [148, 251, 57, 404] and [0.1721, 0.2919, 0.0663, 0.4698]
[train epoch 6/100] | loss 1.2599 | nw acc 0.403 | time 2 min 36 sec
cat 0: [7, 3, 2, 4] and [0.4375, 0.1875, 0.125, 0.25]
cat 1: [722, 1705, 723, 1515] and [0.1548, 0.3655, 0.155, 0.3248]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [446, 833, 240, 1356] and [0.1551, 0.2897, 0.0835, 0.4717]
[test epoch 6/100] | loss 0.307 | nw acc 0.421 | time 0 min 40 sec
cat 0: [15, 7, 1, 1] and [0.625, 0.2917, 0.0417, 0.0417]
cat 1: [162, 395, 194, 320] and [0.1513, 0.3688, 0.1811, 0.2988]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [117, 234, 46, 398] and [0.1472, 0.2943, 0.0579, 0.5006]
[train epoch 7/100] | loss 1.2398 | nw acc 0.425 | time 2 min 28 sec
cat 0: [12, 4, 0, 8] and [0.5, 0.1667, 0.0, 0.3333]
cat 1: [565, 1259, 533, 900] and [0.1735, 0.3866, 0.1636, 0.2763]
cat 2: [0, 0, 0, 1] and [0.0, 0.0, 0.0, 1.0]
cat 3: [598, 1278, 432, 1966] and [0.1399, 0.299, 0.1011, 0.46]
[test epoch 7/100] | loss 0.313 | nw acc 0.426 | time 0 min 36 sec
cat 0: [50, 12, 3, 22] and [0.5747, 0.1379, 0.0345, 0.2529]
cat 1: [209, 537, 210, 467] and [0.1469, 0.3774, 0.1476, 0.3282]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [35, 87, 28, 230] and [0.0921, 0.2289, 0.0737, 0.6053]
[train epoch 8/100] | loss 1.2335 | nw acc 0.425 | time 2 min 36 sec
cat 0: [31, 12, 0, 12] and [0.5636, 0.2182, 0.0, 0.2182]
cat 1: [646, 1443, 614, 1098] and [0.17, 0.3796, 0.1615, 0.2889]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [498, 1086, 351, 1765] and [0.1346, 0.2935, 0.0949, 0.477]
[test epoch 8/100] | loss 0.305 | nw acc 0.429 | time 0 min 37 sec
cat 0: [50, 11, 4, 20] and [0.5882, 0.1294, 0.0471, 0.2353]
cat 1: [217, 564, 218, 489] and [0.1458, 0.379, 0.1465, 0.3286]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [27, 61, 19, 210] and [0.0852, 0.1924, 0.0599, 0.6625]
[train epoch 9/100] | loss 1.2247 | nw acc 0.429 | time 2 min 36 sec
cat 0: [30, 2, 1, 9] and [0.7143, 0.0476, 0.0238, 0.2143]
cat 1: [676, 1672, 684, 1301] and [0.156, 0.3859, 0.1579, 0.3003]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [469, 867, 280, 1565] and [0.1474, 0.2726, 0.088, 0.492]
[test epoch 9/100] | loss 0.307 | nw acc 0.408 | time 0 min 39 sec
cat 0: [42, 9, 4, 14] and [0.6087, 0.1304, 0.058, 0.2029]
cat 1: [235, 596, 229, 560] and [0.1451, 0.3679, 0.1414, 0.3457]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [17, 31, 8, 145] and [0.0846, 0.1542, 0.0398, 0.7214]
[train epoch 10/100] | loss 1.2353 | nw acc 0.418 | time 2 min 37 sec
cat 0: [18, 3, 0, 4] and [0.72, 0.12, 0.0, 0.16]
cat 1: [413, 766, 340, 469] and [0.2077, 0.3853, 0.171, 0.2359]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [744, 1772, 625, 2402] and [0.1342, 0.3197, 0.1128, 0.4333]
[test epoch 10/100] | loss 0.312 | nw acc 0.459 | time 0 min 39 sec
cat 0: [37, 16, 1, 15] and [0.5362, 0.2319, 0.0145, 0.2174]
cat 1: [182, 403, 167, 262] and [0.1795, 0.3974, 0.1647, 0.2584]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [75, 217, 73, 442] and [0.0929, 0.2689, 0.0905, 0.5477]
[train epoch 11/100] | loss 1.2238 | nw acc 0.438 | time 2 min 37 sec
cat 0: [51, 29, 8, 17] and [0.4857, 0.2762, 0.0762, 0.1619]
cat 1: [637, 1394, 553, 963] and [0.1796, 0.393, 0.1559, 0.2715]
cat 2: [1, 2, 2, 3] and [0.125, 0.25, 0.25, 0.375]
cat 3: [486, 1116, 402, 1892] and [0.1247, 0.2864, 0.1032, 0.4856]
[test epoch 11/100] | loss 0.318 | nw acc 0.43 | time 0 min 38 sec
cat 0: [58, 24, 4, 36] and [0.4754, 0.1967, 0.0328, 0.2951]
cat 1: [205, 556, 219, 473] and [0.1411, 0.3827, 0.1507, 0.3255]
cat 2: [0, 0, 2, 0] and [0.0, 0.0, 1.0, 0.0]
cat 3: [31, 56, 16, 210] and [0.099, 0.1789, 0.0511, 0.6709]
[train epoch 12/100] | loss 1.2143 | nw acc 0.443 | time 2 min 32 sec
cat 0: [73, 23, 12, 26] and [0.5448, 0.1716, 0.0896, 0.194]
cat 1: [650, 1587, 626, 1134] and [0.1626, 0.397, 0.1566, 0.2837]
cat 2: [0, 0, 1, 3] and [0.0, 0.0, 0.25, 0.75]
cat 3: [452, 931, 326, 1712] and [0.1321, 0.2721, 0.0953, 0.5004]
[test epoch 12/100] | loss 0.304 | nw acc 0.436 | time 0 min 38 sec
cat 0: [45, 21, 5, 17] and [0.5114, 0.2386, 0.0568, 0.1932]
cat 1: [198, 531, 203, 440] and [0.1443, 0.387, 0.148, 0.3207]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [51, 84, 33, 262] and [0.1186, 0.1953, 0.0767, 0.6093]
[train epoch 13/100] | loss 1.1969 | nw acc 0.45 | time 2 min 33 sec
cat 0: [87, 34, 9, 29] and [0.5472, 0.2138, 0.0566, 0.1824]
cat 1: [662, 1610, 644, 1116] and [0.1642, 0.3993, 0.1597, 0.2768]
cat 2: [2, 3, 2, 2] and [0.2222, 0.3333, 0.2222, 0.2222]
cat 3: [424, 894, 310, 1728] and [0.1263, 0.2664, 0.0924, 0.5149]
[test epoch 13/100] | loss 0.303 | nw acc 0.444 | time 0 min 40 sec
cat 0: [80, 38, 11, 64] and [0.4145, 0.1969, 0.057, 0.3316]
cat 1: [198, 510, 201, 394] and [0.152, 0.3914, 0.1543, 0.3024]
cat 2: [0, 3, 2, 1] and [0.0, 0.5, 0.3333, 0.1667]
cat 3: [16, 85, 27, 260] and [0.0412, 0.2191, 0.0696, 0.6701]
[train epoch 14/100] | loss 1.201 | nw acc 0.458 | time 2 min 32 sec
cat 0: [119, 48, 28, 52] and [0.4818, 0.1943, 0.1134, 0.2105]
cat 1: [693, 1645, 611, 1099] and [0.1712, 0.4064, 0.1509, 0.2715]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [363, 848, 326, 1724] and [0.1113, 0.26, 0.1, 0.5287]
[test epoch 14/100] | loss 0.308 | nw acc 0.446 | time 0 min 38 sec
cat 0: [88, 38, 7, 52] and [0.4757, 0.2054, 0.0378, 0.2811]
cat 1: [180, 479, 187, 365] and [0.1486, 0.3955, 0.1544, 0.3014]
cat 2: [6, 23, 10, 22] and [0.0984, 0.377, 0.1639, 0.3607]
cat 3: [20, 96, 37, 280] and [0.0462, 0.2217, 0.0855, 0.6467]
[train epoch 15/100] | loss 1.1912 | nw acc 0.459 | time 2 min 41 sec
cat 0: [106, 33, 12, 37] and [0.5638, 0.1755, 0.0638, 0.1968]
cat 1: [677, 1561, 584, 1015] and [0.1764, 0.4068, 0.1522, 0.2645]
cat 2: [1, 7, 7, 5] and [0.05, 0.35, 0.35, 0.25]
cat 3: [391, 940, 362, 1818] and [0.1114, 0.2677, 0.1031, 0.5178]
[test epoch 15/100] | loss 0.304 | nw acc 0.443 | time 0 min 38 sec
cat 0: [77, 43, 16, 26] and [0.4753, 0.2654, 0.0988, 0.1605]
cat 1: [130, 214, 132, 129] and [0.2149, 0.3537, 0.2182, 0.2132]
cat 2: [1, 1, 0, 5] and [0.1429, 0.1429, 0.0, 0.7143]
cat 3: [86, 378, 93, 559] and [0.0771, 0.3387, 0.0833, 0.5009]
[train epoch 16/100] | loss 1.1786 | nw acc 0.466 | time 2 min 37 sec
cat 0: [165, 64, 18, 53] and [0.55, 0.2133, 0.06, 0.1767]
cat 1: [636, 1478, 597, 910] and [0.1756, 0.4082, 0.1649, 0.2513]
cat 2: [4, 17, 7, 15] and [0.093, 0.3953, 0.1628, 0.3488]
cat 3: [370, 982, 343, 1897] and [0.103, 0.2734, 0.0955, 0.5281]
[test epoch 16/100] | loss 0.301 | nw acc 0.439 | time 0 min 38 sec
cat 0: [99, 38, 10, 71] and [0.4541, 0.1743, 0.0459, 0.3257]
cat 1: [179, 506, 208, 411] and [0.1373, 0.388, 0.1595, 0.3152]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [16, 92, 23, 237] and [0.0435, 0.25, 0.0625, 0.644]
[train epoch 17/100] | loss 1.1852 | nw acc 0.472 | time 2 min 37 sec
cat 0: [164, 59, 27, 69] and [0.5141, 0.185, 0.0846, 0.2163]
cat 1: [594, 1425, 572, 794] and [0.1755, 0.421, 0.169, 0.2346]
cat 2: [1, 2, 1, 4] and [0.125, 0.25, 0.125, 0.5]
cat 3: [416, 1055, 365, 2008] and [0.1082, 0.2745, 0.095, 0.5224]
[test epoch 17/100] | loss 0.311 | nw acc 0.398 | time 0 min 40 sec
cat 0: [97, 52, 17, 84] and [0.388, 0.208, 0.068, 0.336]
cat 1: [194, 538, 217, 506] and [0.1333, 0.3698, 0.1491, 0.3478]
cat 2: [0, 0, 0, 0] and [0.0, 0.0, 0.0, 0.0]
cat 3: [3, 46, 7, 129] and [0.0162, 0.2486, 0.0378, 0.6973]
[train epoch 18/100] | loss 1.1825 | nw acc 0.467 | time 2 min 33 sec
cat 0: [154, 58, 16, 75] and [0.5083, 0.1914, 0.0528, 0.2475]
cat 1: [675, 1556, 604, 946] and [0.1785, 0.4115, 0.1597, 0.2502]
cat 2: [4, 9, 7, 11] and [0.129, 0.2903, 0.2258, 0.3548]
cat 3: [342, 918, 338, 1843] and [0.0994, 0.2668, 0.0982, 0.5356]
[test epoch 18/100] | loss 0.298 | nw acc 0.43 | time 0 min 40 sec
cat 0: [61, 13, 6, 42] and [0.5, 0.1066, 0.0492, 0.3443]
cat 1: [209, 560, 218, 471] and [0.1433, 0.3841, 0.1495, 0.323]
cat 2: [0, 0, 1, 3] and [0.0, 0.0, 0.25, 0.75]
cat 3: [24, 63, 16, 203] and [0.0784, 0.2059, 0.0523, 0.6634]
[train epoch 19/100] | loss 1.1789 | nw acc 0.471 | time 2 min 32 sec
cat 0: [202, 76, 31, 93] and [0.5025, 0.1891, 0.0771, 0.2313]
cat 1: [637, 1578, 618, 957] and [0.1681, 0.4164, 0.1631, 0.2525]
cat 2: [7, 22, 21, 41] and [0.0769, 0.2418, 0.2308, 0.4505]
cat 3: [329, 865, 295, 1784] and [0.1005, 0.2643, 0.0901, 0.5451]
[test epoch 19/100] | loss 0.293 | nw acc 0.449 | time 0 min 37 sec
cat 0: [87, 34, 17, 71] and [0.4163, 0.1627, 0.0813, 0.3397]
cat 1: [181, 471, 190, 330] and [0.1544, 0.4019, 0.1621, 0.2816]
cat 2: [1, 5, 2, 16] and [0.0417, 0.2083, 0.0833, 0.6667]
cat 3: [25, 126, 32, 302] and [0.0515, 0.2598, 0.066, 0.6227]
[train epoch 20/100] | loss 1.1788 | nw acc 0.474 | time 2 min 39 sec
cat 0: [170, 61, 17, 67] and [0.5397, 0.1937, 0.054, 0.2127]
cat 1: [660, 1560, 597, 902] and [0.1775, 0.4195, 0.1605, 0.2425]
cat 2: [9, 19, 13, 38] and [0.1139, 0.2405, 0.1646, 0.481]
cat 3: [336, 901, 338, 1868] and [0.0976, 0.2617, 0.0982, 0.5426]
[test epoch 20/100] | loss 0.291 | nw acc 0.472 | time 0 min 41 sec
cat 0: [92, 31, 6, 38] and [0.5509, 0.1856, 0.0359, 0.2275]
cat 1: [134, 243, 135, 108] and [0.2161, 0.3919, 0.2177, 0.1742]
cat 2: [0, 5, 0, 1] and [0.0, 0.8333, 0.0, 0.1667]
cat 3: [68, 357, 100, 572] and [0.062, 0.3254, 0.0912, 0.5214]
[train epoch 21/100] | loss 1.1693 | nw acc 0.465 | time 2 min 36 sec
cat 0: [180, 65, 17, 88] and [0.5143, 0.1857, 0.0486, 0.2514]
cat 1: [643, 1458, 545, 870] and [0.1829, 0.4147, 0.155, 0.2474]
cat 2: [13, 38, 25, 39] and [0.113, 0.3304, 0.2174, 0.3391]
cat 3: [339, 980, 378, 1878] and [0.0948, 0.2741, 0.1057, 0.5253]
[test epoch 21/100] | loss 0.29 | nw acc 0.46 | time 0 min 38 sec
cat 0: [97, 76, 24, 121] and [0.305, 0.239, 0.0755, 0.3805]
cat 1: [170, 427, 173, 232] and [0.1697, 0.4261, 0.1727, 0.2315]
cat 2: [0, 12, 3, 9] and [0.0, 0.5, 0.125, 0.375]
cat 3: [27, 121, 41, 357] and [0.0495, 0.2216, 0.0751, 0.6538]
[train epoch 22/100] | loss 1.1634 | nw acc 0.476 | time 2 min 36 sec
cat 0: [201, 80, 38, 88] and [0.4939, 0.1966, 0.0934, 0.2162]
cat 1: [648, 1552, 581, 908] and [0.1757, 0.4207, 0.1575, 0.2461]
cat 2: [7, 11, 7, 13] and [0.1842, 0.2895, 0.1842, 0.3421]
cat 3: [319, 898, 339, 1866] and [0.0932, 0.2624, 0.0991, 0.5453]
[test epoch 22/100] | loss 0.3 | nw acc 0.444 | time 0 min 39 sec
cat 0: [83, 39, 12, 70] and [0.4069, 0.1912, 0.0588, 0.3431]
cat 1: [199, 520, 208, 399] and [0.1501, 0.3922, 0.1569, 0.3009]
cat 2: [0, 1, 0, 1] and [0.0, 0.5, 0.0, 0.5]
cat 3: [12, 76, 21, 249] and [0.0335, 0.2123, 0.0587, 0.6955]
[train epoch 23/100] | loss 1.1589 | nw acc 0.476 | time 2 min 35 sec
cat 0: [199, 77, 22, 96] and [0.5051, 0.1954, 0.0558, 0.2437]
cat 1: [658, 1521, 579, 858] and [0.182, 0.4206, 0.1601, 0.2373]
cat 2: [4, 31, 11, 24] and [0.0571, 0.4429, 0.1571, 0.3429]
cat 3: [314, 912, 353, 1897] and [0.0903, 0.2624, 0.1016, 0.5457]
[test epoch 23/100] | loss 0.291 | nw acc 0.434 | time 0 min 39 sec
cat 0: [83, 40, 10, 72] and [0.4049, 0.1951, 0.0488, 0.3512]
cat 1: [190, 522, 204, 413] and [0.143, 0.3928, 0.1535, 0.3108]
cat 2: [1, 6, 2, 8] and [0.0588, 0.3529, 0.1176, 0.4706]
cat 3: [20, 68, 25, 226] and [0.059, 0.2006, 0.0737, 0.6667]
[train epoch 24/100] | loss 1.162 | nw acc 0.479 | time 2 min 35 sec
cat 0: [178, 52, 19, 66] and [0.5651, 0.1651, 0.0603, 0.2095]
cat 1: [647, 1522, 563, 851] and [0.1806, 0.4248, 0.1571, 0.2375]
cat 2: [11, 34, 19, 29] and [0.1183, 0.3656, 0.2043, 0.3118]
cat 3: [339, 933, 364, 1929] and [0.0951, 0.2617, 0.1021, 0.5411]
[test epoch 24/100] | loss 0.292 | nw acc 0.459 | time 0 min 38 sec
cat 0: [91, 55, 18, 82] and [0.3699, 0.2236, 0.0732, 0.3333]
cat 1: [179, 450, 191, 285] and [0.162, 0.4072, 0.1729, 0.2579]
cat 2: [2, 6, 3, 15] and [0.0769, 0.2308, 0.1154, 0.5769]
cat 3: [22, 125, 29, 337] and [0.0429, 0.2437, 0.0565, 0.6569]
[train epoch 25/100] | loss 1.158 | nw acc 0.48 | time 2 min 38 sec
cat 0: [219, 73, 13, 95] and [0.5475, 0.1825, 0.0325, 0.2375]
cat 1: [643, 1521, 593, 851] and [0.1782, 0.4216, 0.1644, 0.2359]
cat 2: [19, 31, 31, 44] and [0.152, 0.248, 0.248, 0.352]
cat 3: [294, 916, 328, 1885] and [0.0859, 0.2676, 0.0958, 0.5507]
[test epoch 25/100] | loss 0.302 | nw acc 0.424 | time 0 min 39 sec
cat 0: [108, 49, 18, 85] and [0.4154, 0.1885, 0.0692, 0.3269]
cat 1: [180, 545, 210, 464] and [0.1287, 0.3896, 0.1501, 0.3317]
cat 2: [2, 3, 1, 10] and [0.125, 0.1875, 0.0625, 0.625]
cat 3: [4, 39, 12, 160] and [0.0186, 0.1814, 0.0558, 0.7442]
[train epoch 26/100] | loss 1.1614 | nw acc 0.485 | time 2 min 36 sec
cat 0: [233, 65, 41, 96] and [0.5356, 0.1494, 0.0943, 0.2207]
cat 1: [659, 1585, 595, 886] and [0.1769, 0.4255, 0.1597, 0.2379]
cat 2: [2, 13, 11, 25] and [0.0392, 0.2549, 0.2157, 0.4902]
cat 3: [281, 878, 318, 1868] and [0.084, 0.2625, 0.0951, 0.5584]
[test epoch 26/100] | loss 0.281 | nw acc 0.468 | time 0 min 38 sec
cat 0: [76, 27, 7, 42] and [0.5, 0.1776, 0.0461, 0.2763]
cat 1: [191, 407, 187, 258] and [0.1831, 0.3902, 0.1793, 0.2474]
cat 2: [0, 5, 0, 3] and [0.0, 0.625, 0.0, 0.375]
cat 3: [27, 197, 47, 416] and [0.0393, 0.2868, 0.0684, 0.6055]
[train epoch 27/100] | loss 1.1464 | nw acc 0.48 | time 2 min 31 sec
cat 0: [241, 92, 37, 98] and [0.515, 0.1966, 0.0791, 0.2094]
cat 1: [661, 1514, 610, 868] and [0.1809, 0.4145, 0.167, 0.2376]
cat 2: [13, 26, 14, 19] and [0.1806, 0.3611, 0.1944, 0.2639]
cat 3: [260, 909, 304, 1890] and [0.0773, 0.2703, 0.0904, 0.562]
[test epoch 27/100] | loss 0.292 | nw acc 0.444 | time 0 min 39 sec
cat 0: [86, 34, 14, 68] and [0.4257, 0.1683, 0.0693, 0.3366]
cat 1: [190, 485, 187, 357] and [0.1559, 0.3979, 0.1534, 0.2929]
cat 2: [1, 13, 9, 22] and [0.0222, 0.2889, 0.2, 0.4889]
cat 3: [17, 104, 31, 272] and [0.0401, 0.2453, 0.0731, 0.6415]
[train epoch 28/100] | loss 1.1644 | nw acc 0.479 | time 2 min 35 sec
cat 0: [225, 77, 38, 103] and [0.5079, 0.1738, 0.0858, 0.2325]
cat 1: [634, 1498, 575, 845] and [0.1785, 0.4217, 0.1619, 0.2379]
cat 2: [18, 40, 30, 35] and [0.1463, 0.3252, 0.2439, 0.2846]
cat 3: [298, 926, 322, 1892] and [0.0867, 0.2693, 0.0937, 0.5503]
[test epoch 28/100] | loss 0.291 | nw acc 0.451 | time 0 min 40 sec
cat 0: [99, 37, 14, 91] and [0.4108, 0.1535, 0.0581, 0.3776]
cat 1: [177, 498, 207, 361] and [0.1424, 0.4006, 0.1665, 0.2904]
cat 2: [0, 1, 1, 0] and [0.0, 0.5, 0.5, 0.0]
cat 3: [18, 100, 19, 267] and [0.0446, 0.2475, 0.047, 0.6609]
[train epoch 29/100] | loss 1.1553 | nw acc 0.48 | time 2 min 40 sec
cat 0: [228, 83, 26, 108] and [0.5124, 0.1865, 0.0584, 0.2427]
cat 1: [605, 1499, 581, 822] and [0.1725, 0.4274, 0.1657, 0.2344]
cat 2: [24, 36, 26, 39] and [0.192, 0.288, 0.208, 0.312]
cat 3: [318, 923, 332, 1906] and [0.0914, 0.2653, 0.0954, 0.5479]
[test epoch 29/100] | loss 0.288 | nw acc 0.463 | time 0 min 39 sec
cat 0: [108, 67, 17, 89] and [0.3843, 0.2384, 0.0605, 0.3167]
cat 1: [164, 429, 181, 279] and [0.1557, 0.4074, 0.1719, 0.265]
cat 2: [0, 1, 0, 0] and [0.0, 1.0, 0.0, 0.0]
cat 3: [22, 139, 43, 351] and [0.0396, 0.2505, 0.0775, 0.6324]
[train epoch 30/100] | loss 1.1464 | nw acc 0.485 | time 2 min 35 sec
cat 0: [257, 101, 48, 118] and [0.4905, 0.1927, 0.0916, 0.2252]
cat 1: [630, 1500, 573, 799] and [0.1799, 0.4283, 0.1636, 0.2282]
cat 2: [21, 49, 30, 51] and [0.1391, 0.3245, 0.1987, 0.3377]
cat 3: [267, 891, 314, 1907] and [0.079, 0.2637, 0.0929, 0.5644]
[test epoch 30/100] | loss 0.294 | nw acc 0.45 | time 0 min 37 sec
cat 0: [92, 36, 14, 68] and [0.4381, 0.1714, 0.0667, 0.3238]
cat 1: [193, 521, 192, 388] and [0.1491, 0.4026, 0.1484, 0.2998]
cat 2: [2, 16, 16, 28] and [0.0323, 0.2581, 0.2581, 0.4516]
cat 3: [7, 63, 19, 235] and [0.0216, 0.1944, 0.0586, 0.7253]
[train epoch 31/100] | loss 1.1423 | nw acc 0.49 | time 2 min 36 sec
cat 0: [253, 75, 35, 104] and [0.5418, 0.1606, 0.0749, 0.2227]
cat 1: [595, 1530, 545, 804] and [0.1713, 0.4404, 0.1569, 0.2314]
cat 2: [39, 66, 57, 74] and [0.1653, 0.2797, 0.2415, 0.3136]
cat 3: [288, 870, 328, 1893] and [0.0852, 0.2575, 0.0971, 0.5602]
[test epoch 31/100] | loss 0.289 | nw acc 0.448 | time 0 min 39 sec
cat 0: [85, 34, 19, 67] and [0.4146, 0.1659, 0.0927, 0.3268]
cat 1: [176, 432, 187, 305] and [0.16, 0.3927, 0.17, 0.2773]
cat 2: [1, 2, 3, 7] and [0.0769, 0.1538, 0.2308, 0.5385]
cat 3: [32, 168, 32, 340] and [0.0559, 0.2937, 0.0559, 0.5944]
[train epoch 32/100] | loss 1.1395 | nw acc 0.488 | time 2 min 35 sec
cat 0: [250, 91, 52, 111] and [0.496, 0.1806, 0.1032, 0.2202]
cat 1: [617, 1481, 528, 765] and [0.182, 0.4367, 0.1557, 0.2256]
cat 2: [25, 60, 51, 63] and [0.1256, 0.3015, 0.2563, 0.3166]
cat 3: [283, 909, 334, 1936] and [0.0817, 0.2626, 0.0965, 0.5592]
[test epoch 32/100] | loss 0.277 | nw acc 0.492 | time 0 min 36 sec
cat 0: [101, 37, 9, 59] and [0.4903, 0.1796, 0.0437, 0.2864]
cat 1: [169, 455, 187, 268] and [0.1566, 0.4217, 0.1733, 0.2484]
cat 2: [0, 5, 2, 6] and [0.0, 0.3846, 0.1538, 0.4615]
cat 3: [24, 139, 43, 386] and [0.0405, 0.2348, 0.0726, 0.652]
[train epoch 33/100] | loss 1.1426 | nw acc 0.484 | time 2 min 32 sec
cat 0: [247, 72, 36, 100] and [0.5429, 0.1582, 0.0791, 0.2198]
cat 1: [632, 1451, 539, 785] and [0.1855, 0.4259, 0.1582, 0.2304]
cat 2: [22, 60, 53, 57] and [0.1146, 0.3125, 0.276, 0.2969]
cat 3: [274, 958, 337, 1933] and [0.0782, 0.2736, 0.0962, 0.552]
[test epoch 33/100] | loss 0.294 | nw acc 0.483 | time 0 min 39 sec
cat 0: [149, 105, 45, 99] and [0.3744, 0.2638, 0.1131, 0.2487]
cat 1: [81, 249, 63, 82] and [0.1705, 0.5242, 0.1326, 0.1726]
cat 2: [47, 74, 76, 85] and [0.1667, 0.2624, 0.2695, 0.3014]
cat 3: [17, 208, 57, 453] and [0.0231, 0.283, 0.0776, 0.6163]
[train epoch 34/100] | loss 1.1438 | nw acc 0.491 | time 2 min 35 sec
cat 0: [279, 109, 54, 101] and [0.5138, 0.2007, 0.0994, 0.186]
cat 1: [536, 1387, 458, 688] and [0.1746, 0.4519, 0.1492, 0.2242]
cat 2: [60, 93, 77, 89] and [0.1881, 0.2915, 0.2414, 0.279]
cat 3: [300, 952, 376, 1997] and [0.0828, 0.2626, 0.1037, 0.5509]
[test epoch 34/100] | loss 0.283 | nw acc 0.466 | time 0 min 37 sec
cat 0: [104, 51, 20, 92] and [0.3895, 0.191, 0.0749, 0.3446]
cat 1: [167, 460, 181, 285] and [0.1528, 0.4209, 0.1656, 0.2608]
cat 2: [5, 16, 9, 20] and [0.1, 0.32, 0.18, 0.4]
cat 3: [18, 109, 31, 322] and [0.0375, 0.2271, 0.0646, 0.6708]
[train epoch 35/100] | loss 1.1203 | nw acc 0.499 | time 2 min 37 sec
cat 0: [339, 149, 71, 132] and [0.4906, 0.2156, 0.1027, 0.191]
cat 1: [500, 1374, 482, 681] and [0.1646, 0.4524, 0.1587, 0.2242]
cat 2: [66, 103, 101, 76] and [0.1908, 0.2977, 0.2919, 0.2197]
cat 3: [270, 915, 311, 1986] and [0.0775, 0.2628, 0.0893, 0.5704]
[test epoch 35/100] | loss 0.281 | nw acc 0.484 | time 0 min 40 sec
cat 0: [79, 15, 8, 43] and [0.5448, 0.1034, 0.0552, 0.2966]
cat 1: [197, 510, 183, 330] and [0.1615, 0.418, 0.15, 0.2705]
cat 2: [2, 19, 14, 20] and [0.0364, 0.3455, 0.2545, 0.3636]
cat 3: [16, 92, 36, 326] and [0.034, 0.1957, 0.0766, 0.6936]
[train epoch 36/100] | loss 1.1391 | nw acc 0.494 | time 2 min 37 sec
cat 0: [278, 91, 52, 90] and [0.544, 0.1781, 0.1018, 0.1761]
cat 1: [575, 1400, 487, 710] and [0.1813, 0.4414, 0.1535, 0.2238]
cat 2: [24, 74, 80, 68] and [0.0976, 0.3008, 0.3252, 0.2764]
cat 3: [298, 976, 346, 2007] and [0.0822, 0.2691, 0.0954, 0.5533]
[test epoch 36/100] | loss 0.285 | nw acc 0.481 | time 0 min 38 sec
cat 0: [133, 94, 47, 105] and [0.3509, 0.248, 0.124, 0.277]
cat 1: [137, 379, 138, 199] and [0.1606, 0.4443, 0.1618, 0.2333]
cat 2: [2, 14, 18, 21] and [0.0364, 0.2545, 0.3273, 0.3818]
cat 3: [22, 149, 38, 394] and [0.0365, 0.2471, 0.063, 0.6534]
[train epoch 37/100] | loss 1.1357 | nw acc 0.499 | time 2 min 37 sec
cat 0: [313, 99, 48, 121] and [0.5387, 0.1704, 0.0826, 0.2083]
cat 1: [571, 1477, 544, 744] and [0.1712, 0.4427, 0.1631, 0.223]
cat 2: [29, 40, 52, 50] and [0.1696, 0.2339, 0.3041, 0.2924]
cat 3: [262, 925, 321, 1960] and [0.0755, 0.2667, 0.0926, 0.5652]
[test epoch 37/100] | loss 0.278 | nw acc 0.477 | time 0 min 38 sec
cat 0: [79, 26, 13, 54] and [0.4593, 0.1512, 0.0756, 0.314]
cat 1: [181, 498, 184, 323] and [0.1526, 0.4199, 0.1551, 0.2723]
cat 2: [2, 2, 3, 6] and [0.1538, 0.1538, 0.2308, 0.4615]
cat 3: [32, 110, 41, 336] and [0.0617, 0.2119, 0.079, 0.6474]
[train epoch 38/100] | loss 1.1377 | nw acc 0.493 | time 2 min 37 sec
cat 0: [324, 109, 83, 154] and [0.4836, 0.1627, 0.1239, 0.2299]
cat 1: [472, 1342, 400, 647] and [0.165, 0.4691, 0.1398, 0.2261]
cat 2: [74, 140, 130, 116] and [0.1609, 0.3043, 0.2826, 0.2522]
cat 3: [305, 950, 352, 1958] and [0.0856, 0.2665, 0.0987, 0.5492]
[test epoch 38/100] | loss 0.277 | nw acc 0.517 | time 0 min 37 sec
cat 0: [137, 58, 29, 62] and [0.479, 0.2028, 0.1014, 0.2168]
cat 1: [129, 425, 143, 218] and [0.141, 0.4645, 0.1563, 0.2383]
cat 2: [5, 23, 22, 31] and [0.0617, 0.284, 0.2716, 0.3827]
cat 3: [23, 130, 47, 408] and [0.0378, 0.2138, 0.0773, 0.6711]
[train epoch 39/100] | loss 1.133 | nw acc 0.497 | time 2 min 36 sec
cat 0: [334, 148, 78, 147] and [0.4724, 0.2093, 0.1103, 0.2079]
cat 1: [500, 1389, 446, 689] and [0.1653, 0.4593, 0.1475, 0.2278]
cat 2: [57, 117, 106, 83] and [0.157, 0.3223, 0.292, 0.2287]
cat 3: [284, 887, 335, 1956] and [0.082, 0.2562, 0.0968, 0.565]
[test epoch 39/100] | loss 0.275 | nw acc 0.518 | time 0 min 38 sec
cat 0: [151, 56, 27, 81] and [0.4794, 0.1778, 0.0857, 0.2571]
cat 1: [119, 406, 159, 189] and [0.1363, 0.4651, 0.1821, 0.2165]
cat 2: [3, 10, 4, 16] and [0.0909, 0.303, 0.1212, 0.4848]
cat 3: [21, 164, 51, 433] and [0.0314, 0.2451, 0.0762, 0.6472]
[train epoch 40/100] | loss 1.1251 | nw acc 0.514 | time 2 min 34 sec
cat 0: [333, 120, 65, 121] and [0.5211, 0.1878, 0.1017, 0.1894]
cat 1: [456, 1385, 417, 592] and [0.16, 0.486, 0.1463, 0.2077]
cat 2: [74, 129, 158, 126] and [0.152, 0.2649, 0.3244, 0.2587]
cat 3: [312, 907, 325, 2036] and [0.0872, 0.2534, 0.0908, 0.5687]
[test epoch 40/100] | loss 0.279 | nw acc 0.517 | time 0 min 39 sec
cat 0: [121, 46, 17, 84] and [0.4515, 0.1716, 0.0634, 0.3134]
cat 1: [86, 362, 48, 164] and [0.1303, 0.5485, 0.0727, 0.2485]
cat 2: [70, 105, 139, 101] and [0.1687, 0.253, 0.3349, 0.2434]
cat 3: [17, 123, 37, 370] and [0.0311, 0.2249, 0.0676, 0.6764]
[train epoch 41/100] | loss 1.1317 | nw acc 0.494 | time 2 min 33 sec
cat 0: [335, 147, 68, 134] and [0.4898, 0.2149, 0.0994, 0.1959]
cat 1: [484, 1347, 416, 668] and [0.166, 0.4621, 0.1427, 0.2292]
cat 2: [73, 105, 129, 118] and [0.1718, 0.2471, 0.3035, 0.2776]
cat 3: [283, 942, 352, 1955] and [0.0801, 0.2667, 0.0997, 0.5535]
[test epoch 41/100] | loss 0.274 | nw acc 0.514 | time 0 min 39 sec
cat 0: [108, 35, 12, 41] and [0.551, 0.1786, 0.0612, 0.2092]
cat 1: [151, 433, 168, 236] and [0.1528, 0.4383, 0.17, 0.2389]
cat 2: [7, 20, 21, 17] and [0.1077, 0.3077, 0.3231, 0.2615]
cat 3: [28, 148, 40, 425] and [0.0437, 0.2309, 0.0624, 0.663]
[train epoch 42/100] | loss 1.1169 | nw acc 0.505 | time 2 min 33 sec
cat 0: [336, 138, 66, 127] and [0.5037, 0.2069, 0.099, 0.1904]
cat 1: [439, 1341, 417, 610] and [0.1564, 0.4777, 0.1486, 0.2173]
cat 2: [99, 143, 129, 95] and [0.2124, 0.3069, 0.2768, 0.2039]
cat 3: [301, 919, 353, 2043] and [0.0832, 0.2541, 0.0976, 0.565]
[test epoch 42/100] | loss 0.263 | nw acc 0.548 | time 0 min 38 sec
cat 0: [122, 32, 14, 45] and [0.5728, 0.1502, 0.0657, 0.2113]
cat 1: [120, 408, 115, 157] and [0.15, 0.51, 0.1437, 0.1963]
cat 2: [17, 36, 54, 48] and [0.1097, 0.2323, 0.3484, 0.3097]
cat 3: [35, 160, 58, 469] and [0.0485, 0.2216, 0.0803, 0.6496]
[train epoch 43/100] | loss 1.1245 | nw acc 0.504 | time 2 min 36 sec
cat 0: [313, 122, 55, 129] and [0.5057, 0.1971, 0.0889, 0.2084]
cat 1: [484, 1401, 468, 624] and [0.1626, 0.4706, 0.1572, 0.2096]
cat 2: [77, 105, 115, 115] and [0.1869, 0.2549, 0.2791, 0.2791]
cat 3: [301, 913, 327, 2007] and [0.0848, 0.2573, 0.0922, 0.5657]
[test epoch 43/100] | loss 0.275 | nw acc 0.511 | time 0 min 39 sec
cat 0: [140, 52, 31, 71] and [0.4762, 0.1769, 0.1054, 0.2415]
cat 1: [138, 442, 165, 246] and [0.1393, 0.446, 0.1665, 0.2482]
cat 2: [1, 3, 10, 13] and [0.037, 0.1111, 0.3704, 0.4815]
cat 3: [15, 139, 35, 389] and [0.026, 0.2405, 0.0606, 0.673]
[train epoch 44/100] | loss 1.1239 | nw acc 0.502 | time 2 min 34 sec
cat 0: [323, 125, 61, 99] and [0.5312, 0.2056, 0.1003, 0.1628]
cat 1: [467, 1351, 405, 660] and [0.162, 0.4686, 0.1405, 0.2289]
cat 2: [95, 116, 133, 100] and [0.214, 0.2613, 0.2995, 0.2252]
cat 3: [290, 949, 366, 2016] and [0.0801, 0.2621, 0.1011, 0.5568]
[test epoch 44/100] | loss 0.279 | nw acc 0.523 | time 0 min 37 sec
cat 0: [192, 110, 73, 121] and [0.3871, 0.2218, 0.1472, 0.244]
cat 1: [75, 348, 85, 139] and [0.1159, 0.5379, 0.1314, 0.2148]
cat 2: [7, 25, 35, 29] and [0.0729, 0.2604, 0.3646, 0.3021]
cat 3: [20, 153, 48, 430] and [0.0307, 0.235, 0.0737, 0.6605]
[train epoch 45/100] | loss 1.1281 | nw acc 0.499 | time 2 min 37 sec
cat 0: [350, 121, 76, 121] and [0.524, 0.1811, 0.1138, 0.1811]
cat 1: [483, 1371, 441, 680] and [0.1624, 0.4608, 0.1482, 0.2286]
cat 2: [78, 126, 124, 118] and [0.1749, 0.2825, 0.278, 0.2646]
cat 3: [264, 923, 324, 1956] and [0.0761, 0.2662, 0.0935, 0.5642]
[test epoch 45/100] | loss 0.282 | nw acc 0.496 | time 0 min 40 sec
cat 0: [116, 57, 28, 85] and [0.4056, 0.1993, 0.0979, 0.2972]
cat 1: [143, 409, 140, 214] and [0.1578, 0.4514, 0.1545, 0.2362]
cat 2: [6, 38, 47, 40] and [0.0458, 0.2901, 0.3588, 0.3053]
cat 3: [29, 132, 26, 380] and [0.0511, 0.2328, 0.0459, 0.6702]
[train epoch 46/100] | loss 1.1091 | nw acc 0.514 | time 2 min 28 sec
cat 0: [387, 128, 98, 129] and [0.5216, 0.1725, 0.1321, 0.1739]
cat 1: [426, 1335, 370, 586] and [0.1568, 0.4914, 0.1362, 0.2157]
cat 2: [86, 122, 159, 129] and [0.1734, 0.246, 0.3206, 0.2601]
cat 3: [276, 956, 338, 2031] and [0.0766, 0.2655, 0.0939, 0.564]
[test epoch 46/100] | loss 0.283 | nw acc 0.508 | time 0 min 40 sec
cat 0: [101, 29, 28, 39] and [0.5127, 0.1472, 0.1421, 0.198]
cat 1: [121, 392, 103, 214] and [0.1458, 0.4723, 0.1241, 0.2578]
cat 2: [13, 38, 45, 28] and [0.1048, 0.3065, 0.3629, 0.2258]
cat 3: [59, 177, 65, 438] and [0.0798, 0.2395, 0.088, 0.5927]
[train epoch 47/100] | loss 1.1166 | nw acc 0.515 | time 2 min 54 sec
cat 0: [378, 138, 103, 138] and [0.4993, 0.1823, 0.1361, 0.1823]
cat 1: [401, 1387, 374, 609] and [0.1447, 0.5005, 0.135, 0.2198]
cat 2: [97, 129, 149, 117] and [0.1972, 0.2622, 0.3028, 0.2378]
cat 3: [299, 887, 339, 2011] and [0.0846, 0.2508, 0.0959, 0.5687]
[test epoch 47/100] | loss 0.273 | nw acc 0.516 | time 1 min 1 sec
cat 0: [169, 85, 59, 125] and [0.3858, 0.1941, 0.1347, 0.2854]
cat 1: [87, 403, 112, 188] and [0.1101, 0.5101, 0.1418, 0.238]
cat 2: [13, 22, 38, 25] and [0.1327, 0.2245, 0.3878, 0.2551]
cat 3: [25, 126, 32, 381] and [0.0443, 0.2234, 0.0567, 0.6755]
[train epoch 48/100] | loss 1.1169 | nw acc 0.519 | time 2 min 53 sec
cat 0: [389, 172, 100, 170] and [0.4681, 0.207, 0.1203, 0.2046]
cat 1: [402, 1359, 360, 547] and [0.1507, 0.5094, 0.1349, 0.205]
cat 2: [96, 129, 193, 143] and [0.1711, 0.2299, 0.344, 0.2549]
cat 3: [288, 881, 312, 2015] and [0.0824, 0.252, 0.0892, 0.5764]
[test epoch 48/100] | loss 0.279 | nw acc 0.538 | time 0 min 38 sec
cat 0: [156, 75, 41, 88] and [0.4333, 0.2083, 0.1139, 0.2444]
cat 1: [73, 422, 81, 220] and [0.0917, 0.5302, 0.1018, 0.2764]
cat 2: [46, 54, 98, 54] and [0.1825, 0.2143, 0.3889, 0.2143]
cat 3: [19, 85, 21, 357] and [0.0394, 0.1763, 0.0436, 0.7407]
[train epoch 49/100] | loss 1.1097 | nw acc 0.51 | time 2 min 49 sec
cat 0: [365, 136, 69, 139] and [0.5148, 0.1918, 0.0973, 0.1961]
cat 1: [427, 1369, 415, 609] and [0.1514, 0.4855, 0.1472, 0.216]
cat 2: [100, 153, 141, 121] and [0.1942, 0.2971, 0.2738, 0.235]
cat 3: [283, 883, 340, 2006] and [0.0806, 0.2514, 0.0968, 0.5712]
[test epoch 49/100] | loss 0.264 | nw acc 0.546 | time 0 min 51 sec
cat 0: [134, 31, 22, 62] and [0.5382, 0.1245, 0.0884, 0.249]
cat 1: [111, 430, 134, 173] and [0.1309, 0.5071, 0.158, 0.204]
cat 2: [12, 28, 28, 27] and [0.1263, 0.2947, 0.2947, 0.2842]
cat 3: [37, 147, 57, 457] and [0.053, 0.2106, 0.0817, 0.6547]
[train epoch 50/100] | loss 1.1124 | nw acc 0.52 | time 2 min 39 sec
cat 0: [371, 149, 70, 131] and [0.5146, 0.2067, 0.0971, 0.1817]
cat 1: [424, 1414, 426, 620] and [0.147, 0.4903, 0.1477, 0.215]
cat 2: [93, 131, 152, 104] and [0.1938, 0.2729, 0.3167, 0.2167]
cat 3: [287, 847, 317, 2020] and [0.0827, 0.244, 0.0913, 0.582]
[test epoch 50/100] | loss 0.273 | nw acc 0.533 | time 0 min 37 sec
cat 0: [116, 38, 23, 54] and [0.5022, 0.1645, 0.0996, 0.2338]
cat 1: [101, 379, 99, 160] and [0.1367, 0.5129, 0.134, 0.2165]
cat 2: [28, 50, 64, 41] and [0.153, 0.2732, 0.3497, 0.224]
cat 3: [49, 169, 55, 464] and [0.0665, 0.2293, 0.0746, 0.6296]
[train epoch 51/100] | loss 1.1106 | nw acc 0.508 | time 2 min 43 sec
cat 0: [378, 125, 84, 116] and [0.5377, 0.1778, 0.1195, 0.165]
cat 1: [390, 1316, 376, 598] and [0.1455, 0.491, 0.1403, 0.2231]
cat 2: [104, 154, 147, 131] and [0.194, 0.2873, 0.2743, 0.2444]
cat 3: [303, 946, 358, 2030] and [0.0833, 0.2601, 0.0984, 0.5582]
[test epoch 51/100] | loss 0.268 | nw acc 0.525 | time 0 min 28 sec
cat 0: [126, 56, 25, 80] and [0.439, 0.1951, 0.0871, 0.2787]
cat 1: [124, 434, 132, 211] and [0.1376, 0.4817, 0.1465, 0.2342]
cat 2: [22, 25, 48, 28] and [0.1789, 0.2033, 0.3902, 0.2276]
cat 3: [22, 121, 36, 400] and [0.038, 0.209, 0.0622, 0.6908]
[train epoch 52/100] | loss 1.0943 | nw acc 0.526 | time 2 min 40 sec
cat 0: [415, 167, 83, 158] and [0.5043, 0.2029, 0.1009, 0.192]
cat 1: [391, 1409, 366, 611] and [0.1408, 0.5074, 0.1318, 0.22]
cat 2: [93, 136, 194, 115] and [0.1729, 0.2528, 0.3606, 0.2138]
cat 3: [276, 829, 322, 1991] and [0.0807, 0.2425, 0.0942, 0.5825]
[test epoch 52/100] | loss 0.27 | nw acc 0.537 | time 0 min 39 sec
cat 0: [193, 88, 63, 110] and [0.4251, 0.1938, 0.1388, 0.2423]
cat 1: [69, 388, 109, 158] and [0.0953, 0.5359, 0.1506, 0.2182]
cat 2: [10, 29, 37, 38] and [0.0877, 0.2544, 0.3246, 0.3333]
cat 3: [22, 131, 32, 413] and [0.0368, 0.2191, 0.0535, 0.6906]
[train epoch 53/100] | loss 1.1022 | nw acc 0.519 | time 2 min 39 sec
cat 0: [386, 142, 79, 135] and [0.5202, 0.1914, 0.1065, 0.1819]
cat 1: [422, 1407, 355, 636] and [0.1496, 0.4989, 0.1259, 0.2255]
cat 2: [88, 123, 163, 108] and [0.1826, 0.2552, 0.3382, 0.2241]
cat 3: [279, 869, 368, 1996] and [0.0794, 0.2474, 0.1048, 0.5683]
[test epoch 53/100] | loss 0.283 | nw acc 0.51 | time 0 min 41 sec
cat 0: [147, 68, 35, 114] and [0.4038, 0.1868, 0.0962, 0.3132]
cat 1: [112, 390, 128, 162] and [0.1414, 0.4924, 0.1616, 0.2045]
cat 2: [0, 6, 8, 9] and [0.0, 0.2609, 0.3478, 0.3913]
cat 3: [35, 172, 70, 434] and [0.0492, 0.2419, 0.0985, 0.6104]
[train epoch 54/100] | loss 1.1048 | nw acc 0.519 | time 2 min 35 sec
cat 0: [412, 156, 74, 161] and [0.5131, 0.1943, 0.0922, 0.2005]
cat 1: [434, 1393, 414, 591] and [0.1532, 0.4919, 0.1462, 0.2087]
cat 2: [82, 118, 144, 117] and [0.1779, 0.256, 0.3124, 0.2538]
cat 3: [247, 874, 333, 2006] and [0.0714, 0.2526, 0.0962, 0.5798]
[test epoch 54/100] | loss 0.265 | nw acc 0.554 | time 0 min 39 sec
cat 0: [157, 65, 38, 86] and [0.4538, 0.1879, 0.1098, 0.2486]
cat 1: [80, 363, 80, 110] and [0.1264, 0.5735, 0.1264, 0.1738]
cat 2: [8, 38, 54, 33] and [0.0602, 0.2857, 0.406, 0.2481]
cat 3: [49, 170, 69, 490] and [0.063, 0.2185, 0.0887, 0.6298]
[train epoch 55/100] | loss 1.1003 | nw acc 0.524 | time 2 min 35 sec
cat 0: [405, 177, 114, 142] and [0.4833, 0.2112, 0.136, 0.1695]
cat 1: [396, 1396, 339, 600] and [0.145, 0.5112, 0.1241, 0.2197]
cat 2: [84, 138, 169, 110] and [0.1677, 0.2754, 0.3373, 0.2196]
cat 3: [290, 830, 343, 2023] and [0.0832, 0.2381, 0.0984, 0.5803]
[test epoch 55/100] | loss 0.274 | nw acc 0.552 | time 0 min 41 sec
cat 0: [166, 61, 26, 88] and [0.4868, 0.1789, 0.0762, 0.2581]
cat 1: [51, 375, 57, 158] and [0.0796, 0.585, 0.0889, 0.2465]
cat 2: [64, 95, 142, 97] and [0.1608, 0.2387, 0.3568, 0.2437]
cat 3: [13, 105, 16, 376] and [0.0255, 0.2059, 0.0314, 0.7373]
[train epoch 56/100] | loss 1.0966 | nw acc 0.529 | time 2 min 49 sec
cat 0: [433, 198, 109, 171] and [0.4753, 0.2173, 0.1196, 0.1877]
cat 1: [385, 1382, 349, 558] and [0.144, 0.5168, 0.1305, 0.2087]
cat 2: [72, 104, 163, 93] and [0.1667, 0.2407, 0.3773, 0.2153]
cat 3: [285, 857, 344, 2053] and [0.0805, 0.2422, 0.0972, 0.5801]
[test epoch 56/100] | loss 0.267 | nw acc 0.551 | time 0 min 39 sec
cat 0: [181, 87, 57, 79] and [0.448, 0.2153, 0.1411, 0.1955]
cat 1: [50, 271, 37, 67] and [0.1176, 0.6376, 0.0871, 0.1576]
cat 2: [20, 54, 80, 48] and [0.099, 0.2673, 0.396, 0.2376]
cat 3: [43, 224, 67, 525] and [0.0501, 0.2608, 0.078, 0.6112]
[train epoch 57/100] | loss 1.0967 | nw acc 0.521 | time 2 min 35 sec
cat 0: [403, 177, 99, 151] and [0.4855, 0.2133, 0.1193, 0.1819]
cat 1: [385, 1327, 347, 546] and [0.1478, 0.5094, 0.1332, 0.2096]
cat 2: [99, 151, 180, 118] and [0.1807, 0.2755, 0.3285, 0.2153]
cat 3: [288, 886, 339, 2060] and [0.0806, 0.248, 0.0949, 0.5765]
[test epoch 57/100] | loss 0.266 | nw acc 0.56 | time 0 min 39 sec
cat 0: [150, 69, 33, 72] and [0.463, 0.213, 0.1019, 0.2222]
cat 1: [87, 389, 86, 144] and [0.1232, 0.551, 0.1218, 0.204]
cat 2: [23, 35, 71, 37] and [0.1386, 0.2108, 0.4277, 0.2229]
cat 3: [34, 143, 51, 466] and [0.049, 0.2061, 0.0735, 0.6715]
[train epoch 58/100] | loss 1.0961 | nw acc 0.529 | time 2 min 29 sec
cat 0: [411, 175, 112, 151] and [0.4841, 0.2061, 0.1319, 0.1779]
cat 1: [388, 1386, 372, 569] and [0.1429, 0.5105, 0.137, 0.2096]
cat 2: [82, 117, 174, 96] and [0.1748, 0.2495, 0.371, 0.2047]
cat 3: [294, 863, 307, 2059] and [0.0835, 0.245, 0.0871, 0.5844]
[test epoch 58/100] | loss 0.261 | nw acc 0.583 | time 0 min 38 sec
cat 0: [173, 71, 35, 79] and [0.4832, 0.1983, 0.0978, 0.2207]
cat 1: [43, 301, 39, 65] and [0.096, 0.6719, 0.0871, 0.1451]
cat 2: [34, 82, 117, 46] and [0.1219, 0.2939, 0.4194, 0.1649]
cat 3: [44, 182, 50, 529] and [0.0547, 0.2261, 0.0621, 0.6571]
[train epoch 59/100] | loss 1.0985 | nw acc 0.529 | time 2 min 35 sec
cat 0: [403, 154, 123, 139] and [0.4921, 0.188, 0.1502, 0.1697]
cat 1: [410, 1400, 382, 591] and [0.1473, 0.5031, 0.1373, 0.2124]
cat 2: [82, 116, 149, 68] and [0.1976, 0.2795, 0.359, 0.1639]
cat 3: [280, 871, 311, 2077] and [0.0791, 0.2461, 0.0879, 0.5869]
[test epoch 59/100] | loss 0.266 | nw acc 0.561 | time 0 min 41 sec
cat 0: [183, 95, 69, 98] and [0.4112, 0.2135, 0.1551, 0.2202]
cat 1: [76, 395, 72, 154] and [0.109, 0.5667, 0.1033, 0.2209]
cat 2: [14, 32, 67, 34] and [0.0952, 0.2177, 0.4558, 0.2313]
cat 3: [21, 114, 33, 433] and [0.0349, 0.1897, 0.0549, 0.7205]
[train epoch 60/100] | loss 1.093 | nw acc 0.528 | time 2 min 35 sec
cat 0: [421, 168, 82, 151] and [0.5122, 0.2044, 0.0998, 0.1837]
cat 1: [374, 1350, 362, 563] and [0.1412, 0.5096, 0.1367, 0.2125]
cat 2: [70, 142, 172, 82] and [0.1502, 0.3047, 0.3691, 0.176]
cat 3: [310, 881, 349, 2079] and [0.0857, 0.2434, 0.0964, 0.5745]
[test epoch 60/100] | loss 0.257 | nw acc 0.576 | time 0 min 40 sec
cat 0: [176, 68, 46, 84] and [0.4706, 0.1818, 0.123, 0.2246]
cat 1: [44, 282, 36, 53] and [0.106, 0.6795, 0.0867, 0.1277]
cat 2: [20, 53, 89, 24] and [0.1075, 0.2849, 0.4785, 0.129]
cat 3: [54, 233, 70, 558] and [0.059, 0.2546, 0.0765, 0.6098]
[train epoch 61/100] | loss 1.0912 | nw acc 0.535 | time 2 min 34 sec
cat 0: [453, 215, 131, 181] and [0.4622, 0.2194, 0.1337, 0.1847]
cat 1: [375, 1359, 330, 511] and [0.1456, 0.5278, 0.1282, 0.1984]
cat 2: [91, 120, 176, 93] and [0.1896, 0.25, 0.3667, 0.1938]
cat 3: [256, 847, 328, 2090] and [0.0727, 0.2406, 0.0932, 0.5936]
[test epoch 61/100] | loss 0.26 | nw acc 0.578 | time 0 min 40 sec
cat 0: [123, 48, 13, 45] and [0.5371, 0.2096, 0.0568, 0.1965]
cat 1: [42, 309, 37, 68] and [0.0921, 0.6776, 0.0811, 0.1491]
cat 2: [71, 108, 131, 59] and [0.1924, 0.2927, 0.355, 0.1599]
cat 3: [58, 171, 60, 547] and [0.0694, 0.2045, 0.0718, 0.6543]
